[
  {
    "title": "Bliv en skarpere investor med Keystones: Sådan guider netværket dig fra første investering til vellykket exit",
    "link": "https://techsavvy.media/bliv-en-skarpere-investor-med-keystones-saadan-guider-netvaerket-dig-fra-foerste-investering-til-vellykket-exit/",
    "summary": "Som business angel har Camilla Frost fundet både værdi og værktøjer i Keystones’ netværk. På bare ét år har hun fået adgang til praktisk viden,... Indlægget Bliv en skarpere investor med Keystones: Sådan guider netværket dig fra første investering til vellykket exit blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 09:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Hunome is for humans, by humans, and about humans.",
    "link": "https://nordicstartupnews.com/hunome-is-for-humans-by-humans-and-about-humans/",
    "summary": "In the era of AI, Hunome talks mostly about HI   So, at Arctic15 we met many AI companies, and then we met Hunome, more into Human Intelligence, HI, and especially for Collective Sensemaking.  With that, and a bit wider purpose statement of “helping humanity make sense of itself”, I had a pleasure to talk … The post Hunome is for humans, by humans, and about humans. appeared first on Nordic Startup News .",
    "published": "Tue, 11 Jun 2024 10:38:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s StemSight, first human stem cell startup from Finland, announces seed funding round",
    "link": "https://nordicstartupnews.com/finlands-stemsight-first-human-stem-cell-startup-from-finland-announces-seed-funding-round/",
    "summary": "All female founded StemSight is the first human stem cell startup from Finland to receive funding,  announcing a €500000 seed round from Voima Ventures. Stemsight aims to help over 12 million people suffer from corneal blindness regain their sight.   The all female-founded team, based in Tampere, has announced a new seed round from the DeepTech … The post Finland’s StemSight, first human stem cell startup from Finland, announces seed funding round appeared first on Nordic Startup News .",
    "published": "Wed, 15 Sep 2021 07:41:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Young Sustainable Impact (YSI) is Nominated for the Best Social Impact Award by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/ysi-nordic-startup-awards/",
    "summary": "The Youth of Today Is the Future of tomorrow No matter how hard the generations of yesterday tried to rid the world of poverty, hunger, water scarcity, lack of healthcare and plethora of other problems, the fact is many of the challenges still remain active and the responsibility to solve them now lies before the … The post Young Sustainable Impact (YSI) is Nominated for the Best Social Impact Award by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Mon, 13 Aug 2018 06:26:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "For art and antique collectors, Danish entrepreneurs brings “What’s it worth” concept online",
    "link": "https://nordicstartupnews.com/art-antique-collectors-danish-entrepreneurs-brings-whats-worth-concept-online/",
    "summary": "The Danish startup Mearto, started by entrepreneurs, Mads Hallas Bjerg and Johan Laidlaw, have created an online appraisal, or “what’s it worth” service, that helps people find the value of art and antiques. The interest for art and antiques is rising. Countless television shows like Antiques Roadshow captivate people at home when the hunt for … The post For art and antique collectors, Danish entrepreneurs brings “What’s it worth” concept online appeared first on Nordic Startup News .",
    "published": "Thu, 29 Mar 2018 13:07:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Your Royal Gayness mixes parody with sexual diversity",
    "link": "https://nordicstartupnews.com/royal-gayness-mixes-parody-sexual-diversity/",
    "summary": "Lizard Hazard Games, a small indie studio from Finland, has launched its Kickstarter-funded PC game called Your Royal Gayness. The game is a story-driven parody game with a strong message about acceptance of sexual diversity. “The subject of Your Royal Gayness is very personal to me. I’m a queer woman and while I’m fortunate to … The post Your Royal Gayness mixes parody with sexual diversity appeared first on Nordic Startup News .",
    "published": "Tue, 30 Jan 2018 09:26:39 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finding “the one” at Arctic15",
    "link": "https://nordicstartupnews.com/finding-one-arctic15/",
    "summary": "Last weeks Arctic 15 three day event succeeded in offering a glimpse into the bright future of the Nordics as hundreds of investors, startups and corporates converged once again in the familiar old industrial complex of Kaapelitehdas the ‘Cable Factory’ in western Helsinki. Arctic 15 has grown steadily since its first event in 2011 and … The post Finding “the one” at Arctic15 appeared first on Nordic Startup News .",
    "published": "Tue, 09 May 2017 12:13:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why women in tech are tempted to leave Silicon Valley for Norway",
    "link": "https://nordicstartupnews.com/women-tech-tempted-leave-silicon-valley-norway/",
    "summary": "As Norway tops quality of life and gender equality indexes consistently, it is no surprise that more and more women are looking to leave Silicon Valley – and the bro-culture that dominates the valley- behind for beautiful fjords and generous paternal leave.  We interview 4 women who took the plunge and embraced the Nordic lifestyle. … The post Why women in tech are tempted to leave Silicon Valley for Norway appeared first on Nordic Startup News .",
    "published": "Thu, 09 Mar 2017 11:24:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Lessons from Oslo Innovation Week: Techfugees, Girls Tech Fest, and more",
    "link": "https://nordicstartupnews.com/61934/",
    "summary": "It was perhaps significant that the recent Oslo Innovation Week (OIW) five-day series of events was preceded by a forty-eight hour Techfugees hackathon where more than one hundred data scientists, engineers, user experience designers and entrepreneurs united in teams to build prototypes alongside refugees, to find solutions to enable better integration into Norwegian society. the … The post Lessons from Oslo Innovation Week: Techfugees, Girls Tech Fest, and more appeared first on Nordic Startup News .",
    "published": "Tue, 01 Nov 2016 05:37:33 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "TechBBQ reflections: In the future, recruitment will be big business",
    "link": "https://nordicstartupnews.com/techbbq-reflections-future-recruitment-will-big-business/",
    "summary": "At TechBBQ 2016 in Copenhagen, Denmark, the changing labor market was a hot topic.  The company Praice, who make recruitment software, took the stage to talk about the “Future of Work”. For many years, recruitment agencies and headhunters lived well by finding the right candidates for businesses.  Now, more and more tech startups are working … The post TechBBQ reflections: In the future, recruitment will be big business appeared first on Nordic Startup News .",
    "published": "Mon, 10 Oct 2016 08:10:40 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Jeanne Sullivan on female entrepreneurship, from Oslo to New York",
    "link": "https://nordicstartupnews.com/jeanne-sullivan-female-entrepreneurship-oslo-new-york/",
    "summary": "When visiting Oslo Innovation Week last October, long-time business development investor Jeanne Sullivan was intrigued by the commercial potential she found in the various presenters, taking note of one company in particular. Bubbly, founded by Marianne Hindsgaul from Oslo, is a startup introducing an IoT kiosk to the market that utilizes data that is collected … The post Jeanne Sullivan on female entrepreneurship, from Oslo to New York appeared first on Nordic Startup News .",
    "published": "Mon, 26 Sep 2016 07:45:48 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why founders make bullshit competitor slides and how to do it right",
    "link": "https://nordicstartupnews.com/why-founders-make-bullshit-competitor-slides-and-how-to-do-it-right/",
    "summary": "Pitch doctors will help you to make cool competitor slides. This post will not. Instead it will do the opposite. It will deconstruct competition into what really matters. In the process I will offend you. I will use examples involving your wife. I will use women as examples. Some will find it objectifying and sexists. … The post Why founders make bullshit competitor slides and how to do it right appeared first on Nordic Startup News .",
    "published": "Mon, 04 Apr 2016 07:58:22 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why women make better investors than men",
    "link": "https://nordicstartupnews.com/women-make-better-investors-men/",
    "summary": "In a male dominated industry women excel in the world of investing.  Read on to learn why women make better investors than men. The world has changed a lot in the last 50 years; many industries that were once exclusively dominated by men have become more transparent and equal to both genders where applicants compete … The post Why women make better investors than men appeared first on Nordic Startup News .",
    "published": "Mon, 21 Mar 2016 08:41:41 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The proportion of women entrepreneurs in Denmark falls",
    "link": "https://nordicstartupnews.com/the-proportion-of-women-entrepreneurs-in-denmark-falls/",
    "summary": "According to new figures from the Danish Business Authority, there has been a positive development in the actual number of female and male entrepreneurs from 2014 to 2015. But at the same time, the number of male entrepreneurs increased significantly more than the number of female entrepreneurs. Entrepreneurship is growing in Denmark, and the number … The post The proportion of women entrepreneurs in Denmark falls appeared first on Nordic Startup News .",
    "published": "Fri, 04 Mar 2016 08:01:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Demand is high for female-friendly bootcamp at Girls In Tech Helsinki",
    "link": "https://nordicstartupnews.com/61337/",
    "summary": "Three weeks have passed since the Girls in Tech Skills Bootcamp in Helsinki — it’s time to look back and reflect on what unfolded at the very first event of this kind in the Nordics. When I helped launch the Helsinki chapter of Girls in Tech in spring 2015, we wanted to create a community that would … The post Demand is high for female-friendly bootcamp at Girls In Tech Helsinki appeared first on Nordic Startup News .",
    "published": "Mon, 22 Feb 2016 13:11:41 +0000",
    "source": "Nordic Startup News"
  }
]