[
  {
    "title": "Kvindelandsholdet skal igen spille i Parken",
    "link": "https://www.dr.dk/sporten/seneste-sport/kvindelandsholdet-skal-igen-spille-i-parken",
    "summary": "",
    "published": "Wed, 10 Sep 2025 05:18:00 GMT",
    "source": "Kort nyt | DR"
  },
  {
    "title": "Morgen-briefing: 90 millioner til dansk AI-startup / Nordiske cloudselskaber i samarbejde / SimCorp lancerer ny service / Staten skyder grunde ind i kvantesats",
    "link": "https://www.computerworld.dk/art/292786/morgen-briefing-90-millioner-til-dansk-ai-startup-nordiske-cloudselskaber-i-samarbejde-simcorp-lancerer-ny-service-staten-skyder-grunde-ind-i-kvantesats?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS",
    "summary": "90 millioner kroner til dansk AI-startup. Nordiske cloudselskaber i samarbejde. SimCorp lancerer ny service. Staten skyder grunde ind i kvantesats.",
    "published": "Tue, 09 Sep 2025 06:00:00 +0200",
    "source": "Computerworld"
  },
  {
    "title": "Pensionskapitalen: ”Vi er ivrige efter at investere i tech scaleups”",
    "link": "https://bootstrapping.dk/pensionskapitalen-vi-er-ivrige-efter-at-investere-i-tech-scaleups/",
    "summary": "Pension er skattebegunstiget folkeopsparing med 30-40 års sigte. Så når pensionskasserne er vores allesammens som lønmodtagere eller borgere, er det virkelig svært at forklare børn og unge, at ens eget selskab ikke vil investere i de arbejdspladser og den innovation, de engang om 10-20-30 år skal leve af . De kan jo næppe alle sammen leve af arv. Men til nu har selskaberne i den grad slået sig i tøjret. Ivrige efter at sende scaleups ud af landet? I EU er det 0,1 % af al institutionel kapital, der går til ventures . I Danmark er selskaberne  blevet bedre de senere ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Pensionskapitalen: ”Vi er ivrige efter at investere i tech scaleups” appeared first on Bootstrapping .",
    "published": "Wed, 10 Sep 2025 07:21:54 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Kaffe & Kapital – Håndtering og implementering af warrants og optioner m. Patrick Andersen",
    "link": "https://bootstrapping.dk/kaffe-kapital-warrants-og-optioner-m-patrick-andersen/",
    "summary": "I en tid med hård konkurrence om de bedste talenter er warrants og optioner afgørende værktøjer for både større virksomheder og startups med henblik på at tiltrække og fastholde nøglemedarbejdere - og dermed skabe et stærkt, attraktivt arbejdsfællesskab. Jesper Højberg Christensen taler med advokat Patrick Andersen fra DLA Piper, der deler sin ekspertise om mulighederne i Danmark, samt hvordan man bedst håndterer og implementerer warrants og optioner. The post Kaffe & Kapital – Håndtering og implementering af warrants og optioner m. Patrick Andersen appeared first on Bootstrapping .",
    "published": "Wed, 10 Sep 2025 07:08:37 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Founder advarer: AI skaber software-overload, der kan løbe løbsk i virksomheder",
    "link": "https://bootstrapping.dk/founder-advarer-ai-skaber-software-overload-der-kan-loebe-loebsk-i-virksomheder/",
    "summary": "AI omformer måden, virksomheder opererer på. Det øger hastigheden af softwareadoption og gør det lettere for medarbejdere at skabe deres egne værktøjer. Dermed driver det også antallet af applikationer, som organisationer skal håndtere, voldsomt i vejret. Og den udvikling skaber en række nye sårbarheder, hævder Michael Fornander , CEO & co-founder i Viio (tidligere Oveo). Man skal selvfølgelig have for øje, at Fornander lever af at levere løsninger, der kan sikre virksomheder kontrol af applikationer. Når det er sagt, kan der godt være noget om, at hypen og henrykkelsen ved de brugsmuligheder AI skaber, kan få os til “ at negligere nogle ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Founder advarer: AI skaber software-overload, der kan løbe løbsk i virksomheder appeared first on Bootstrapping .",
    "published": "Tue, 09 Sep 2025 12:14:18 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Rumveteran Niels Buus: Europa taber big time kritisk rumkapløb til Musk",
    "link": "https://bootstrapping.dk/rumveteran-niels-buus-europa-taber-big-time-kritisk-rumkaploeb-til-musk/",
    "summary": "Danmark har universiteterne og innovationen, men mangler ligesom hele Europa desperat både systemet og kapitalen til at opbygge industri-vindere. Niels Buus , som du nok også kender fra historierne om lagerbeskatning , har været med fra dengang, hvor man byggede teknologierne. Som ung i 1980’erne uddannede han sig til civilingeniør på Aalborg Universitet og delte den grænseoverskridende drøm om rummet. Men nu har billedet på få år ændret sig, fortæller rumfartsveteranen til Bootstrapping: - \"Jeg plejer at sige, at det længe har været, som da man i USA satsede alt ved at tage familien ud over prærien med sine okser og sin ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Rumveteran Niels Buus: Europa taber big time kritisk rumkapløb til Musk appeared first on Bootstrapping .",
    "published": "Tue, 09 Sep 2025 07:07:42 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Kort & Godt i Startupland: Medarbejderaktier & straksfradrag er løst – VC’s opererer som kapitalfonde? – Jesper Buch er “revnende ligeglad",
    "link": "https://bootstrapping.dk/kort-godt-warrants-jesper-buch-er-revnende-ligeglad/",
    "summary": "Vi kom, så og festede – og segnede bagefter af træthed på TechBBQ. Det og meget andet samler vi op på. Og starter med de to politiske gennembrud for økosystemet, der måske druknede lidt i tumlen på Bella Center. Du kan læse om:   Medarbejderaktier på plads. Straksfradrag genrejst Tech BBQ with Love(able)  Tibi kom […] The post Kort & Godt i Startupland: Medarbejderaktier & straksfradrag er løst – VC’s opererer som kapitalfonde? – Jesper Buch er “revnende ligeglad appeared first on Bootstrapping .",
    "published": "Fri, 05 Sep 2025 08:48:27 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Straksfradraget. Hvilke muligheder får danske startups nu?",
    "link": "https://bootstrapping.dk/straksfradraget-hvilke-muligheder-faar-danske-startups-nu/",
    "summary": "Et af sidste uges gode gaver i Finansloven var ændringen i straksfradraget, så softwareudviklende startups nu kan afskrive deres udvikling med det samme. Det er DI´s chef for SMV og iværksætteri, Sine Linderstrøm, der fik pitchet forslaget ind til Moderaterne. Vi har spurgt hende, hvad betydning det vil få for software-startups. The post Straksfradraget. Hvilke muligheder får danske startups nu? appeared first on Bootstrapping .",
    "published": "Thu, 04 Sep 2025 08:05:25 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Ventureinvesteringer er 44 % nede i 2025 – går det virkelig så skidt …?",
    "link": "https://bootstrapping.dk/ventureinvesteringer-er-44-nede-i-2025-gaar-det-virkelig-saa-skidt/",
    "summary": "I forhold til resten af EU klarede det danske venturemarked sig ret fint i 2023-2024, trods hele markedsvendingen med rentestigninger og uro. Den tid er så åbenbart forbi! Til nu i 2025 har vores investorer holdt pengepungen i baglommen. Første halvår af 2025 har budt på et fald på 44 % i investeret venturekapital i forhold til foregående første halvår af 2024. Lidt mindre nedgang i antal af investeringer, nemlig 19 %. Det fortæller, at færre, og især langt mindre investeringer, stadig er med . Cirka 85 % af alle investeringerne i 1. halvår var under 10 mio. EUR. Så tidlige ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Ventureinvesteringer er 44 % nede i 2025 – går det virkelig så skidt …? appeared first on Bootstrapping .",
    "published": "Wed, 03 Sep 2025 08:11:30 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Europas B2B-startups skaber den dobbelte omsætning af USA’s – men hæmmes af kortsigtede pensionskasser",
    "link": "https://bootstrapping.dk/europas-b2b-startups-skaber-den-dobbelte-omsaetning-af-usas/",
    "summary": "Europæiske fonde og pensionskasser har linserne forkert indstillet: de fokuserer på at minimere kortsigtede udsving frem for at maksimere langsigtede afkast. Det er den afgørende forskel til USA, hvor kapitalen flyder gennem hele værdikæden. Derfor hjælper det ikke, at europæiske B2B-startups faktisk skaber mere end dobbelt så meget omsætning pr. investeret krone end de amerikanske. Regningen vokser dag for dag – og kræver handling nu, skriver Mads Jensen, partner i SuperSeed. The post Europas B2B-startups skaber den dobbelte omsætning af USA’s – men hæmmes af kortsigtede pensionskasser appeared first on Bootstrapping .",
    "published": "Wed, 03 Sep 2025 07:30:35 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Up North skal være starten på noget større i det nordjyske økosystem: “Vi skal tro mere på os selv”",
    "link": "https://techsavvy.media/up-north-skal-vaere-starten-paa-noget-stoerre-i-det-nordjyske-oekosystem-vi-skal-tro-mere-paa-os-selv/",
    "summary": "Nordjylland har talent og idéer, men for få investeringer. Up North samlede økosystemet for at ændre på den fortælling. Indlægget Up North skal være starten på noget større i det nordjyske økosystem: “Vi skal tro mere på os selv” blev først udgivet på TechSavvy .",
    "published": "Wed, 10 Sep 2025 09:43:44 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Ulla undgår founders, der hellere vil “holde talks” end at bygge forretning",
    "link": "https://techsavvy.media/ulla-undgaar-founders-der-er-mere-optaget-af-at-staa-paa-scenen/",
    "summary": "For tidligere advokat, bankdirektør og i dag engleinvestor Ulla Heurlin vægter salg, skalering og ærlighed langt tungere end startup-hype. Indlægget <i class=\"fa fa-lock\" aria-hidden=\"true\"></i> Ulla undgår founders, der hellere vil “holde talks” end at bygge forretning blev først udgivet på TechSavvy .",
    "published": "Wed, 10 Sep 2025 05:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Dansk AI-scaleup rejser millioner af dollars til at indtage USA",
    "link": "https://techsavvy.media/dansk-ai-scaleup-rejser-millioner-af-dollars-til-at-indtage-usa/",
    "summary": "Danske Teton er klar til at udbrede deres AI-platform til optimering af ældrepleje efter en massiv investeringsrunde. Indlægget <i class=\"fa fa-lock\" aria-hidden=\"true\"></i> Dansk AI-scaleup rejser millioner af dollars til at indtage USA blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 12:40:33 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Bliv en skarpere investor med Keystones: Sådan guider netværket dig fra første investering til vellykket exit",
    "link": "https://techsavvy.media/bliv-en-skarpere-investor-med-keystones-saadan-guider-netvaerket-dig-fra-foerste-investering-til-vellykket-exit/",
    "summary": "Som business angel har Camilla Frost fundet både værdi og værktøjer i Keystones’ netværk. På bare ét år har hun fået adgang til praktisk viden,... Indlægget Bliv en skarpere investor med Keystones: Sådan guider netværket dig fra første investering til vellykket exit blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 09:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Cykel-startup genopstår efter konkurs med nye erfarne folk på holdet",
    "link": "https://techsavvy.media/cykel-startup-genopstaar-efter-konkurs-med-nye-erfarne-folk-paa-holdet/",
    "summary": "Det danske cykelstartup CYKOM relanceres af tre erfarne founders med ambitionen om at samle verdens cyklister på én platform. Indlægget Cykel-startup genopstår efter konkurs med nye erfarne folk på holdet blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 06:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Serieiværksætter rejser kapital til dansk Lovable-udfordrer",
    "link": "https://techsavvy.media/serieivaerksaetter-rejser-kapital-til-dansk-lovable-udfordrer/",
    "summary": "Danske Lightpost One har rejst en pre-seed-runde fra venturefonden PSV Techs nye Fond II. Stifter Casper Wilstrup ser det som startskuddet på en europæisk ‘vibe... Indlægget <i class=\"fa fa-lock\" aria-hidden=\"true\"></i> Serieiværksætter rejser kapital til dansk Lovable-udfordrer blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 05:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Kaffe-startup går i europæisk offensiv efter investering på 30 millioner til at digitalisere erhvervskaffe",
    "link": "https://techsavvy.media/kaffe-startup-gaar-i-europaeisk-offensiv-efter-investering-paa-30-millioner-til-at-digitalisere-erhvervskaffe/",
    "summary": "Blackbird Coffee vil udfordre de traditionelle leverandører med teknologi, proaktiv service og en europæisk ekspansion. Indlægget Kaffe-startup går i europæisk offensiv efter investering på 30 millioner til at digitalisere erhvervskaffe blev først udgivet på TechSavvy .",
    "published": "Mon, 08 Sep 2025 13:00:40 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Arctic15 DealTank. Something new, something old",
    "link": "https://nordicstartupnews.com/arctic15-dealtank-something-new-something-old/",
    "summary": "…and a lot of Blue at Arctic15, 2025 So, Deal Tank at Arctic15 – Where Startups and Deals Collide. The Arctic15 startup conference, a Helsinki annual startups meet investors “chocolate shop” since 2011, has always been about connecting the right people to make things happen.    1st ever DealTank. Image (c) Arctic15 social media (screenshot) … The post Arctic15 DealTank. Something new, something old appeared first on Nordic Startup News .",
    "published": "Tue, 10 Jun 2025 09:32:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Latitude59 Pitch Competition Winners Have Secured Total over €20 Million in Investments",
    "link": "https://nordicstartupnews.com/latitude59-pitch-competition-winners-have-secured-total-over-e20-million-in-investments/",
    "summary": "At the international startup conference Latitude59 held in Tallinn, the 2025 victory was shared by three companies. Investments ranging from €175,000 to €250,000 will be made in Estonian green energy solutions developer MarkeDroid, Latvian construction startup Adventum Tech, and Lithuanian defense technology company Luna Robotics. The syndicated investments are provided by business angels from Estonia, … The post Latitude59 Pitch Competition Winners Have Secured Total over €20 Million in Investments appeared first on Nordic Startup News .",
    "published": "Sat, 24 May 2025 12:53:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Latitude59 of Tallinn Was a Great Success also Measured by Numbers",
    "link": "https://nordicstartupnews.com/latitude59-of-tallinn-was-a-great-success-also-measured-by-numbers/",
    "summary": "Latitude59, which took place for the 13th time in Tallinn, Estonia, was visited by more than 3,500 people, including more than 900 startup representatives and 20 national delegations. Nearly 700 investors participated this year. 170 speakers could be seen on Latitude59’s stages. In total, there were participants from more than 70 different countries worldwide. This … The post Latitude59 of Tallinn Was a Great Success also Measured by Numbers appeared first on Nordic Startup News .",
    "published": "Sat, 24 May 2025 12:24:20 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Busy start-up season both sides of the Baltic Sea",
    "link": "https://nordicstartupnews.com/busy-start-up-season-both-sides-of-the-baltic-sea/",
    "summary": "The up-tempo business season is leaning towards tranquil summer vacations. Still, there are two signature events left, like cherries on the cake-top: Latitude59 in Tallinn (May 21-23) and Arctic15 in Helsinki (June 4-5).Latitude59 is an international, impactful, and diverse startup and technology conference and a global platform that connects startups, investors, and ecosystem builders all … The post Busy start-up season both sides of the Baltic Sea appeared first on Nordic Startup News .",
    "published": "Mon, 19 May 2025 14:53:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nanofiber Innovation Takes Top Prize at Oulu’s Polar Bear Pitching",
    "link": "https://nordicstartupnews.com/nanofiber-innovation-takes-top-prize-at-oulus-polar-bear-pitching/",
    "summary": "Polar Bear (Jason Brower) and MC Simo Kekäläinen put up an interval show. Startup companies competed this year in the Polar Bear Pitching event held in Oulu, Finland, in an exceptional location and under extraordinary circumstances. By the Oulujoki river, the weather was mild with temperatures above freezing and drizzling rain.The finals of the event … The post Nanofiber Innovation Takes Top Prize at Oulu’s Polar Bear Pitching appeared first on Nordic Startup News .",
    "published": "Fri, 28 Feb 2025 10:39:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Natural Alternatives Without Compromise",
    "link": "https://nordicstartupnews.com/natural-alternatives-without-compromise/",
    "summary": "Svelli, a Danish foodtech startup with ambitions to revolutionize the sugar-free product market, has secured investment from several Danish investors. Svelli aims to challenge the status quo in a food industry where sugar and ultra-processed foods continue to dominate. Rather than simply offering “healthier alternatives,” the company focuses on creating full-fledged replacements. This requires not … The post Natural Alternatives Without Compromise appeared first on Nordic Startup News .",
    "published": "Fri, 21 Feb 2025 18:20:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Slush Chronicles: Founders Unplugged: Timo Poijärvi",
    "link": "https://nordicstartupnews.com/the-slush-chronicles-founders-unplugged-timo-poijarvi/",
    "summary": "This piece is part of the Slush Chronicles series, “Founders Unplugged,” where we interview founders and key personnel of innovative companies, to hear their thoughts on the event we’re attending or dive into other spontaneously chosen topics. Slush 2024 founder: Timo Poijärvi SaluStim Group Got a message from Timo saying he is onto something amazing, … The post The Slush Chronicles: Founders Unplugged: Timo Poijärvi appeared first on Nordic Startup News .",
    "published": "Sun, 29 Dec 2024 19:32:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Slush Chronicles: Founders Unplugged: Veera Siivonen",
    "link": "https://nordicstartupnews.com/the-slush-chronicles-founders-unplugged-veera-siivonen/",
    "summary": "This piece is part of the Slush Chronicles series, “Founders Unplugged,” where we interview founders and key personnel of innovative companies, to hear their thoughts on the event we’re attending or dive into other spontaneously chosen topics. Slush 2024 founder: Veera Siivonen, Saidot At SXSW 2024 I went to listen to Saidot’s talk on AI … The post The Slush Chronicles: Founders Unplugged: Veera Siivonen appeared first on Nordic Startup News .",
    "published": "Sun, 29 Dec 2024 15:45:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Slush Chronicles: Founders Unplugged: Jukka Tuhkanen",
    "link": "https://nordicstartupnews.com/the-slush-chronicles-founders-unplugged-jukka-tuhkanen/",
    "summary": "This piece is part of the Slush Chronicles series, “Founders Unplugged,” where we interview founders and key personnel of innovative companies, to hear their thoughts on the event we’re attending or dive into other spontaneously chosen topics. Slush 2024 founder: Jukka Tuhkanen, HIIL I ran into Jukka Tuhkanen, Director of Sales and Partnerships from Hiil, … The post The Slush Chronicles: Founders Unplugged: Jukka Tuhkanen appeared first on Nordic Startup News .",
    "published": "Tue, 10 Dec 2024 16:49:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Cracking the Code of Startup Success",
    "link": "https://nordicstartupnews.com/cracking-the-code-of-startup-success/",
    "summary": "Interviewing Ms.Penny Schiffer, CEO of Raized.aiBy Vahur OrrinWith its iconic slushy weather and electrifying atmosphere, Slush remains one of Europe’s most sought-after startup conferences. For Penny Schiffer, CEO of Raized.ai, attending Slush is a yearly pilgrimage. “This is my fourth time here,” Penny says. “Slush isn’t just a conference; it’s a perfectly orchestrated environment where … The post Cracking the Code of Startup Success appeared first on Nordic Startup News .",
    "published": "Thu, 21 Nov 2024 17:52:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sanja Hauser Wants to Revolutionize Digital Marketing for Startups and SMEs",
    "link": "https://nordicstartupnews.com/sanja-hauser-wants-to-revolutionize-digital-marketing/",
    "summary": "Interview with Ms. Sanja Hauser, founder of Betalane at Slushby Vahur Orrin In the fast-evolving digital marketing world, Zurich-based Betalane.ch has carved out a unique niche by focusing on startups and small to medium-sized enterprises (SMEs). Founded by Sanja Hauser, a marketing professional with years of experience in digital marketing, Betalane is reshaping how businesses … The post Sanja Hauser Wants to Revolutionize Digital Marketing for Startups and SMEs appeared first on Nordic Startup News .",
    "published": "Wed, 20 Nov 2024 15:04:40 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Innovation at Its Peak and New Tool for Slush 100 Startups",
    "link": "https://nordicstartupnews.com/new-tool-for-slush-100-startups/",
    "summary": "Empowering the Slush 100 Startups with Revolutionary Tools New Tool for Slush 100 Startups is the core of this year’s event, a curated selection of the most promising startups from across the globe. Slush 2024 introduced a groundbreaking tool specifically designed to enhance the visibility and opportunities for these innovative companies. This tool is a … The post Innovation at Its Peak and New Tool for Slush 100 Startups appeared first on Nordic Startup News .",
    "published": "Wed, 20 Nov 2024 10:21:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush 2024 – Make Your Startup Stand Out",
    "link": "https://nordicstartupnews.com/make-your-startup-stand-out-at-slush-2024/",
    "summary": "Slush 2024 is the perfect opportunity for startups to shine, and WiseMarketing is here to ensure you make a lasting impression. We’re offering an exclusive deal for Slush attendees: Order a custom landing page and enjoy additional visibility by featuring your company in an article on NordicStartupNews.com, a platform trusted by investors and innovators. Get … The post Slush 2024 – Make Your Startup Stand Out appeared first on Nordic Startup News .",
    "published": "Tue, 19 Nov 2024 07:47:29 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Discover the Best Upgoing Startup Events 2024 Has to Offer",
    "link": "https://nordicstartupnews.com/discover-the-best-upgoing-startup-events-2024-has-to-offer/",
    "summary": "September 2024 TechBBQ (Copenhagen, Denmark) – September 18-19 Oslo Innovation Week (Oslo, Norway) – September 23-27 October 2024 Slush (Helsinki, Finland) – November 20 – November 21 TechBBQ in Copenhagen, Denmark – September – In September 2024, one of the most anticipated startup events, TechBBQ, will take place in Copenhagen, Denmark. This event is a … The post Discover the Best Upgoing Startup Events 2024 Has to Offer appeared first on Nordic Startup News .",
    "published": "Sat, 21 Sep 2024 16:49:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Discover Opportunities: Estonian Startup Events Calendar 2024-2025",
    "link": "https://nordicstartupnews.com/used-car-dealer-sales-tricks-exposed/",
    "summary": "Imagine a world where the next ground-breaking innovation is just one handshake away, where creative minds from all corners of the globe converge to share ideas, build partnerships, and spark revolutions in technology and business. Welcome to Estonia's vibrant startup ecosystem, a realm that has quickly become a magnet for entrepreneurs, investors, and innovators alike. If you've ever dreamed of being part of this dynamic community, the \"Estonian Startup Events Calendar 2024-2025\" is your golden ticket. This meticulously curated guide is more than just a schedule—it's your roadmap to seizing opportunities that could transform not only your career but also the very fabric of tomorrow's industries. Over the next two years, Estonia will host an array of events designed to nurture startups at every stage of their journey. From pitch competitions that can catapult you into the limelight, to networking galas where you can meet potential co-founders, the Estonian startup scene provides a fertile ground for growth and collaboration. The \"Estonian Startup Events Calendar 2024-2025\" ensures you won't miss a beat, highlighting key dates that promise to be catalysts for innovation and change. Whether you're a seasoned entrepreneur or just stepping into the startup world, this calendar is your essential companion for navigating Estonia's thriving entrepreneurial landscape. So, get ready to dive in and discover how these events can shape your future and the future of your industry. The post Discover Opportunities: Estonian Startup Events Calendar 2024-2025 appeared first on Nordic Startup News .",
    "published": "Sat, 21 Sep 2024 09:23:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Maximize Your Growth on Startup Day: Insider Tips and Strategies",
    "link": "https://nordicstartupnews.com/maximize-your-growth-on-startup-day-insider-tips-and-strategies/",
    "summary": "Standing on the precipice of your dreams, the dawn of Startup Day marks not just the launch of a new venture but the beginning of a thrilling, unpredictable journey. Each tick of the clock brings you closer to unveiling your passion, your innovation, to the world. The atmosphere is electric with possibility, yet the stakes … The post Maximize Your Growth on Startup Day: Insider Tips and Strategies appeared first on Nordic Startup News .",
    "published": "Sat, 21 Sep 2024 07:54:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "#ActionMatters 2024 edition – Arctic15",
    "link": "https://nordicstartupnews.com/actionmatters-2024-edition-arctic15/",
    "summary": "Another warm beginning of the warm Finnish summer – and another warm welcome to the old Cable Factory for the annual Arctic15 startup-investor conference. This story is the annual “vibes collection” from the Arctic15 floor, backstage, DealRoom meetings, official afterparties, unofficial gatherings and most importantly about HI, maybe with some added AI. (Got carried away … The post #ActionMatters 2024 edition – Arctic15 appeared first on Nordic Startup News .",
    "published": "Fri, 14 Jun 2024 23:24:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Hunome is for humans, by humans, and about humans.",
    "link": "https://nordicstartupnews.com/hunome-is-for-humans-by-humans-and-about-humans/",
    "summary": "In the era of AI, Hunome talks mostly about HI   So, at Arctic15 we met many AI companies, and then we met Hunome, more into Human Intelligence, HI, and especially for Collective Sensemaking.  With that, and a bit wider purpose statement of “helping humanity make sense of itself”, I had a pleasure to talk … The post Hunome is for humans, by humans, and about humans. appeared first on Nordic Startup News .",
    "published": "Tue, 11 Jun 2024 10:38:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Cool Startups Pitched in Icy Waters",
    "link": "https://nordicstartupnews.com/cool-startups-pitched-in-icy-waters/",
    "summary": "Oulu, Finland — The Arctic startup event, Polar Bear Pitching, marked its live return after a hiatus of four years. A sizable crowd gathered at Oulu Market Square, while online viewers from around the globe tuned in to witness ten selected startups take the plunge into the Avanto (Finnish for ice hole), each aiming to … The post Cool Startups Pitched in Icy Waters appeared first on Nordic Startup News .",
    "published": "Sun, 03 Mar 2024 14:18:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Tech-powered Hospitality Operator Bob W Secured €40 million Series B Funding",
    "link": "https://nordicstartupnews.com/tech-powered-hospitality-operator-bob-w-secures-e40-million-series-b-funding/",
    "summary": "Helsinki — In a stride towards revolutionizing the European hospitality sector, Finnish tech-enabled hospitality operator Bob W has announced its Series B funding of EUR 40 million. This round, led by Evli Growth Partners and joined by growth capital investors and prominent European entrepreneurs, including Taavet+Sten, the investment firm of Wise’s founder Taavet Hinrikus and … The post Tech-powered Hospitality Operator Bob W Secured €40 million Series B Funding appeared first on Nordic Startup News .",
    "published": "Sun, 03 Mar 2024 13:40:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "N-ink wins Voima Ventures’ science challenge and secures a €1M investment",
    "link": "https://nordicstartupnews.com/n-ink-wins-voima-ventures-science-challenge-and-secures-a-e1m-investment/",
    "summary": "Stockholm — A Swedish deep technology company N-ink is announced as the winner of a science challenge by Voima Ventures, an early-stage investor based in Helsinki and Stockholm. The challenge targeted Nordic and Baltic early-stage startups and research teams with groundbreaking science-based innovations. By winning the challenge, N-ink secures a €1M investment as a convertible … The post N-ink wins Voima Ventures’ science challenge and secures a €1M investment appeared first on Nordic Startup News .",
    "published": "Sun, 03 Mar 2024 13:18:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nico Rosberg: “Courage” is a common nominator between startup entrepreneurs and race car drivers",
    "link": "https://nordicstartupnews.com/nico-rosberg-courage-is-a-common-nominator-between-startup-entrepreneurs-and-race-car-drivers/",
    "summary": "At the Slush startup event in Helsinki, Nico Rosberg, the 2016 Formula 1 World Champion, revealed what led him to pass by a lucrative contract extension in the pinnacle of motorsport and transition into an investor. – Nice to be back to my roots, said the 38-year-old to the extensive audience. By a fireside … The post Nico Rosberg: “Courage” is a common nominator between startup entrepreneurs and race car drivers appeared first on Nordic Startup News .",
    "published": "Thu, 30 Nov 2023 22:32:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Helsinki-based Failup Ventures builds the venture bridge between the Nordics and U.S.",
    "link": "https://nordicstartupnews.com/helsinki-based-failup-ventures-builds-the-venture-bridge-between-the-nordics-and-u-s/",
    "summary": "Failup Ventures, a new globally operating early-stage venture capital fund, has announced the first closing of €30 million of its new early-stage fund of €50 million. Founded by three previous Finnish entrepreneurs – Jesse Heikkilä, Topias Soininen, and Oscar Andersin – Failup Ventures backs early-stage startups with strong, mission-driven teams. Failup’s typical initial investments range … The post Helsinki-based Failup Ventures builds the venture bridge between the Nordics and U.S. appeared first on Nordic Startup News .",
    "published": "Thu, 30 Nov 2023 08:07:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "20 startups left in Slush 100 Pitch Competition",
    "link": "https://nordicstartupnews.com/20-startups-left-in-slush-100-pitch-competition/",
    "summary": "The most coveted pitching competition is the iconic Slush 100. The winner will get an equity investment from the leading early-stage funds in Europe: Accel, General Catalyst, Lightspeed Venture Partners, NEA, and Northzone. These iconic funds have backed historic companies like Meta, Stripe, Airbnb, Snap, Uber, Spotify, Salesforce, Instacart, and Klarna. The race is … The post 20 startups left in Slush 100 Pitch Competition appeared first on Nordic Startup News .",
    "published": "Mon, 20 Nov 2023 15:42:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Arctic15 #ActionMatters, Health Track. The Health Startup Challenge(s). (Applies to many others, too:)",
    "link": "https://nordicstartupnews.com/arctic15-actionmatters-health-track-the-health-startup-challenges-applies-to-many-others-too/",
    "summary": "Arctic15 Health Track: Insights from Arctic15’s Health Track: Exploring Digital Health Arctic15’s Health Track, curated by Aki Koivistoinen, delved into the state of digital health. This article provides an overview of the track, including key insights from an interview with Aki, the Startup Health ambassador, and highlights from the panels and keynote presentation. Key Points: … The post Arctic15 #ActionMatters, Health Track. The Health Startup Challenge(s). (Applies to many others, too:) appeared first on Nordic Startup News .",
    "published": "Fri, 23 Jun 2023 10:35:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic Game 2022 – a great premiere",
    "link": "https://nordicstartupnews.com/nordic-game-2022-a-great-premiere/",
    "summary": "Nordic Game, the conference held annually in Malmö, Sweden, has become one of the leading events for the games industry, and each May it gathers thousands of developers, publishers and investors together. But this November, Nordic Game travelled to Helsinki, Finland, for the first time to do a special show as a partner side-event to … The post Nordic Game 2022 – a great premiere appeared first on Nordic Startup News .",
    "published": "Mon, 21 Nov 2022 15:50:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush pitching winner will not receive 1M€",
    "link": "https://nordicstartupnews.com/slush-pitching-winner-will-not-receive-1me/",
    "summary": "The world’s leading startup conference Slush has decided to revoke the prize funding valued of 1M€ for Immigram, the Slush100 pitching competition winner after its alleged connections to Russia and Russian experts who want to exit their homeland. The company has also a presence in Russia. Immigram and its founders Anastasia Miroljubova and Mikhail Sharonov … The post Slush pitching winner will not receive 1M€ appeared first on Nordic Startup News .",
    "published": "Mon, 21 Nov 2022 15:04:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Live events are making their comeback: Arctic15 in Helsinki, Finland",
    "link": "https://nordicstartupnews.com/live-events-are-making-their-comeback-arctic15-in-finland/",
    "summary": "The Arctic15 Helsinki takes place on June, 7-8, 2022. Before the unforeseen pandemic hiatus, the event attracted over 1500+ Startups, VCs, CVCs, Angels, and Investors to get together. For this year, the arranging committee has some realistic numbers drafted: “We aim for 300+ investors, 450+ startups, 150+ corporates, a maximum of 2000 attendees and again … The post Live events are making their comeback: Arctic15 in Helsinki, Finland appeared first on Nordic Startup News .",
    "published": "Sun, 05 Jun 2022 08:53:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Fintech startup Inpay named fastest growing company in Denmark",
    "link": "https://nordicstartupnews.com/fintech-startup-inpay-named-fastest-growing-company-in-denmark/",
    "summary": "Inpay, a Copenhagen based fintech, has been named the fastest growing company in Denmark out of millions of enterprises in the annual FT1000 business rankings. The company was also recognised as the sixth fastest growing fintech in Europe, and entered the ranking at as the 87th fastest growing company in Europe, the highest position a … The post Fintech startup Inpay named fastest growing company in Denmark appeared first on Nordic Startup News .",
    "published": "Mon, 07 Mar 2022 18:00:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norwegian VC insights: How to win in venture when the rules-and geography- of the game is chaning?",
    "link": "https://nordicstartupnews.com/norwegian-vc-insights-how-to-win-in-venture-when-the-rules-and-geography-of-the-game-is-chaning/",
    "summary": "In this blog post, Katapult Group CEO, Fredrik Winther assesses the fast-changing landscape of venture, and why venture investors need to re-think strategy. By Frederik Winther The venture capital industry broke all records in 2021, and it led to systemic changes as to how it operates. Not long ago start-ups fought for the investors, these … The post Norwegian VC insights: How to win in venture when the rules-and geography- of the game is chaning? appeared first on Nordic Startup News .",
    "published": "Fri, 04 Feb 2022 01:48:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Nordic Sustainable Tech startups to watch out for",
    "link": "https://nordicstartupnews.com/5-nordic-sustainable-tech-startups-to-watch-out-for/",
    "summary": "The Nordic countries have adopted a vision to become the most sustainable and integrated region in the world by 2030.   Bolstered by the ambitious climate goals set by the region’s governments,  startups have been tackling all manner of the green transition from smart farming to recycling, and are now leaders in sustainable technologies. At Oslo Innovation … The post 5 Nordic Sustainable Tech startups to watch out for appeared first on Nordic Startup News .",
    "published": "Tue, 02 Nov 2021 10:19:58 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish-Kenyan EV startup Opibus announces $7.5 million investment",
    "link": "https://nordicstartupnews.com/swedish-kenyan-ev-startup-opibus-announces-7-5-million-investment/",
    "summary": "Opibus, Sub-Saharan Africa’s leading electric vehicle manufacturer, announced that it has raised $7.5 million in funding led by Silicon Valley fund At One Ventures, further supported by Factor[e] Ventures and Ambo Ventures managed by former Google and Uber executives. The investment is the largest ever in an electric mobility company in Sub-Saharan Africa and is … The post Swedish-Kenyan EV startup Opibus announces $7.5 million investment appeared first on Nordic Startup News .",
    "published": "Thu, 28 Oct 2021 10:25:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s Kuva Space raises funding for precision farming and global carbon sequestration from space",
    "link": "https://nordicstartupnews.com/finlands-kuva-space-raises-funding-for-precision-farming-and-global-carbon-sequestration-from-space/",
    "summary": "Climate change is already strongly changing our environment and the global  food security is beginning to halter. Finnish startup Kuva Space aims to help farmers in precision farming as well as bio asset owners, businesses  and governments get better insight for making effective decisions towards  sustainable farming, carbon binding and reduction of climate effects. Kuva … The post Finland’s Kuva Space raises funding for precision farming and global carbon sequestration from space appeared first on Nordic Startup News .",
    "published": "Thu, 07 Oct 2021 07:58:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s Elfys raises €3 million energy efficient wearables",
    "link": "https://nordicstartupnews.com/finlands-elfys-raises-e3-million-energy-efficient-wearables/",
    "summary": "Photodetector company Elfys raises €3M  to ramp up the production for the growing  wearable market that are more energy efficient. The round is lead by deeptech investor Voima Ventures, whose portfolio includes the successful Oura Ring. Photodetectors are sensors of light most commonly used in devices such as  smartwatches or any other worn devices. Now … The post Finland’s Elfys raises €3 million energy efficient wearables appeared first on Nordic Startup News .",
    "published": "Mon, 27 Sep 2021 13:14:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish biotech startup Kääpä raises Series A to grow mushroom product line",
    "link": "https://nordicstartupnews.com/finnish-biotech-startup-kaapa-raises-series-a-to-grow-mushroom-product-line/",
    "summary": "The industry award winning Nordic Mushrooms product line by KÄÄPÄ Biotech, a Finnish biotechnology startup, has caught the attention of major global nutritional supplement manufacturers. The demand on the wholesale product line has increased rapidly and therefore KÄÄPÄ Biotech is now entering into the Series A investment stage to scale up the production capacity to … The post Finnish biotech startup Kääpä raises Series A to grow mushroom product line appeared first on Nordic Startup News .",
    "published": "Mon, 20 Sep 2021 13:49:57 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Crowd For Impact disrupts the crowdfunding market through impact specific crowdfunding",
    "link": "https://nordicstartupnews.com/crowd-for-impact-disrupts-the-crowdfunding-market-through-impact-specific-crowdfunding/",
    "summary": "A Helsinki based startup, Crowd For Impact, has launched a crowdfunding platform for impact startups solving global issues. It offers both individuals and companies a chance to support impact projects, and receive responsibly produced goods and services in return. Crowd For Impact is a reward based crowdfunding platform that combines crowdfunding, corporate sustainability and startup … The post Crowd For Impact disrupts the crowdfunding market through impact specific crowdfunding appeared first on Nordic Startup News .",
    "published": "Mon, 20 Sep 2021 13:40:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s StemSight, first human stem cell startup from Finland, announces seed funding round",
    "link": "https://nordicstartupnews.com/finlands-stemsight-first-human-stem-cell-startup-from-finland-announces-seed-funding-round/",
    "summary": "All female founded StemSight is the first human stem cell startup from Finland to receive funding,  announcing a €500000 seed round from Voima Ventures. Stemsight aims to help over 12 million people suffer from corneal blindness regain their sight.   The all female-founded team, based in Tampere, has announced a new seed round from the DeepTech … The post Finland’s StemSight, first human stem cell startup from Finland, announces seed funding round appeared first on Nordic Startup News .",
    "published": "Wed, 15 Sep 2021 07:41:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "EU Agency for the Space Programme launches #myEUspace competition for startups",
    "link": "https://nordicstartupnews.com/eu-agency-for-the-space-programme-launches-myeuspace-competition-for-startups/",
    "summary": "The European Union Agency for the Space Programme (EUSPA) launches #myEUspace competition. The EU prize contest targets innovators and entrepreneurs ready to explore, develop and commercialize innovative solutions that leverage EU Space data and services, going beyond the current space-applications horizon, and fusing and testing new technologies in location-based services, smart mobility, smart agriculture, geomatics, … The post EU Agency for the Space Programme launches #myEUspace competition for startups appeared first on Nordic Startup News .",
    "published": "Tue, 07 Sep 2021 11:10:48 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish startup Pibox raises funding for remote collaboration solution for audio content",
    "link": "https://nordicstartupnews.com/finnish-startup-pibox-raises-funding-for-remote-collaboration-solution-for-audio-content/",
    "summary": "Pibox is a centralized/all-in-one remote collaboration solution developed for working with creative collaboration. It is used daily by the head of a production, music producers, managers and sound engineers. Now, Pibox has raised € 150,000 in funding from the Pitchdrive fund and several angel investors. Pibox was launched in 2018. The solution first raised interest … The post Finnish startup Pibox raises funding for remote collaboration solution for audio content appeared first on Nordic Startup News .",
    "published": "Mon, 23 Aug 2021 12:30:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Beauty-tech startup Watalook lands $1M in pre-seed",
    "link": "https://nordicstartupnews.com/beauty-tech-startup-watalook-lands-1m-in-pre-seed/",
    "summary": "The Lithuanian based startup Watalook is striving to redefine the beauty tech market with its digital assistant for independent beauty professionals across the U.S. Watalook has experienced a growth of over 30% in users each month and has recently raised $1M in the pre-seed round co-led by Startup Wise Guys, Crosspring, Launchpad Capital, and angel … The post Beauty-tech startup Watalook lands $1M in pre-seed appeared first on Nordic Startup News .",
    "published": "Fri, 20 Aug 2021 12:23:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonian start-up helps to save up to 50% of EU housing energy consumption through intelligent building solution",
    "link": "https://nordicstartupnews.com/estonian-start-up-helps-to-save-up-to-50-of-eu-housing-energy-consumption-through-intelligent-building-solution/",
    "summary": "Bisly, the Estonian tech company developing intelligent building solutions, has raised 1.7 million euros to carry out its aggressive expansion plan into European countries. The tech start-up’s technology helps to make energy consumption up to two times more efficient. According to Siim Vips, founder and CEO of Bisly, buildings consume up to 40% of energy … The post Estonian start-up helps to save up to 50% of EU housing energy consumption through intelligent building solution appeared first on Nordic Startup News .",
    "published": "Wed, 28 Jul 2021 20:21:06 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish startup ElByte combines comparison of electricity agreements to reduce energy consumption",
    "link": "https://nordicstartupnews.com/swedish-startup-elbyte-combines-comparison-of-electricity-agreements-to-reduce-energy-consumption/",
    "summary": "Elbyte started as a page with detailed guides about the Swedish electricity market, but now you can also compare and find cheap electricity prices and electricity agreements in their comparison service. Elbyte was started with a passion for sustainability and how you as a consumer of electricity could reduce your consumption. The founders of Elbyte … The post Swedish startup ElByte combines comparison of electricity agreements to reduce energy consumption appeared first on Nordic Startup News .",
    "published": "Sat, 10 Jul 2021 20:28:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "SNÖ Ventures launch new $100m Nordic venture fund backed by Peter Thiel",
    "link": "https://nordicstartupnews.com/sno-ventures-launch-new-100m-nordic-venture-fund-backed-by-peter-thiel/",
    "summary": "Oslo-based SNÖ Ventures has launched its second fund to  invest in visionary Nordic entrepreneurs and connect the Nordics  with the US and broader Europe. The new fund targets $100M to invest  in early stage, high-growth Nordic tech companies with the potential to disrupt,  create or capture large markets through transformative technology or  solutions.  By Kremena … The post SNÖ Ventures launch new $100m Nordic venture fund backed by Peter Thiel appeared first on Nordic Startup News .",
    "published": "Fri, 25 Jun 2021 09:09:15 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Ten startups chosen to accelerate the development of sustainable cities in Nordics",
    "link": "https://nordicstartupnews.com/ten-startups-chosen-to-accelerate-the-development-of-sustainable-cities-in-nordics/",
    "summary": "The Copenhagen-based Nordic accelerator Urbantech Program, hosted by BloxHub, has announced the 10 most promising and innovative sustainable technology startups for their 2021 batch. This announcement comes after a global search for urbantech startups. According to the UN, up to 70 percent of the world’s population is expected to live in cities by 2050. This … The post Ten startups chosen to accelerate the development of sustainable cities in Nordics appeared first on Nordic Startup News .",
    "published": "Thu, 17 Jun 2021 08:58:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Civinity invests €15 million in PropTech startups",
    "link": "https://nordicstartupnews.com/civinity-invests-e15-million-in-proptech-startups/",
    "summary": "Civinity, one of the largest facility management and engineering groups in the Baltic states, has announced the launch of their new investment management firm called Pentaframe Capital. Pentaframe Capital plans to invest up to €15 million across the following five years, with focus on real estate, facility management, and smart city tech startups across Europe. By … The post Civinity invests €15 million in PropTech startups appeared first on Nordic Startup News .",
    "published": "Thu, 10 Jun 2021 11:31:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Latvia’s Nordigen raises €2 million to expand free open banking API",
    "link": "https://nordicstartupnews.com/latvias-nordigen-raises-e2-million-to-expand-free-open-banking-api/",
    "summary": "Latvia’s Nordigen has announced a new €2.1 million investment to expand their freemium model after growing to support more than 1000 European bank APIs.  Investors include Black Pearls VC, Inventure, Highgoal Capital, ID4 Ventures, Calchas Holding and angel investors from across the Baltics including Artis Kehris, Henry Nilert, Gerri Kodres and Riivo Anton. The startup … The post Latvia’s Nordigen raises €2 million to expand free open banking API appeared first on Nordic Startup News .",
    "published": "Wed, 02 Jun 2021 09:15:39 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonia’s UP Catalyst receives funding to produce oxygen on Mars",
    "link": "https://nordicstartupnews.com/estonias-up-catalyst-receives-funding-to-produce-oxygen-on-mars/",
    "summary": "The technology startup UP Catalyst, founded in 2019, received €50 000 of seed money from the 2021 ESA BIC (Business Incubation Centre) programme for business and product development to boost their novel way of oxygen production on Mars. In addition to the funding UP Catalyst receives technical support from the European Space Agency and hands … The post Estonia’s UP Catalyst receives funding to produce oxygen on Mars appeared first on Nordic Startup News .",
    "published": "Fri, 28 May 2021 11:53:39 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Top Finnish startup accelerator expands to the Nordics and Baltics",
    "link": "https://nordicstartupnews.com/top-finnish-startup-accelerator-expands-to-the-nordics-and-baltics/",
    "summary": "Summer of 2021 is closing in, and as the world is seeing a surge in optimism with the influx of vaccines, Kiuas, the #1 startup accelerator in Finland, brings exciting news about expansion. Kiuas today revolves around the startup accelerator programs, and with the changing world, it makes to evolve the flagship program, Kiuas Accelerator, … The post Top Finnish startup accelerator expands to the Nordics and Baltics appeared first on Nordic Startup News .",
    "published": "Tue, 18 May 2021 11:29:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Denmark is the second-best funded nation for startups after USA",
    "link": "https://nordicstartupnews.com/denmark-is-the-second-best-funded-nation-for-startups-after-usa/",
    "summary": "According to a report by Money UK, Denmark is the second best-funded nation for startup businesses after the US.  With a total of five new business grants offering over $1,000,000, Denmark only lags slightly behind top funding opportunities in the US. The report, which is based on data from the Innovation Investment Index, highlights Denmark … The post Denmark is the second-best funded nation for startups after USA appeared first on Nordic Startup News .",
    "published": "Wed, 03 Mar 2021 13:52:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic startups building radical transparency into tech",
    "link": "https://nordicstartupnews.com/nordic-startups-building-radical-transparency-into-tech/",
    "summary": "Getting through the Nordic winter is trying at the best of times. The previous months have provided few hours of sunshine but an infinite amount of “recommendations” (it is to date not legal for the Swedish government to e.g. enforce a lockdown) formulated in almost as many ways as there are media outlets. The Nordics … The post Nordic startups building radical transparency into tech appeared first on Nordic Startup News .",
    "published": "Tue, 02 Mar 2021 18:16:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonia-based Avokaado secures €700K to automate contract lifecycle management",
    "link": "https://nordicstartupnews.com/estonia-based-avokaado-secures-e700k-to-automate-contract-lifecycle-management/",
    "summary": "Avokaado, a contract lifecycle management platform (CLM) from Estonia, announces a €700K pre-seed round, including Hong Kong’s ParticleX as a strategic investor. Avokaado was founded by legal tech innovator Mariana Hagström in 2016, after experiencing significant inefficiencies in service delivery during her extensive career as an attorney-at-law and managing partner at a law firm. What … The post Estonia-based Avokaado secures €700K to automate contract lifecycle management appeared first on Nordic Startup News .",
    "published": "Sat, 27 Feb 2021 18:19:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "“Unconventional Accelerator”: The first digital accelerator targeting underrepresented Nordic founders",
    "link": "https://nordicstartupnews.com/unconventional-accelerator-the-first-digital-accelerator-targeting-underrepresented-nordic-founders/",
    "summary": "Since launching its report on who funds whom in the Nordics, together with partners like Startup Sweden and NVCA, the team at Unconventional Ventures have been busy. They recently launched the UV Syndicate, giving everyone the opportunity to co-invest in, by UV vetted, startups at pre-seed and seed stages. Today they announce the first digital … The post “Unconventional Accelerator”: The first digital accelerator targeting underrepresented Nordic founders appeared first on Nordic Startup News .",
    "published": "Wed, 13 Jan 2021 19:42:07 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish AI writing tool Flowrite closes pre-seed funding which includes Unity founder David Helgason",
    "link": "https://nordicstartupnews.com/finnish-ai-writing-tool-flowrite-closes-pre-seed-funding-which-includes-unity-founder-david-helgason/",
    "summary": "Finnish startup Flowrite, building an AI-powered writing tool on OpenAI’s GPT-3, has closed a pre-seed funding round of €550,000 from Europe’s leading early-stage investors Lifeline Ventures and Seedcamp, joined by angel investors including Unity founder David Helgason. Flowrite is among the first companies globally to launch and raise funding for a product built on top … The post Finnish AI writing tool Flowrite closes pre-seed funding which includes Unity founder David Helgason appeared first on Nordic Startup News .",
    "published": "Wed, 09 Dec 2020 12:39:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "10 Latvian startups to watch",
    "link": "https://nordicstartupnews.com/10-latvian-startups-to-watch/",
    "summary": "A small nation of fewer than 2 million people, Latvia is one of Europe’s entrepreneurial hotspots. There are several advantages that ensure that Latvia is a great place for startups starting from a multilingual workforce, affordable costs for operations, a high standard of living, and government support. Latvia has a booming startup ecosystem and a … The post 10 Latvian startups to watch appeared first on Nordic Startup News .",
    "published": "Mon, 16 Nov 2020 11:33:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish startup Linear raises €1.1M to digitalize the real estate business",
    "link": "https://nordicstartupnews.com/finnish-startup-linear-raises-e1-1m-to-digitalize-the-real-estate-business/",
    "summary": "Linear, a company focusing on the digitalization of real estate brokerage, has closed €1.1 million in seed funding.  The company, founded in 2018, offers an AI-driven  digital ecosystem to facilitate the housing trade. They will use the latest funding round on future growth and expansion to new markets. Linear offers realtors a comprehensive SaaS (Software as … The post Finnish startup Linear raises €1.1M to digitalize the real estate business appeared first on Nordic Startup News .",
    "published": "Tue, 10 Nov 2020 14:34:16 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kaffe Bueno closes EUR 1.1 million seed round for coffee by-product upcycling",
    "link": "https://nordicstartupnews.com/kaffe-bueno-closes-eur-1-1-million-seed-round-for-coffee-by-product-upcycling/",
    "summary": "Danish Industrial biotech startup Kaffe Bueno received EUR 1.1 million from, PINC (Paulig Group venture capital, FI), Vækstfonden (DK), The Yield Lab (IE), and a Danish business angel. The money will be spent on scaling up production, growing the team, IPR, and further process and product development. Kaffe Bueno is an ingredients company using green … The post Kaffe Bueno closes EUR 1.1 million seed round for coffee by-product upcycling appeared first on Nordic Startup News .",
    "published": "Tue, 27 Oct 2020 11:58:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic startup funding – a deep dive into who funds whom",
    "link": "https://nordicstartupnews.com/nordic-startup-funding-a-deep-dive-into-who-funds-whom/",
    "summary": "All male founding teams still get 92.9% of external capital in the Nordics, to build and expand their startups. However, a new report from Unconventional Ventures shows us how a shift towards a more equal distribution of capital can be accelerated.  Unconventional Ventures is a Nordic early-stage investment firm that invest in scaleable tech startups … The post Nordic startup funding – a deep dive into who funds whom appeared first on Nordic Startup News .",
    "published": "Fri, 16 Oct 2020 14:26:31 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish AI & 3D Printing companies lead Spanish accelerator BIND 4.0",
    "link": "https://nordicstartupnews.com/danish-ai-3d-printing-companies-lead-spanish-accelerator-bind-4-0/",
    "summary": "Danish startups AddiFab and Nordbo Robotics, were selected among more than 570 applications from all over the world to develop solutions in collaboration with companies in the health and manufacturing fields, such as BTI and ITP, as part of the BIND 4.0 accelerator. Each year, BIND 4.0, developed by the Department of Economic Development and … The post Danish AI & 3D Printing companies lead Spanish accelerator BIND 4.0 appeared first on Nordic Startup News .",
    "published": "Thu, 06 Aug 2020 12:06:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish edtech CanopyLAB acquires Peruvian publishing startup YoPublico to serve rapidly expanding userbase in Latin America.",
    "link": "https://nordicstartupnews.com/danish-edtech-canopylab-acquires-peruvian-publishing-startup-yopublico-to-serve-rapidly-expanding-userbase-in-latin-america/",
    "summary": "Danish edtech CanopyLAB is behind a social and adaptive learning platform that is being used in more than 85 different countries. By Esben Trier Based on co-founder Sahra-Josephine Hjorth’s Ph.D. research at the University of Aalborg, CanopyLAB launched its product in late 2018 with a focus on corporate learning. With COVID-19 CanopyLAB’s reach expanded dramatically … The post Danish edtech CanopyLAB acquires Peruvian publishing startup YoPublico to serve rapidly expanding userbase in Latin America. appeared first on Nordic Startup News .",
    "published": "Fri, 26 Jun 2020 20:11:34 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Baltic startup Cargo Stream aims to reduce Covid-19 stress on logistics sector",
    "link": "https://nordicstartupnews.com/baltic-startup-cargo-stream-aims-to-reduce-covid-19-stress-on-logistics-sector/",
    "summary": "Due to the current Coronavirus crisis, supply chains around the world are being disrupted. Cargo Stream – a logistics management system established in Lithuania, is proposing a solution that optimize logistics processes and utilizes the potential of communication between the carriers, recipients, and logistics companies. Cargo Stream enables companies to manage logistics documentation and data … The post Baltic startup Cargo Stream aims to reduce Covid-19 stress on logistics sector appeared first on Nordic Startup News .",
    "published": "Tue, 16 Jun 2020 07:05:16 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New startup wants to help Danes get 11 billion in forgotten tax deductions",
    "link": "https://nordicstartupnews.com/new-startup-wants-to-help-danes-get-11-billion-in-forgotten-tax-deductions/",
    "summary": "Each year, Danes miss out on 11 billion kroner in deductions, either because people don’t know what they are entitled to, or because the process is simply too cumbersome. Tax Helper wants to change that.  By Aske Buemann Taxes and deductions can give many a blank look in their eyes. Therefore, two entrepreneurs will now help people find … The post New startup wants to help Danes get 11 billion in forgotten tax deductions appeared first on Nordic Startup News .",
    "published": "Wed, 10 Jun 2020 18:07:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish startup PackitUp launches a platform to help in the Coronavirus pandemic",
    "link": "https://nordicstartupnews.com/danish-startup-packitup-launches-a-platform-to-help-in-the-coronavirus-pandemic/",
    "summary": "Copenhagen-based travel startup, PackitUp, is on a mission to provide help in the time of Coronavirus crisis. The team turned their existing social network platform into BringHero help platform, where people can either offer or request for help during the COVID-19 pandemic.  By Ira Leino The platform functions worldwide on voluntary-basis, and therefore, is completely … The post Danish startup PackitUp launches a platform to help in the Coronavirus pandemic appeared first on Nordic Startup News .",
    "published": "Wed, 13 May 2020 10:23:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "How Estonia Became A Tech Startup Nation",
    "link": "https://nordicstartupnews.com/how-estonia-became-a-tech-startup-nation/",
    "summary": "Situated in Northern Europe, Estonia is home to around 325 million people. Back in 1991, when Estonia gained independence from the Soviet Union, it was a relatively poor country. However, this relatively small country, that includes around 1500 islands, has slowly but surely made its mark by evolving into a top startup nation. But how … The post How Estonia Became A Tech Startup Nation appeared first on Nordic Startup News .",
    "published": "Tue, 07 Apr 2020 13:05:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norway’s Playpulse launches in China, part of a growing trend of Nordic startups in Shenzhen",
    "link": "https://nordicstartupnews.com/norways-playpulse-launches-in-china-part-of-a-growing-trend-of-nordic-startups-in-shenzhen/",
    "summary": "Norwegian startup Playpulse has successfully launched their gaming bikes in an activity park for children in a shopping mall in Shenzhen, China, part of the China Bay Area and a major startup hub. The company’s mission is to turn exercise into a fully-fledged computer gaming experience, boosting exercise motivation and battling sedentary lifestyles across the … The post Norway’s Playpulse launches in China, part of a growing trend of Nordic startups in Shenzhen appeared first on Nordic Startup News .",
    "published": "Tue, 07 Jan 2020 13:26:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Japanese investors are favoring Finland and Estonia",
    "link": "https://nordicstartupnews.com/japanese-investors-are-favoring-finland-and-estonia/",
    "summary": "New report on Japanese Investments launched last week at Slush shows that when it comes to Japanese investments going in to the Nordic regions, Finland & Estonia is leading.  The report was made by Innovation Lab Asia, Nordic Ninja VC and Copenhagen Capacity. According to the report, since 2013, 22 of the 36 Japanese investments … The post Japanese investors are favoring Finland and Estonia appeared first on Nordic Startup News .",
    "published": "Fri, 29 Nov 2019 14:32:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startups in Helsinki and Stockholm lead Nordics on global outlook",
    "link": "https://nordicstartupnews.com/startups-in-helsinki-and-stockholm-lead-nordics-on-global-outlook/",
    "summary": "Whether or not a startup scales has a lot to do with their motivation. A new report -— published by Nesta as part of the Startup Europe Partnership -— shows that there is substantial variation in entrepreneurs’ motivations to grow and seek finance across Europe. How do Nordic startups fare compared to their European counterparts? … The post Startups in Helsinki and Stockholm lead Nordics on global outlook appeared first on Nordic Startup News .",
    "published": "Sat, 23 Nov 2019 09:30:59 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Fintech startup EnFuce raises €10 million for sustainability service",
    "link": "https://nordicstartupnews.com/fintech-startup-enfuce-raises-e10-million-for-sustainability-service/",
    "summary": "Finland’s Enfuce secures €10 million from Maki.vc to launch a sustainability service, MyCarbon Action, a service for banks and financial service providers to help customers track their carbon footprint per purchase. Finnish payment service provider Enfuce has today announced its new funding round of €10M, led by the early-stage VC firm Maki.vc and including venture … The post Fintech startup EnFuce raises €10 million for sustainability service appeared first on Nordic Startup News .",
    "published": "Fri, 22 Nov 2019 07:51:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sweden’s Creandum wins VC fund of the year",
    "link": "https://nordicstartupnews.com/swedens-creandum-wins-vc-fund-of-the-year/",
    "summary": "The Creandum funds won the “Venture Capital Fund of the Year” award at the 17th Investor Allstars event last night distinguished with the honors due to the outstanding performance over the previous year driven by exits from Spotify, iZettle, Small Giant Games, and Elastic. According to industry experts, the Creandum II fund is the best … The post Sweden’s Creandum wins VC fund of the year appeared first on Nordic Startup News .",
    "published": "Mon, 07 Oct 2019 09:39:33 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "From linear to circular: Six green startups that will change our economy",
    "link": "https://nordicstartupnews.com/linear-circular-six-green-startups-will-change-economy/",
    "summary": "From more than 200 startups, only six were chosen to pitch at the finals of the Green Alley Awards, An award that aims to turn the linear economy into a circular economy. Even though there was only one winner, all six startups are worth keeping an eye on. Often it is the newcomers, the small, … The post From linear to circular: Six green startups that will change our economy appeared first on Nordic Startup News .",
    "published": "Thu, 22 Aug 2019 08:17:31 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New EU project aims to help startups enter innovations into public procurement processes",
    "link": "https://nordicstartupnews.com/new-eu-project-aims-to-help-startups-enter-innovations-into-public-procurement-processes/",
    "summary": "Is your startup willing to be challenged by purchasers in the public administrations? If so, get in touch Innobrokers, an EU-funded project, aiming at facilitating the procurement of innovative goods and services by strengthening the links between public buyers on the demand side and innovative companies on the supply side. The project addresses startups and … The post New EU project aims to help startups enter innovations into public procurement processes appeared first on Nordic Startup News .",
    "published": "Wed, 12 Jun 2019 10:31:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Nordic mar-tech startups to watch",
    "link": "https://nordicstartupnews.com/5-nordic-mar-tech-startups-to-watch/",
    "summary": "Buoyed by the immense growth of ecommerce, the martech industry continues to go from strength to strength. In the Nordics, Sweden has already established a healthy set of martech companies. If you want to know what to expect from the future of martech in the Nordic countries, keep an eye on these 5 Nordic martech … The post 5 Nordic mar-tech startups to watch appeared first on Nordic Startup News .",
    "published": "Wed, 12 Jun 2019 07:40:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Vilnius positions itself as a global startup ecosystem competitor",
    "link": "https://nordicstartupnews.com/vilnius-positions-itself-as-a-global-startup-ecosystem-competitor/",
    "summary": "At Startup Fair Lithuania last week, the city of Vilnius touted it’s position as a city-sized sandbox to develop and test new products.  A radical open data policy that rivals Estonia’s and a slew of startup friendly regulations make Vilnius a startup ecosystem to watch. Startup Fair Lithuania, an annual event bringing together the local … The post Vilnius positions itself as a global startup ecosystem competitor appeared first on Nordic Startup News .",
    "published": "Thu, 06 Jun 2019 11:03:34 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Is Austin a viable landing pad for Nordic startups in the USA?",
    "link": "https://nordicstartupnews.com/is-austin-a-viable-landing-pad-for-nordic-startups-in-the-usa/",
    "summary": "There are 100s of accelerators, incubators and co-working spaces in Austin. Austin is also the growth capital of USA, with approximately 150 people moving to Austin every day, of which approximately 100 are moving from the California’s Bay Area. But is it a viable landing pad for Nordic startups? At SXSW 2019, Nordic Startup Bits … The post Is Austin a viable landing pad for Nordic startups in the USA? appeared first on Nordic Startup News .",
    "published": "Thu, 06 Jun 2019 08:52:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New Investor PINC focused on Nordic FoodTech Startups",
    "link": "https://nordicstartupnews.com/new-investor-pinc-focused-on-nordic-foodtech-startups/",
    "summary": "PINC is Paulig Group’s corporate venture capital unit. We sat down with the head of PINC, Marika King, for a Q&A to learn more about their investment thesis and how they’re shaping the future of taste. What is PINC? PINC stands for Paulig Incubator and is the innovation and venture arm for radical innovation within … The post New Investor PINC focused on Nordic FoodTech Startups appeared first on Nordic Startup News .",
    "published": "Fri, 31 May 2019 07:40:14 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Nordics get a new €50M deep tech fund",
    "link": "https://nordicstartupnews.com/the-nordics-get-a-new-e50m-deep-tech-fund/",
    "summary": "Serial entrepreneur Inka Mero launches Voima Ventures, the first VC fund in the Nordics with a focus purely on startups with deep tech and science background The first VC in the Nordics focusing purely on startups with deep tech and science background was launched officially today. Voima Ventures’ cornerstone investors are VTT Technical Research Centre … The post The Nordics get a new €50M deep tech fund appeared first on Nordic Startup News .",
    "published": "Mon, 29 Apr 2019 14:17:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Media Honeypot 2019: Media startups connect with legacy companies, but struggle to get funding",
    "link": "https://nordicstartupnews.com/media-honeypot-2019-media-startups-connect-legacy-companies-struggle-get-funding/",
    "summary": "The Media Honeypot series of events started in Helsinki in 2016. Now, three years, and several events later, it the go-to event for media startups.  Heikki Rotko, the founder of Media Honeypot, says that Media Honeypot was born out of a desire to connect startups with their business partners to create the media we as … The post Media Honeypot 2019: Media startups connect with legacy companies, but struggle to get funding appeared first on Nordic Startup News .",
    "published": "Fri, 22 Feb 2019 13:14:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush Tokyo’s Global Gathering supports global ecosystem ambitions",
    "link": "https://nordicstartupnews.com/slush-tokyos-global-gathering-supports-global-ecosystem-ambitions/",
    "summary": "Slush, one of Europe’s largest startup events, has been expanding globally for the past few years and last year held the first ever Slush Tokyo.  At Slush Tokyo 2019, a pre-event called the “Global Gathering” was held to better promote connections between global tech ecosystems. Ms. Haruka Furukawa(CEO, Slush Tokyo), Ms. Kristina Nummila ( Slush … The post Slush Tokyo’s Global Gathering supports global ecosystem ambitions appeared first on Nordic Startup News .",
    "published": "Wed, 20 Feb 2019 11:10:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "From venture capital to peace capital: One startup wants to encourage cooperation with the food that we share",
    "link": "https://nordicstartupnews.com/venture-capital-peace-capital-one-startup-wants-encourage-cooperation-food-share/",
    "summary": "The founder of the startup Colive wants to use premium Cypriot olive oil to spark global conversations about peace. He connects family farms on both sides of the UN Buffer Zone to create the first product in what he hopes will be an entire line of culturally significant ingredients and foods to encourage cooperation. That … The post From venture capital to peace capital: One startup wants to encourage cooperation with the food that we share appeared first on Nordic Startup News .",
    "published": "Tue, 15 Jan 2019 10:21:18 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish foodtech startup Epic Foods opens virtual restaurant",
    "link": "https://nordicstartupnews.com/finnish-foodtech-startup-epic-foods-opens-virtual-restaurant/",
    "summary": "This year at Slush – one of Europe’s largest tech summits, Nordic Startup Bits wanted to take a closer look at some interesting FoodTech startups. We met one of the most exciting entrepreneurs in this scene, Martti Paatela, a former rocket scientist and now CEO and co-founder of the Finish FoodTech startup Epic Foods. According … The post Finnish foodtech startup Epic Foods opens virtual restaurant appeared first on Nordic Startup News .",
    "published": "Tue, 15 Jan 2019 08:26:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New €100m Japanese VC fund backs startups in Nordics and Baltics starting in 2019",
    "link": "https://nordicstartupnews.com/new-e100m-japanese-vc-fund-backs-startups-nordics-baltics-starting-2019/",
    "summary": "BaltCap, together with JBIC IG Partners, a Japanese government backed private equity and venture capital firm, is establishing a new €100m fund focusing on venture capital investments in the field of industrial technology in the Nordic and Baltic region. The fund was announced at Slush 2018 and is launching this year. JB Nordic Ventures is a … The post New €100m Japanese VC fund backs startups in Nordics and Baltics starting in 2019 appeared first on Nordic Startup News .",
    "published": "Wed, 02 Jan 2019 09:49:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Belgian startup Husky  on what they learned from the Nordic startup culture",
    "link": "https://nordicstartupnews.com/belgian-startup-husky-learned-nordic-startup-culture/",
    "summary": "Husky is a Belgian startup, designed to bundle marketers’ needs in one digital tool. It is made by marketers, for marketers. A digital platform like Husky allows you to plan and organize quickly. Managing tasks, projects and communication gets easier. In a recent talk, CEO Peter Desmyttere explains what he learned from the Nordic startup … The post Belgian startup Husky  on what they learned from the Nordic startup culture appeared first on Nordic Startup News .",
    "published": "Mon, 26 Nov 2018 15:37:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Pitching in Georgia – a hidden market for tech travel startups?",
    "link": "https://nordicstartupnews.com/pitching-georgia-hidden-market-tech-travel-startups/",
    "summary": "Estonian travel startup Guide.me recently competed in the Welcome Challenge, a tourism-focused pitching competition in the country of Georgia. The rapid growth in tourism activities in Georgia is a major reason why investors sees Georgia as “currently underserved” by Nordic startups. Which industry employs one in ten people globally and accounts for ten percent of the … The post Pitching in Georgia – a hidden market for tech travel startups? appeared first on Nordic Startup News .",
    "published": "Mon, 26 Nov 2018 15:25:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norway’s Spiff app promotes “social saving”",
    "link": "https://nordicstartupnews.com/norways-spiff-app-promotes-social-saving/",
    "summary": "Spiff app, a Norwegian app soft-launched on iOS this summer, became available for Android users  last week to promote “social saving”, and is the first company to bring this concept to the Norwegian market. Carl-Nicolai Wessmann, Founder & CEO of Spiff, said in a press release: “We are the first to bring the concept of … The post Norway’s Spiff app promotes “social saving” appeared first on Nordic Startup News .",
    "published": "Fri, 12 Oct 2018 11:28:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Record-breaking Danish startup Airtame launches new product, Airtame 2",
    "link": "https://nordicstartupnews.com/record-breaking-danish-startup-airtame-launches-new-product-airtame-2/",
    "summary": "Airtame, a Danish startup that produces a wireless HDMI solution for both the business and education sectors, has announced the launch of their second generation hardware product, Airtame 2. The company started in 2014 with a record-­breaking crowdfunding campaign and a mission to remove cables in professional environments. The new product will deliver much more … The post Record-breaking Danish startup Airtame launches new product, Airtame 2 appeared first on Nordic Startup News .",
    "published": "Wed, 10 Oct 2018 09:17:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Vesterbacka introduces new opportunities to Tartu startup and business communities",
    "link": "https://nordicstartupnews.com/vesterbacka-introduces-new-opportunities-tartu-startup-business-communities/",
    "summary": "Peter Vesterbacka, one of the founders of Angry Birds mobile game and the biggest technology conference in north Europe – Slush, will visit Tartu from 03-04. October. The purpose of the two day visit is to introduce new educational and business opportunities to Tartu start-up community and local entrepreneurs, and to increase regional cooperation between … The post Vesterbacka introduces new opportunities to Tartu startup and business communities appeared first on Nordic Startup News .",
    "published": "Tue, 02 Oct 2018 14:45:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Get Sandwich is Nominated for Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/get-sandwich-nordic-startup-awards/",
    "summary": "Make the World Listen to You Get Sandwich is a startup that wants to help people who are struggling with public speaking by providing them with a library of authentic practice videos. The startup was founded in 2017 by Min’an Tan and Martha Winata, who were also struggling with their public speeches. They believe that … The post Get Sandwich is Nominated for Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:52:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sensative is Nominated for Best Bootstrapped Startup Award by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/sensative-nordic-startup-awards/",
    "summary": "Making Your Home Smart Has Never Been Easier Swedish startup Sensative has created the world’s thinnest door and window sensor. The Strips sensor is a very flexible and accurate Z-Wave sensor that notifies users when something is wrong thanks to its connection to other smart devices in the home. The startup also offers other IoT … The post Sensative is Nominated for Best Bootstrapped Startup Award by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:31:47 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kontigo Care is Nominated for Best Social Impact Startup/Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/kontigo-care-nordic-startup-awards/",
    "summary": "The Future of Addiction Treatment Is Digital Kontigo Care follows the personal journey of its founder, Daniel Benitez, who during his alcohol addiction treatment struggled with alcohol relapses even though he received good treatment. He has not been the only case though. Finding out that traditionally 8 out of 10 patients will relapse into addiction, … The post Kontigo Care is Nominated for Best Social Impact Startup/Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:26:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Travable is Nominated for Best Bootstrapped Startup/Best Social Impact Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/travable-nordic-startup-awards/",
    "summary": "People with Disabilities Are Missing out Places and Events Because of Lack of Info Disabled people who travel might find themselves in an uncharted area full of obstacles and miss places worth visiting just because these locations lack information about accessibility. Now, Travable, a mobile application from an Icelandic startup with the same name is … The post Travable is Nominated for Best Bootstrapped Startup/Best Social Impact Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:22:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Evispot is Nominated for Best FinTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/evispot-nordic-startup-awards/",
    "summary": "The Risk of Making a Bad Business Decision When Lending Can Be Reduced by Using AI Waiting to know the fate of a credit request by sitting on a chair in a bank and facing a clerk across the desk might soon become a thing of the past. In an era when so many things … The post Evispot is Nominated for Best FinTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 07:23:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "TRINE is Nominated for Best Social Impact Startup and Startup of the Year by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/trine-nordic-startup-awards/",
    "summary": "TRINE, the Crowdfunding Platform That Has Helped Nearly 230 Thousand People Get Access to Clean Energy Crowdfunding today is another global trend that is growing continuously. Since its emergence in the late 2000s, it has become popularized due to the individual’s decision-making process as one of the main features, and its viral nature, as it … The post TRINE is Nominated for Best Social Impact Startup and Startup of the Year by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 13:34:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Heartstrings is Nominated for Best AI/Machine Learning Startup/Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/heartstrings-nordic-startup-awards/",
    "summary": "Technology in a Mission for Preventing Heart Diseases “Our vision is saving at least 1 million lives each year,” say the creators of Heartstrings, Allen and Max Mohammadi, and with a vision this concrete and ambitious, is a company not set for success? Their idea, which was born after seeing a senior individual at a … The post Heartstrings is Nominated for Best AI/Machine Learning Startup/Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 13:27:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Bookboost is Nominated for Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/bookboost-nordic-startup-awards/",
    "summary": "How Can Hotels Improve Their Guest Journey with Bookboost? Businesses today are facing new challenges posed mainly by the changing customer behaviour. New trends are being set by the millennials, dubbed the “experience generation”, whose expectations are primarily based on experiences rather than the sense of ownership. This generation has, as such, affected the creation … The post Bookboost is Nominated for Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 13:07:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Zadaa is Nominated for Best Social Impact Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/zadaa-nordic-startup-awards/",
    "summary": "Zadaa fights fast and unsustainable fashion with an app Fast fashion has become yet another challenge in dealing with sustainability or the lack there of, which is why we’ve been seeing a palate of initiatives that try to tackle this issue. These initiatives, transform in tech-based solutions very often, and a perfect example is the … The post Zadaa is Nominated for Best Social Impact Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 12:58:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Teatime Games is Nominated for Startup of the Year/Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/teatime-games-nordic-startup-awards/",
    "summary": "Mobile Games Going More Social Is the New Gaming Trend By believing that mobile game players will find a more social and personalized experience while playing very satisfactory, the Icelandic startup Teatime Games is aiming to revolutionize the mobile gaming landscape. The four founders, Thor Fridriksson, Gunnar Holmsteinn, Johann Thorvaldur Bergthorsson, and Ymir Finnbogason call … The post Teatime Games is Nominated for Startup of the Year/Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 12:49:23 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Social impact startup Sp8ces joins Katapult Accelerator to modernize working spaces",
    "link": "https://nordicstartupnews.com/62382/",
    "summary": "The Danish startup Sp8ces has been accepted as one of twelve startups for the Norwegian accelerator program Katapult, following an intensive 2 months long application process, where the accelerator screened more than 1500 startup applicants. Katapult is an impact focused accelerator, and are taking in startups that are working on a solution or product, which … The post Social impact startup Sp8ces joins Katapult Accelerator to modernize working spaces appeared first on Nordic Startup News .",
    "published": "Sun, 09 Sep 2018 12:52:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "50skills is Nominated for 2018 Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/50skills-nordic-startup-awards/",
    "summary": "Automating the Hiring Process with 50skills Hiring new people and expanding the team is certainly a mark of progress, but it nevertheless adds to the company costs. The Society for Human Resource Management (SHRM) estimates the costs related to new hiring at $4,129, while also pointing out that the average time for filling in a … The post 50skills is Nominated for 2018 Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 11:59:29 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "EnlightAID is Nominated for Best Social Impact Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/enlightaid-nordic-startup-awards/",
    "summary": "A Virtual Fight Against Corruption It’s estimated that 30% of money globally allocated is diverted through acts of corruption annually. Oslo-based social business EnlightAID has the goal to prevent fund misuse with its platform that reads, records, and reports on transactions that happen during fundraising and social and environmental projects. Founders Veronica Celis and Klaus … The post EnlightAID is Nominated for Best Social Impact Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 11:18:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "SportaPost is Nominated for the Best Bootstrapped Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/sportapost-nordic-startup-awards/",
    "summary": "The Sports Fans Are Now in Front of Their Mobile Phones Believing that the biggest sports audience is not at the stadium, but at home with their mobile phones, Mikael Kojo, an experienced graphic designer from Finland, founded a company and launched an application for sport-themed graphics, posted on social media by the clubs and … The post SportaPost is Nominated for the Best Bootstrapped Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 10:55:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Epic Foods is Nominated for the Best FoodTech/AgriTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/epic-foods-nordic-startup-awards/",
    "summary": "Healthy Meals Delivery for People in Lack of Time and Money The number of times we opt for food delivery often surpasses cases when we choose to cook our own healthy meal, and times have come when home cooking shouldn’t be our only option for healthy nurture. Even when it occurs the take-out food to … The post Epic Foods is Nominated for the Best FoodTech/AgriTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 09:50:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nightingale Health is Nominated for Startup of the Year and Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/nightingale-health-nordic-startup-awards/",
    "summary": "Nightingale Health Enables Preventive Healthcare Teemu Suna and his company Nightingale Health want to help stop the more than 15.5 million deaths from heart disease each year, by focusing on testing and prevention. Nightingale Health says their screening is low cost and three times more accurate than current clinical tools for detecting early heart disease … The post Nightingale Health is Nominated for Startup of the Year and Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 09:38:15 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kara Connect is Nominated for Startup of the Year/Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/kara-connect-nordic-startup-awards/",
    "summary": "Kara Connects Clients with Therapists in a Virtual Office Kara Connect is a startup that was founded in 2015 in Reykjavik by Thorbjorg Vigfusdottir, a former city councilor with a Master’s degree in Education. Building a dedicated team of programmers and healthcare professionals, she has focused on addressing a major challenge pressing the healthcare industry, … The post Kara Connect is Nominated for Startup of the Year/Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 09:14:20 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "SMART-TRIAL is Nominated for the Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/smart-trial-nordic-startup-awards/",
    "summary": "Finding the Way in the Complexity of Clinical Data SMART-TRIAL, a solution developed by Danish IT company MEDEI, helps medical device manufacturers find their way in the complexity of clinical data. It comes at a time when EU Medical Device Regulation introduced in May 2017 puts in place new requirements for the medical device manufacturers. … The post SMART-TRIAL is Nominated for the Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 08:10:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Lion Healthcare is Nominated for Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/lion-healthcare-nordic-startup-awards/",
    "summary": "Insubalance, the Food Supplement That Can Prevent Diabetes With the number of diabetes patients on the rise, the Norwegian startup Lion Healthcare has focused on shifting from the traditional healthcare that includes treatment once the disease is diagnosed and instead is positioning a solution that would prevent the pre and early-stage type 2 diabetes. The … The post Lion Healthcare is Nominated for Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 07:57:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Forecast App is Nominated for Best AI/Machine Learning Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/forecast-app-nordic-startup-awards/",
    "summary": "AI and Machine Learning Take Over the Project Management Software No matter if it’s the public sector, the businesses or the NGO, project implementation and management is something each institution wants to handle seamlessly, and this is exactly where the Danish startup Forecast steps in with their solution to utilize new technology in project management … The post Forecast App is Nominated for Best AI/Machine Learning Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 07:38:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Vainu is Nominated for Best Bootstrapped Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/vainu-nordic-startup-awards/",
    "summary": "Platform That Pinpoints Potential Clients Using AI One of the main challenges of the sales teams is customer acquisition in minimal time, but so far, a lot of time is spent on prospecting and negotiation, without having precise indicators whether a deal can be made. The startup Vainu showed that traditional sales prospecting is inefficient … The post Vainu is Nominated for Best Bootstrapped Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Wed, 22 Aug 2018 14:16:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sp8ces is Nominated for Best Co-working Space by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/sp8ces-nordic-startup-awards/",
    "summary": "Flexibility Is the Future of Work Many people today have turned to flexibility and want to work from other places except their offices and homes. They need places that will be both affordable and inspiring, located in urban areas with nice surroundings. That’s why Danish startup Sp8ces wants to transform some of Copenhagen’s most beautiful … The post Sp8ces is Nominated for Best Co-working Space by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Wed, 22 Aug 2018 12:41:29 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Ultimate AI is Nominated for Best AI/Machine Learning Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/ultimate-ai-nordic-startup-awards/",
    "summary": "Next-Generation Customer Service Powered by AI Customer satisfaction is an integral part of any business and the invested customer service can be a step forward in reaching that aim. However, finding the proper means to communicate with the customers is not a simple process, and it could reflect on the company business operations. In the … The post Ultimate AI is Nominated for Best AI/Machine Learning Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Tue, 21 Aug 2018 13:37:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Timely is Nominated for 2018 Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/timely-nordic-startup-awards/",
    "summary": "Inaccurate Time-Tracking Is Over Mathias Mikkelsen was working at an agency and was really frustrated by the inaccurate methods that businesses were using to track time. That’s why he decided to create Timely and help everyone who needs to track their time for work or simply control their time. The startup was founded in December … The post Timely is Nominated for 2018 Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Tue, 21 Aug 2018 13:20:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swiipe is Nominated for Best Bootstrapped Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/swiipe-nordic-startup-awards/",
    "summary": "Buying with “Just One Click Away” Is Not a Phrase Anymore In the world of online shopping “Buy now” and “Add to cart” buttons are a codeword for getting ready to start filling out forms. Whenever we buy something online there are forms for passwords, usernames, mobile phone numbers, credit card numbers. Swiipe, a Danish … The post Swiipe is Nominated for Best Bootstrapped Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Mon, 20 Aug 2018 09:19:52 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Rask-Rask is Nominated for Best Bootstrapped Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/rask-rask-nordic-startup-awards/",
    "summary": "Stay Healthy in the Comfort of Your Own Home Aarhus-based startup RaskRask gathers the best Danish massagers into one platform. The platform is available in Copenhagen, Aarhus, Odense, Aalborg, Kolding, Frederiksberg, Risskov, and Norresundby and has an average review of 4.8 out of 5 stars, based on a total number of 856 reviews. Founders Albert Iversen, … The post Rask-Rask is Nominated for Best Bootstrapped Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Mon, 20 Aug 2018 08:51:42 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Order YOYO is Nominated for Best FoodTech/AgriTech Startup and Startup of the Year by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/order-yoyo-nordic-startup-awards/",
    "summary": "Takeaway Restaurant Go Digital with OrderYOYO A restaurant, like any other business, must own his/her own customers, communicate with them to keep them returning and maximise the profit. We make that happen. Suggests Thor Angelo, who is a seasoned entrepreneur with nearly 20 years of experience. After five years as an investor and advisor, he … The post Order YOYO is Nominated for Best FoodTech/AgriTech Startup and Startup of the Year by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 17 Aug 2018 11:06:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Maria 01 is Nominated for Best Coworking Space by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/maria-01-nordic-startup-awards/",
    "summary": "Home Base for Ambitious Tech Startups in Helsinki Maria 01 is a community house for tech startups, investors, corporates, and startup support organisations. Aware of the fact that co-working places for tech entrepreneurs are lacking in Helsinki, they decided by offering a safe haven for these enthusiasts, to become the only space in Helsinki that … The post Maria 01 is Nominated for Best Coworking Space by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 17 Aug 2018 10:17:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Plant Jammer is Nominated for Best FoodTech/AgriTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/plant-jammer-nordic-startup-awards/",
    "summary": "Plant Jammer, the AI Cooking Guide Plant Jammer’s CEO and Founder Michael Haase while driving in LA saw a sign that changed his way of thinking; one of the ways to contribute towards saving 1300 gallons of water is not eating a hamburger for lunch, just that day. Upon that, Michael thought “if I am … The post Plant Jammer is Nominated for Best FoodTech/AgriTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 16 Aug 2018 14:16:33 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Innovation House Finland is Nominated for Best Coworking Space by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/innovation-house-finland-nordic-startup-awards/",
    "summary": "Changing the Innovation Culture in Finland Innovation House Finland uses a combination of strong data and creative freedom to help companies grow without forgetting individual well-being. The combination of well-being, quality, and cutting-edge business brings a new generation of innovation culture in Finland. Founders Katja Aalto and Petra Eratuli-Kola want to change the business culture … The post Innovation House Finland is Nominated for Best Coworking Space by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 16 Aug 2018 13:48:51 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Monsenso is Nominated for Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/monsenso-nordic-startup-awards/",
    "summary": "It’s Time to Take Mental Illnesses Seriously Mental health has become a huge social burden and a problem that grows on a daily basis. According to Monsenso founders, it is a major reason for lower life quality. This problem is expected to become the largest burden in the early 2020s. That’s why Monsenso has developed … The post Monsenso is Nominated for Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Wed, 15 Aug 2018 13:14:42 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Lawbotics is Nominated for Best Bootstrapped Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/lawbotics-nordic-startup-awards/",
    "summary": "Making Law Work More Flexible and Transparent While working as a business lawyer, Merete Nygaard always thought about the inaccessibility of law for most people being unfair, as the law should be the foundation of the society, defining rules in everyday living. She always believed that the routine work which leads to the billing of … The post Lawbotics is Nominated for Best Bootstrapped Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Wed, 15 Aug 2018 12:46:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kaffe Bueno is Nominated for Best FoodTech/AgriTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/kaffe-bueno-nordic-startup-awards/",
    "summary": "Zero-Waste in the Coffee Cycle with Kaffe Bueno It is no secret that Danish people love coffee, a commodity consumed on a regular basis which leads towards the growth of its coffee culture to an extent that the consumers are getting more demanding in terms of the quality of the coffee beans, as Euromonitor reports. … The post Kaffe Bueno is Nominated for Best FoodTech/AgriTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Tue, 14 Aug 2018 15:11:06 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Aquasolis Global is Nominated for Best Social Impact Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/aquasolis-nordic-startup-awards/",
    "summary": "Sharing the Noble Goals of the UN for Clean Water In a world where water scarcity affects more than 40 percent of the global population, a  Norwegian startup embarked on a mission with a noble cause – provide cheap water by making proven method for water purification far more efficient. Founded by three young Norwegian … The post Aquasolis Global is Nominated for Best Social Impact Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Tue, 14 Aug 2018 07:39:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Chooose is Nominated for 2018 Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/chooose-nordic-startup-awards/",
    "summary": "Fixing the Problem of the Carbon Markets Established with the goal of reducing greenhouse gas emission, the carbon markets use tradable carbon credits as permits for the release of certain amounts of carbon dioxide by the industries. Making carbon emissions tradable means pricing the pollution which in turn should lead to less pollution. Yet despite … The post Chooose is Nominated for 2018 Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Mon, 13 Aug 2018 07:00:16 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Young Sustainable Impact (YSI) is Nominated for the Best Social Impact Award by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/ysi-nordic-startup-awards/",
    "summary": "The Youth of Today Is the Future of tomorrow No matter how hard the generations of yesterday tried to rid the world of poverty, hunger, water scarcity, lack of healthcare and plethora of other problems, the fact is many of the challenges still remain active and the responsibility to solve them now lies before the … The post Young Sustainable Impact (YSI) is Nominated for the Best Social Impact Award by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Mon, 13 Aug 2018 06:26:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Payr is Nominated for Startup of the Year, Best Fintech Startup and Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/payr-nordic-startup-awards/",
    "summary": "Efficient and Easy-For-Use Finance Management App About 75% of consumers never review or renegotiate their service providers like banks, electricity, insurance etc because it can be confusing and time-consuming figuring out what the best deals and terms are, so consumers stay with the same provider. In order to bring order and efficiency into the services … The post Payr is Nominated for Startup of the Year, Best Fintech Startup and Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 10 Aug 2018 13:27:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "ARYZE is Nominated for Best Newcomer Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/aryze-nordic-startup-awards/",
    "summary": "New Era for the Traditional Payment Infrastructure Witnessing a revolution in the fintech industry, the Danish startup ARYZE saw an opportunity in “making ‘analog’ money smarter.” While the hype of blockchain and IoT in the financial world is getting more attention, individuals and businesses are still relying on a traditional payments infrastructure, which makes money … The post ARYZE is Nominated for Best Newcomer Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 10 Aug 2018 12:09:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Arctic15 launches new Funding Program for early-stage startups and angel investors",
    "link": "https://nordicstartupnews.com/arctic15-launches-new-funding-program-early-stage-startups-angel-investors/",
    "summary": "Arctic15, the most effective matchmaking startup event in the Nordics and Baltics, has announced its new Funding Program. The program takes over the classic pitching competition to focus on connecting early-stage startups and angel investors across the region. The Funding Program was created in collaboration with business angels networks FiBAN and NordicBAN. The goal of … The post Arctic15 launches new Funding Program for early-stage startups and angel investors appeared first on Nordic Startup News .",
    "published": "Fri, 11 May 2018 00:04:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The six cleantech startups to watch in 2019",
    "link": "https://nordicstartupnews.com/six-cleantech-startups-watch-2019/",
    "summary": "Every year, EIT Climate-KIC hosts the Climate Impact Battle at Slush. 30 pre-selected startups pitch the first day of the event. Only six makes it to the final on the last day of Slush. This year, the six finalists challenged climate change from a broad spectrum of solutions ranging from tiny insects to large-scale construction. … The post The six cleantech startups to watch in 2019 appeared first on Nordic Startup News .",
    "published": "Thu, 10 May 2018 09:28:07 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norway based global impact accelerator open for next batch of startups",
    "link": "https://nordicstartupnews.com/norway-based-global-impact-accelerator-open-next-batch-startups/",
    "summary": "Startups from across the world are now invited to apply for round three of Katapult Accelerator in Oslo, Norway. To be selected, the startups must be early-stage and use exponential technology like blockchain or AI to solve a social or environmental challenge. “The Katapult Accelerator is the world’s first global for-profit accelerator focusing solely on … The post Norway based global impact accelerator open for next batch of startups appeared first on Nordic Startup News .",
    "published": "Wed, 09 May 2018 23:58:58 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "“English” and “Sociability” are top skills for landing a startup job in Denmark",
    "link": "https://nordicstartupnews.com/english-sociability-top-skills-landing-startup-job-denmark/",
    "summary": "Looking for a job at a startup in Denmark? Well, be aware because in start-up land there is quite a few skills that you need to master no matter what kind of work you want to do. Often you will moreover find that the startup founders are looking for that special thing, the x-factor, that … The post “English” and “Sociability” are top skills for landing a startup job in Denmark appeared first on Nordic Startup News .",
    "published": "Wed, 09 May 2018 23:44:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "For art and antique collectors, Danish entrepreneurs brings “What’s it worth” concept online",
    "link": "https://nordicstartupnews.com/art-antique-collectors-danish-entrepreneurs-brings-whats-worth-concept-online/",
    "summary": "The Danish startup Mearto, started by entrepreneurs, Mads Hallas Bjerg and Johan Laidlaw, have created an online appraisal, or “what’s it worth” service, that helps people find the value of art and antiques. The interest for art and antiques is rising. Countless television shows like Antiques Roadshow captivate people at home when the hunt for … The post For art and antique collectors, Danish entrepreneurs brings “What’s it worth” concept online appeared first on Nordic Startup News .",
    "published": "Thu, 29 Mar 2018 13:07:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Disior raises €600,000 in seed funding for novel bone fracture and tissue analysis",
    "link": "https://nordicstartupnews.com/disior-raises-e600000-seed-funding-novel-bone-fracture-tissue-analysis/",
    "summary": "Finnish medical software creator Disior has received a capital boost from Maki.vc and seed investors for novel method of analyzing bone fractures and soft tissue. The Finnish company  Disior have developed a novel, AI-powered conversion tool for analysis of bone fractures and soft tissue that cuts down the processing time from weeks to minutes. Compatible with … The post Disior raises €600,000 in seed funding for novel bone fracture and tissue analysis appeared first on Nordic Startup News .",
    "published": "Wed, 28 Mar 2018 07:26:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Your Royal Gayness mixes parody with sexual diversity",
    "link": "https://nordicstartupnews.com/royal-gayness-mixes-parody-sexual-diversity/",
    "summary": "Lizard Hazard Games, a small indie studio from Finland, has launched its Kickstarter-funded PC game called Your Royal Gayness. The game is a story-driven parody game with a strong message about acceptance of sexual diversity. “The subject of Your Royal Gayness is very personal to me. I’m a queer woman and while I’m fortunate to … The post Your Royal Gayness mixes parody with sexual diversity appeared first on Nordic Startup News .",
    "published": "Tue, 30 Jan 2018 09:26:39 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Nordic Startups talk business at the European Parliament",
    "link": "https://nordicstartupnews.com/5-nordic-startups-talk-business-european-parliament/",
    "summary": "The European Innovation Week is a joint initiative from the European Union institutions, which will feature a series of seminars for the whole week, starting today. Aside the 9th European Innovation Summit , Knowledge4Innovation , a non profit platform for innovation, has organized the first European Startup Convention at the European Parliament in Brussels, Belgium. … The post 5 Nordic Startups talk business at the European Parliament appeared first on Nordic Startup News .",
    "published": "Tue, 12 Dec 2017 14:22:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "10 hottest cleantech startups in Europe",
    "link": "https://nordicstartupnews.com/10-hottest-cleantech-startups-europe/",
    "summary": "From extending battery life to make value out of wood waste, ten cleantech startups pitched their ideas to tackle the climate crisis at this year’s Slush. This year’s Slush was all about changemakers and the oncoming sustainable revolution. While a lot of startups attending the two-day conference had the potential of making a change, ten … The post 10 hottest cleantech startups in Europe appeared first on Nordic Startup News .",
    "published": "Wed, 06 Dec 2017 10:54:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kieku Labs CEO on AI in podcasts: “AI can do the legwork for you”",
    "link": "https://nordicstartupnews.com/kieku-labs-ceo-ai-podcasts-ai-can-legwork/",
    "summary": "Kieku Labs is technology company creating a personal audio listening stream. Kieku is an independent direct community of speakers and listeners. Kieku is both voices from the street and studio, a place for anyone to connect with audience. Kieku Labs was founded in Helsinki 2016. Kieku offers an easy way to listen to content that … The post Kieku Labs CEO on AI in podcasts: “AI can do the legwork for you” appeared first on Nordic Startup News .",
    "published": "Mon, 04 Dec 2017 14:40:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish startup Kodiak Rating on the challenges of bootstrapping",
    "link": "https://nordicstartupnews.com/swedish-startup-kodiak-rating-challenges-boostrapping/",
    "summary": "Kodiak Rating, headquartered in Stockholm, Sweden, has been up and running since 2014, offering cloud-based services and apps to enhance the way companies manage sustainable relationships with suppliers globally. Today, they boast customers within the Nordics such as Perstorp, Bravida and Höganäs – aiding global procurement teams to enhance supplier relationship management and responsible sourcing … The post Swedish startup Kodiak Rating on the challenges of bootstrapping appeared first on Nordic Startup News .",
    "published": "Mon, 04 Dec 2017 13:39:57 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Q & A with Didrik Dimmen, co-founder of Norway’s FlowMotion",
    "link": "https://nordicstartupnews.com/q-didrik-dimmen-co-founder-norways-flowmoton/",
    "summary": "Didrik Dimmen helped co-found FlowMotion ONE, a smartphone stabilizer that was successfully crowdfunded on Kickstarter earlier this year.  They recently took home the “Best Newcomer” award at the Norwegian Startup Awards, and have built a passionate global userbase. We caught up with Didrik to ask him a few questions about his entrepreneur journey and the Norwegian startup … The post Q & A with Didrik Dimmen, co-founder of Norway’s FlowMotion appeared first on Nordic Startup News .",
    "published": "Sat, 25 Nov 2017 16:04:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norwegan startup ACT wants to increase the visibility of eco-friendly produce",
    "link": "https://nordicstartupnews.com/norwegan-startup-act-wants-increase-visibility-eco-friendly-produce/",
    "summary": "It is currently easy to compare food based on price, for example, but not so simple to see which food products are the most environmentally friendly. Norwegian startup ACT hopes to change this with their new app. “We have been working on this app for over 2 years and hope that most people will use it … The post Norwegan startup ACT wants to increase the visibility of eco-friendly produce appeared first on Nordic Startup News .",
    "published": "Tue, 21 Nov 2017 05:37:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Want to attend Slush? Valuer is giving away 100 free tickets",
    "link": "https://nordicstartupnews.com/want-attend-slush-valuer-giving-100-free-tickets/",
    "summary": "At the end of this month at the Slush conference in Helsinki, the Danish startup Valuer.ai will be launching its new platform. Their new matchmaking tool will connect corporations and investors to the startups that best match their needs and interests. Valuer was founded in February this year by Daniel Laursen, previously founder of Trendsonline, … The post Want to attend Slush? Valuer is giving away 100 free tickets appeared first on Nordic Startup News .",
    "published": "Thu, 09 Nov 2017 08:18:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "An experienced “godfather” for a prospective founder? Founders of recent Finnish startup successes want to help newcomers past early-stage pitfalls",
    "link": "https://nordicstartupnews.com/experienced-godfather-prospective-founder-founders-recent-finnish-startup-successes-want-help-newcomers-past-early-stage-pitfalls/",
    "summary": "Recently successful Finnish startup entrepreneurs have founded an investment and consulting company in order to help fresh, potential founders direct their efforts more productively and avoid easy mistakes. Start Here Ventures offers starting teams support, hints, valuable contacts, as well as a financial investment – preferably already before the registration of the company. By Tuure … The post An experienced “godfather” for a prospective founder? Founders of recent Finnish startup successes want to help newcomers past early-stage pitfalls appeared first on Nordic Startup News .",
    "published": "Tue, 07 Nov 2017 16:16:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Rising North fund targets cross-border collaborations to boost the Nordic startup ecosystem",
    "link": "https://nordicstartupnews.com/rising-north-fund-targets-cross-border-collaborations-boost-nordic-startup-ecosystem/",
    "summary": "Rising North is a fund that aims to help Nordic startups become global leaders. It finances with up to €50,000 unique projects and initiatives that tackle the challenges limiting the growth of Nordic companies. The fund is operated in Finland by the Startup Foundation, which is a non-profit founded in 2012 to support entrepreneurship and … The post The Rising North fund targets cross-border collaborations to boost the Nordic startup ecosystem appeared first on Nordic Startup News .",
    "published": "Thu, 24 Aug 2017 07:31:42 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Maria 1-0: Former Helsinki hospital is now largest (and hottest) startup hub in the Nordics",
    "link": "https://nordicstartupnews.com/maria-1-0-former-helsinki-hospital-now-largest-hottest-startup-hub-nordics/",
    "summary": "A sign reading “Not a hospital” greets you as you enter the newish start-up hub of Helsinki, Maria 1-0. The first time I walked under the sign, my instant thought was how many people have come here  to seek treatment – the hospital was only closed a few years ago. The possible hospital-creeps, however, disappear … The post Maria 1-0: Former Helsinki hospital is now largest (and hottest) startup hub in the Nordics appeared first on Nordic Startup News .",
    "published": "Sun, 16 Jul 2017 11:43:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Winning with the lean startup model, from Bangladesh to Norway",
    "link": "https://nordicstartupnews.com/winning-lean-startup-model-bangladesh-norway/",
    "summary": "Heidi Berg and her team was one of the winners of the first round of Ignite intrapreneurship programme. She and Nazmin Neza are now developing Engage, a new business venture, in Grameenphone, Telenor Group’s company in Bangladesh. The goal with our product is to help over one million sales agents in Telenor to communicate better … The post Winning with the lean startup model, from Bangladesh to Norway appeared first on Nordic Startup News .",
    "published": "Tue, 04 Jul 2017 07:31:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish startups attract the most VC funding in Europe",
    "link": "https://nordicstartupnews.com/finnish-startups-attract-vc-funding-europe/",
    "summary": "In 2016, Finnish startup and early stage growth companies raised the second highest amount of venture capital funding in Europe when looking at investments as percentage of GDP. The investment amount was almost twice as large as the European average.  Sweden and Denmark are also among the top countries attracting venture capital. Finns can be … The post Finnish startups attract the most VC funding in Europe appeared first on Nordic Startup News .",
    "published": "Thu, 29 Jun 2017 09:03:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "CEO of Feedbackly: Mexican companies more open to the cutting edge",
    "link": "https://nordicstartupnews.com/ceo-feedbackly-mexican-companies-open-cutting-edge/",
    "summary": "At the end of May 2017, Finland’s Feedbackly announced they were planning to expand to Mexico.  Founded in 2013, the company has had success in Europe, where their multichannel customer experience measurement tool has been used by companies such as Kesko, Tiger and XXL Sport.  CEO Jaako Männistö guest blogs about why the company chose … The post CEO of Feedbackly: Mexican companies more open to the cutting edge appeared first on Nordic Startup News .",
    "published": "Thu, 22 Jun 2017 09:18:23 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish startup Iver: We reached our crowdfunding goal in less than 3 hours",
    "link": "https://nordicstartupnews.com/danish-startup-iver-reached-crowdfunding-goal-less-3-hours/",
    "summary": "Nordic design is indeed trending worldwide. In less than three hours the new Danish watch brand IVER Denmark reached their funding goal on Kickstarter with backers from four continents, going well beyond the expectations of the team. Founder Kristian Asbjørn Iversen, shares his insights as to how they prepared for the launch. By Kristian Asbjørn … The post Danish startup Iver: We reached our crowdfunding goal in less than 3 hours appeared first on Nordic Startup News .",
    "published": "Sun, 11 Jun 2017 10:17:29 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "How can the Nordics best compete on the global event stage?",
    "link": "https://nordicstartupnews.com/can-nordics-best-compete-global-event-stage/",
    "summary": "In March 2017, #nordicmade companies took over SXSW at the #nordicmade booth.  With a helpful boost from the Rising North fund, the #nordicmade program included a pitch night, an investor dinner, a partnership with the John Lennon Educational Tourbus and a SaunaBus from Finland. However, it was a challenge for the Nordics to stand out … The post How can the Nordics best compete on the global event stage? appeared first on Nordic Startup News .",
    "published": "Wed, 07 Jun 2017 11:56:07 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finding “the one” at Arctic15",
    "link": "https://nordicstartupnews.com/finding-one-arctic15/",
    "summary": "Last weeks Arctic 15 three day event succeeded in offering a glimpse into the bright future of the Nordics as hundreds of investors, startups and corporates converged once again in the familiar old industrial complex of Kaapelitehdas the ‘Cable Factory’ in western Helsinki. Arctic 15 has grown steadily since its first event in 2011 and … The post Finding “the one” at Arctic15 appeared first on Nordic Startup News .",
    "published": "Tue, 09 May 2017 12:13:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Being a startup at SXSW – Tips from a Danish startup",
    "link": "https://nordicstartupnews.com/startup-sxsw-tips-danish-startup/",
    "summary": "AWE is a Danish startup working on specializing in location based 3D audio augmented solutions.  Recently AWE participated in SXSW (South by Southwest) in Austin, Texas. It was our first time at the huge festival and conference for interactive media, music and film.  Below, we share a few tips about how to find a platform … The post Being a startup at SXSW – Tips from a Danish startup appeared first on Nordic Startup News .",
    "published": "Wed, 26 Apr 2017 05:30:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "How to build a successful hackathon team",
    "link": "https://nordicstartupnews.com/build-successful-hackathon-team/",
    "summary": "Do you want to build a successful hackathon team? Meet five Ultrahack teams and learn how it’s done! Hackathons are often considered as a playground for developers, but even the most brilliant execution is not enough: the concept and how you validate your solution are equally important. And without a proper pitch, the judges and investors … The post How to build a successful hackathon team appeared first on Nordic Startup News .",
    "published": "Wed, 19 Apr 2017 09:23:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "How to name your Nordic startup",
    "link": "https://nordicstartupnews.com/name-nordic-startup/",
    "summary": "Nordic countries have been heralded as the next Silicon Valley – and the numbers don’t lie. The investments in Danish start-ups doubled from 2014 to 2015, while Finland’s start-up gaming industry alone had a turnover of almost $2 billion USD in 2014. Clearly, the start-up scene is booming in the Scandinavian region. By Grant Polachek … The post How to name your Nordic startup appeared first on Nordic Startup News .",
    "published": "Tue, 18 Apr 2017 12:12:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startup Iceland focuses on health and wellness for 2017",
    "link": "https://nordicstartupnews.com/startup-iceland-focuses-health-wellness-2017/",
    "summary": "It is that time of the year again, we are starting the preparation for Startup Iceland 2017. The theme for this year is Personal Data, Health, Wellness and Technology. I want to bring emphasis to the health, wellness and fitness of the founders, my tribe. I have written about why I believe this is important … The post Startup Iceland focuses on health and wellness for 2017 appeared first on Nordic Startup News .",
    "published": "Mon, 20 Mar 2017 10:17:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Rising North promises €550,000 to help Nordic startups in 2017",
    "link": "https://nordicstartupnews.com/rising-north-promises-e550000-help-nordic-startups-2017/",
    "summary": "Rising North is a fund that aims to help Nordic startups become global leaders. The fund was launched in October 2016 with a NASDAQ bell ringing as part of the #nordicmade trip to New York. In her keynote speech at the fund’s launch, Helga Valfells, CEO of NSA Ventures, Iceland, and Steering Board Member at Rising … The post Rising North promises €550,000 to help Nordic startups in 2017 appeared first on Nordic Startup News .",
    "published": "Mon, 20 Mar 2017 10:14:41 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why women in tech are tempted to leave Silicon Valley for Norway",
    "link": "https://nordicstartupnews.com/women-tech-tempted-leave-silicon-valley-norway/",
    "summary": "As Norway tops quality of life and gender equality indexes consistently, it is no surprise that more and more women are looking to leave Silicon Valley – and the bro-culture that dominates the valley- behind for beautiful fjords and generous paternal leave.  We interview 4 women who took the plunge and embraced the Nordic lifestyle. … The post Why women in tech are tempted to leave Silicon Valley for Norway appeared first on Nordic Startup News .",
    "published": "Thu, 09 Mar 2017 11:24:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Interview: Norwegian founder Eivind Lindbråten on people skills in developers and benefits of the remote model",
    "link": "https://nordicstartupnews.com/61999/",
    "summary": "Ways is an Oslo-based tech company that designs and develops Android and iOS applications for businesses from a wide range of different industries. Last week, we had the opportunity to chat with Eivind Lindbråten, the Co-Founder of Ways. In just two short years, Eivind has gone from being a computer science graduate and freelance web … The post Interview: Norwegian founder Eivind Lindbråten on people skills in developers and benefits of the remote model appeared first on Nordic Startup News .",
    "published": "Tue, 24 Jan 2017 09:12:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Business angels invest millions in CanopyLAB’s ed-tech platform",
    "link": "https://nordicstartupnews.com/canopylab-secures-investment-adaptive-interactive-ed-tech-platform/",
    "summary": "On CanopyLAB’s ed-tech platform, companies, NGOs and institutions offer online courses focusing on learning through interaction to support the next generation of e-learning. The vision now has a large investment from a number of business angels. During a research visit to Australia, PhD scholar, Sahra-Josephine Hjorth of Aalborg University became interested in how social media … The post Business angels invest millions in CanopyLAB’s ed-tech platform appeared first on Nordic Startup News .",
    "published": "Tue, 24 Jan 2017 09:04:12 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "3 Nordic smart home products to build your own Apartimentum",
    "link": "https://nordicstartupnews.com/3-nordic-smart-home-products-build-apartimentum/",
    "summary": "The world’s smartest apartment building is Apartimentum, located in Hamburg. It is the brainchild of Xing founder Lars Hinrichs, who has since become an active investor in cutting-edge tech. Apartimentum, which officially opens it’s doors to the public next month, is a converted turn of the century building.  The facade of the building is the … The post 3 Nordic smart home products to build your own Apartimentum appeared first on Nordic Startup News .",
    "published": "Sat, 21 Jan 2017 13:33:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Join ed-tech accelerator xEDU and tap into the Finnish education miracle",
    "link": "https://nordicstartupnews.com/join-fintech-accelerator-xedu-tap-finnish-education-miracle/",
    "summary": "As Finland has topped rankings for the best educational system in the world for years, tapping its know-how is an attractive offer for any young ed-tech startup. However, especially when coming from outside of Finland, it could look like a daunting task to understand the sector which could be horribly bureaucratic and with everyone speaking … The post Join ed-tech accelerator xEDU and tap into the Finnish education miracle appeared first on Nordic Startup News .",
    "published": "Mon, 16 Jan 2017 11:04:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "8 Norwegian startups to keep your eye on",
    "link": "https://nordicstartupnews.com/8-norwegian-startups-keep-eye/",
    "summary": "Norway has only recent emerged as a startup hub, with it now leading the Nordics as the fastest grower in number of investments. However the Norwegian scene is often not acknowledged beyond Opera, and we think it’s time that changed. 1. nLink: Mobile drilling robots  Love them or hate them, the right robot can save us time and money. … The post 8 Norwegian startups to keep your eye on appeared first on Nordic Startup News .",
    "published": "Wed, 11 Jan 2017 08:26:40 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Crowberry Capital has sights set on early stage startups in the Nordics",
    "link": "https://nordicstartupnews.com/crowberry-capital-sights-set-early-stage-startups-nordics/",
    "summary": "Last week, Helga Valfells, CEO of NSA Ventures in Iceland, along with two of the funds’ investment managers, Jenny Ruth Hrafnsdottir and Hekla Arnadottir, announced that they have left NSA Ventures to start their own VC fund, Crowberry Capital. According to the team at Crowberry Capital, NSA has been reviewing its’ investment strategy since 2012 … The post Crowberry Capital has sights set on early stage startups in the Nordics appeared first on Nordic Startup News .",
    "published": "Mon, 26 Dec 2016 18:49:23 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Eye-catching startups from Slush",
    "link": "https://nordicstartupnews.com/5-eye-catching-startups-slush/",
    "summary": "Slush, the largest startup event in the Nordics, took place in the “death month” of November in Helsinki. With over 15,000 attendees comprising 1,700 startups, the array of new companies and technologies can be dizzying.  From the SLUSH 100  pitching competition to the 240 demo booths, here are 5 startups that caught our eye.   … The post 5 Eye-catching startups from Slush appeared first on Nordic Startup News .",
    "published": "Mon, 19 Dec 2016 09:54:41 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The “death month” of Helsinki is boon for startups",
    "link": "https://nordicstartupnews.com/death-month-helsinki/",
    "summary": "November weekend in Helsinki for most of us doesn’t sound like the time of our lives – it’s dark, cold and windy in the seaside city. To make matters worse, the Finnish word for November, Marraskuu, by it’s etymological meaning means the month of death, marras origin from the same word family as Latins mors … The post The “death month” of Helsinki is boon for startups appeared first on Nordic Startup News .",
    "published": "Thu, 08 Dec 2016 12:25:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Medihub: “We hit the bottom but now are on the way to the top”",
    "link": "https://nordicstartupnews.com/medihub-hit-bottom-now-way-top/",
    "summary": "Medihub, an Estonian startup founded in spring 2015 aim at building up a kind of database in which patients can search for affordable and creditable clinics, the services of which suit their needs best. CEO Helary Lainjärv gives us some insight into the company’s past, present and future. You’ve been working as a physician for … The post Medihub: “We hit the bottom but now are on the way to the top” appeared first on Nordic Startup News .",
    "published": "Tue, 22 Nov 2016 08:06:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Denmark’s Startup Everywhere launches app to give access to entrepreneurs globally",
    "link": "https://nordicstartupnews.com/denmarks-startup-everywhere-launches-app-give-access-entrepreneurs-globally/",
    "summary": "Startup Everywhere, a Danish creative content and self-publishing startup, has just launched an app which helps entrepreneurs to navigate cities around the globe. It features co-working spaces, incubators, accelerators, and public working spaces such as cafes with good wifi.  It is currently available in six cities including Copenhagen, Berlin, Lisbon, and Stockholm. Over the last … The post Denmark’s Startup Everywhere launches app to give access to entrepreneurs globally appeared first on Nordic Startup News .",
    "published": "Tue, 08 Nov 2016 11:52:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Roope Mokka: Basic Income Could Be the Moonshot of Our Generation",
    "link": "https://nordicstartupnews.com/roope-mokka-basic-income-moonshot-generation/",
    "summary": "In the startup world the role of an investor is to take “capital off the table”. This means that an entrepreneur can focus on delivering the product, without constantly needing to worry about resources. One of the promises of basic income is to do just that, not only for entrepreneurs but for all of us. … The post Roope Mokka: Basic Income Could Be the Moonshot of Our Generation appeared first on Nordic Startup News .",
    "published": "Tue, 08 Nov 2016 05:36:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Lessons from Oslo Innovation Week: Techfugees, Girls Tech Fest, and more",
    "link": "https://nordicstartupnews.com/61934/",
    "summary": "It was perhaps significant that the recent Oslo Innovation Week (OIW) five-day series of events was preceded by a forty-eight hour Techfugees hackathon where more than one hundred data scientists, engineers, user experience designers and entrepreneurs united in teams to build prototypes alongside refugees, to find solutions to enable better integration into Norwegian society. the … The post Lessons from Oslo Innovation Week: Techfugees, Girls Tech Fest, and more appeared first on Nordic Startup News .",
    "published": "Tue, 01 Nov 2016 05:37:33 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startup Guide Oslo launches with a bang at Oslo Innovation Week",
    "link": "https://nordicstartupnews.com/startup-guide-oslo-launches-bang-oslo-innovation-week/",
    "summary": "Among the many happenings during the recent Oslo Innovation Week, Start-up Guide Oslo was officially released at a launch party hosted by MESH. Start-up Everywhere has previously published Start-up guides for cities like Copenhagen, Stockholm, Berlin and many others with second editions in the planning stage. Now, it is Oslo’s time to shine. Audrey Camp, … The post Startup Guide Oslo launches with a bang at Oslo Innovation Week appeared first on Nordic Startup News .",
    "published": "Wed, 26 Oct 2016 20:38:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic startups ring the bell at NASDAQ, and new Nordic fund is launched",
    "link": "https://nordicstartupnews.com/nordic-startups-ring-bell-nasdaq-new-nordic-fund-launched/",
    "summary": "A delegation of Nordic startups rang the bell at the Nasdaq in New York on October 11th, as part of the #NordicMade showcase. #NordicMade is a community initiative that aims to build bridges between global tech regions and strengthen Nordic cooperation.  The bell-ringing also signaled the launch of a new €1.5 million Nordic fund. Helga … The post Nordic startups ring the bell at NASDAQ, and new Nordic fund is launched appeared first on Nordic Startup News .",
    "published": "Mon, 24 Oct 2016 08:08:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "“Our drivers won’t unionize,” says CEO of MyTaxi, Uber’s European competitor",
    "link": "https://nordicstartupnews.com/drivers-wont-unionize-says-ceo-mytaxi-ubers-european-competitor/",
    "summary": "A new wellspring of employee organization is emerging in the so-called ‘sharing economy’, but the CEO of Daimler-backed ridesharing business MyTaxi, Uber’s main competitor in Europe, has dismissed the trend. By Tamlin Magee As Uber drivers in London and New York organise for the right to collective bargaining, the boss of Europe’s top ride-sharing competitor … The post “Our drivers won’t unionize,” says CEO of MyTaxi, Uber’s European competitor appeared first on Nordic Startup News .",
    "published": "Mon, 24 Oct 2016 07:49:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danske Bank and SUP46 launch open platform TheHub for Swedish startups",
    "link": "https://nordicstartupnews.com/danske-bank-sup46-launch-open-platform-thehub-swedish-startups/",
    "summary": "The open digital platform TheHub.se was launched today by Danske Bank and the Stockholm co-working space SUP46. TheHub aims to give visibility to all Swedish startups by forming a transparent database, and assist startups with recruitment of talents, finding and contacting investors, and offering best practice tools. By launching the platform TheHub.se, Danske Bank and … The post Danske Bank and SUP46 launch open platform TheHub for Swedish startups appeared first on Nordic Startup News .",
    "published": "Sun, 16 Oct 2016 23:53:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "TechBBQ reflections: In the future, recruitment will be big business",
    "link": "https://nordicstartupnews.com/techbbq-reflections-future-recruitment-will-big-business/",
    "summary": "At TechBBQ 2016 in Copenhagen, Denmark, the changing labor market was a hot topic.  The company Praice, who make recruitment software, took the stage to talk about the “Future of Work”. For many years, recruitment agencies and headhunters lived well by finding the right candidates for businesses.  Now, more and more tech startups are working … The post TechBBQ reflections: In the future, recruitment will be big business appeared first on Nordic Startup News .",
    "published": "Mon, 10 Oct 2016 08:10:40 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Help Tayyab: How anti-immigration laws hurt people and startups",
    "link": "https://nordicstartupnews.com/help-tayyab-anti-immigration-laws-hurt-people-startups/",
    "summary": "Startups and small businesses in Sweden and The Nordics have experienced an incredible couple of years in terms of investment and growth and these companies are contributing to the future economic and overall success of the Nordic countries more than ever. However, this has not happened overnight, a lot of people have put in a LOT … The post Help Tayyab: How anti-immigration laws hurt people and startups appeared first on Nordic Startup News .",
    "published": "Mon, 26 Sep 2016 15:39:57 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Jeanne Sullivan on female entrepreneurship, from Oslo to New York",
    "link": "https://nordicstartupnews.com/jeanne-sullivan-female-entrepreneurship-oslo-new-york/",
    "summary": "When visiting Oslo Innovation Week last October, long-time business development investor Jeanne Sullivan was intrigued by the commercial potential she found in the various presenters, taking note of one company in particular. Bubbly, founded by Marianne Hindsgaul from Oslo, is a startup introducing an IoT kiosk to the market that utilizes data that is collected … The post Jeanne Sullivan on female entrepreneurship, from Oslo to New York appeared first on Nordic Startup News .",
    "published": "Mon, 26 Sep 2016 07:45:48 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Stockholm-based fashion startup Looklet gains H&M executive",
    "link": "https://nordicstartupnews.com/stockholm-based-fashion-startup-looklet-gains-hm-executive/",
    "summary": "After 15 years at H&M, Jordan Nasser has joined the Stockholm-based start-up company Looklet, a fast-growing fashion and tech B2B start-up. Jordan Nasser was the Global Head of Digital at H&M, working with all the digital channels for the international fashion retailer from 2008-2014. An early digital media adopter,  he oversaw the implementation of social … The post Stockholm-based fashion startup Looklet gains H&M executive appeared first on Nordic Startup News .",
    "published": "Mon, 22 Aug 2016 09:28:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Shipitwise:  Crowdfunding “couldn’t be easier”",
    "link": "https://nordicstartupnews.com/shipitwise-crowdfunding-couldnt-easier/",
    "summary": "“Fundraising isn’t hard. At least not hard like impossible,” says Shipitwise.  Sander Gansen tells the story of how Shipitwise succeeded on the crowdfunding platform Funderbeam  to raise €176,000 below. As we were going through Startup Wise Guys accelerator, we met a variety of mentors and investors. But there was one we particularly liked. It was … The post Shipitwise:  Crowdfunding “couldn’t be easier” appeared first on Nordic Startup News .",
    "published": "Mon, 08 Aug 2016 08:54:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "International vibe at Startup Passion the ‘key to its success’",
    "link": "https://nordicstartupnews.com/international-vibe-startup-passion-key-success/",
    "summary": "The Startup Passion training and mentoring programme run in partnership with Cursor OY, Finland, has just had their third successful major event. A five-day training course on lean startup, customer development and storytelling, amongst other key topics. Participants drawn from a range countries had the opportunity to strengthen the basic foundations of their startup ideas … The post International vibe at Startup Passion the ‘key to its success’ appeared first on Nordic Startup News .",
    "published": "Mon, 01 Aug 2016 06:14:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Infographic: The best time to send out press releases",
    "link": "https://nordicstartupnews.com/infographic-best-time-send-press-releases/",
    "summary": "“Data provides knowledge, and knowledge about the audience is crucial in media relations,” says Joanna Drabent, CEO & Co-founder of Prowly.com. “Our research gives data for what we already expected: even the best story may get buried in journalists’ inboxes if sent out at a wrong moment.” Here’s a handy infographic about the best times … The post Infographic: The best time to send out press releases appeared first on Nordic Startup News .",
    "published": "Tue, 19 Jul 2016 07:57:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Pitching to American Investors – BookBuses’ demo day in New York",
    "link": "https://nordicstartupnews.com/the-perfect-pitch/",
    "summary": "New York: In a few minutes, Danish BookBuses founder Oscar Aabech Jung will be entering the stage in front of 700 American investors. This is the day Oscar Aabech Jung and the rest of the Danish IT company Book Buses have been working towards the last months. “Demo Day” is for startup businesses looking to … The post Pitching to American Investors – BookBuses’ demo day in New York appeared first on Nordic Startup News .",
    "published": "Mon, 11 Jul 2016 07:03:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Roskilde Festival startup making money out of urine",
    "link": "https://nordicstartupnews.com/festival-startup-makes-money-urine/",
    "summary": "It started as a university project to ensure that the creators could get a ticket to the Roskilde Festival.  But after four yeas of development on a hobby basis at the festival, the project has now become a living.  Meet Peefence, the startup that makes mobile urinals. The Roskilde Festival is a large annual music … The post The Roskilde Festival startup making money out of urine appeared first on Nordic Startup News .",
    "published": "Fri, 01 Jul 2016 07:23:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Lean Green’s sustainable festival gear is a hit at Roskilde Festival",
    "link": "https://nordicstartupnews.com/new-startup-rates-sustainable-festival-gear/",
    "summary": "Sustainability is more than an environmental concept – it’s big business too.  At the Impact Investor Ball last week, several startups pitched their products for a more sustainable future.  Lean Green was one of them.  The company has developed a festival chair in biodegradable and recyclable cardboard. The chair has been a hit at Roskilde … The post Lean Green’s sustainable festival gear is a hit at Roskilde Festival appeared first on Nordic Startup News .",
    "published": "Thu, 30 Jun 2016 08:42:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sweden’s Naturalbox raises capital with Prowly",
    "link": "https://nordicstartupnews.com/swedens-naturalbox-raises-capital-prowly/",
    "summary": "The Stockholm-based healthy food startup Naturalbox explains their successful crowdsourcing campaign on Prowly. Results: coverage in key media channels, nearly 100 investors, 212% campaign overfunding. In order to raise capital for its operations, Naturalbox chose crowdsourcing over a traditional VC, engaging its customers, friends and fans. To make that happen, the startup decided to leverage … The post Sweden’s Naturalbox raises capital with Prowly appeared first on Nordic Startup News .",
    "published": "Mon, 27 Jun 2016 06:59:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "InnovIL’s Rachel Milgram gives an investor’s perspective on funding",
    "link": "https://nordicstartupnews.com/innovils-rachel-milgram-gives-investors-perspective-funding/",
    "summary": "At Infoshare 2016, Rachel Milgram  of InnovIL shared an investor’s perspective on startup funding.  Rachel’s expertise comes from years of working closely with VC’s and business angels to evaluate companies seeking investment and help match them with the right opportunities. “The fundamentals are never going to change”, says Rachel.  “When an investor looks at an … The post InnovIL’s Rachel Milgram gives an investor’s perspective on funding appeared first on Nordic Startup News .",
    "published": "Wed, 15 Jun 2016 15:24:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Green Alley Award takes on Nordic entrepreneurs in the circular economy",
    "link": "https://nordicstartupnews.com/green-alley-award-takes-nordic-entrepreneurs-circular-economy/",
    "summary": "Start-up founders who focus on issues of resource preservation, resource recovery and recycling, often lack access to funding opportunities, as they have difficulty competing the b2b scale-ups that investors see as big money. That is why in 2014 Green Alley, a strategic circular economy investor based in Berlin, initiated the annual Green Alley Award, Europe’s first … The post The Green Alley Award takes on Nordic entrepreneurs in the circular economy appeared first on Nordic Startup News .",
    "published": "Wed, 08 Jun 2016 11:57:20 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish Innovation Compass acquires seed-funding platform SeedFundIt",
    "link": "https://nordicstartupnews.com/swedish-innovation-compass-acquires-seed-funding-platform-seedfundit/",
    "summary": "Swedish Innovation Compass is the app helping entrepreneurs, researchers, and innovators to navigate the innovation support system in Sweden. The user is guided to everything relevant from venture capital, business incubators, government grants and more. After going through Lund University’s accelerator program, the app is sitting at over 5 000 downloads and now has a … The post Swedish Innovation Compass acquires seed-funding platform SeedFundIt appeared first on Nordic Startup News .",
    "published": "Tue, 07 Jun 2016 07:47:48 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic Startup Awards 2016 winners Realm on the year ahead",
    "link": "https://nordicstartupnews.com/nordic-startup-awards-2016-winners-realm-year-ahead/",
    "summary": "Realm has taken home the prestigious ‘Startup of the Year’ at the Nordic Startup Awards 2016.  This is no surprise if you have followed the company’s explosive growth over the last 2 years.  Realm has created a mobile database for developers globally to create advanced applications quickly and easily, and is now in the hands … The post Nordic Startup Awards 2016 winners Realm on the year ahead appeared first on Nordic Startup News .",
    "published": "Thu, 02 Jun 2016 07:57:33 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Nordic Startup Awards 2016 – Grand Finale winners",
    "link": "https://nordicstartupnews.com/61732/",
    "summary": "The Nordic Startup Awards grand finale took place in the Harpa Center in Reykjavik, Iceland, and hosted collaboration with Icelandic Startups.  Attendees from all over the Nordics gathered to celebrate the best startups, accelerators, and investors of the year. Kim Balle, founder of the Nordic Startup Awards, spoke about why the awards are so important … The post The Nordic Startup Awards 2016 – Grand Finale winners appeared first on Nordic Startup News .",
    "published": "Wed, 01 Jun 2016 16:07:34 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startup Extreme invites you to do extreme sports with your next investor",
    "link": "https://nordicstartupnews.com/startup-extreme-invites-extreme-sports-next-investor/",
    "summary": "On June 15-17th, Startup Extreme is inviting an exclusive group of investors, media, connectors, and founders to the small west coast town of Voss, Norway to get to know a selection of the coolest Nordic founders. The twist? Participants will get to know each other while enduring extreme sports in the Norwegian fjords. By having … The post Startup Extreme invites you to do extreme sports with your next investor appeared first on Nordic Startup News .",
    "published": "Wed, 01 Jun 2016 09:44:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Infographic:  How fintech is disrupting the financial world",
    "link": "https://nordicstartupnews.com/infographic-fintech-disrupting-financial-world/",
    "summary": "Fintech is one of the biggest buzzwords in tech right now.  Check out the below infographic to see how exactly how fintech is going to disrupt the financial world, including the best accelerators and investors, the leading fintech hubs, and global fintech investments. This article was compiled based on research by Dr.Discount, the Dutch number … The post Infographic:  How fintech is disrupting the financial world appeared first on Nordic Startup News .",
    "published": "Mon, 30 May 2016 07:17:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why founders must stay humble or risk failure",
    "link": "https://nordicstartupnews.com/five-stages-organisational-crisis/",
    "summary": "Triin Kask, co-founder and CMO/CFO of Estonian based Greenhouse CI, profiled earlier on Nordic Startup Bits, took the stage at infoShare 2016 to share her experience in handling organizational crisis in different growth stages and how founders must stay humble in the face of exponential growth, which creates crisis and turbulence for a company.  Triin’s … The post Why founders must stay humble or risk failure appeared first on Nordic Startup News .",
    "published": "Wed, 25 May 2016 07:30:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "10 takeaways from Startup Day 2016",
    "link": "https://nordicstartupnews.com/10-takeaways-startup-day-2016/",
    "summary": "On April 23, in packed Münchenbryggeriet in Sweden, Startup Day 2016 through open the doors to the Swedish startup scene.  The event included 10 keynote speakers with a well-maintained gender balance, an Impact Expo offering resources for growing startup,   fintech panel discussion, Nordic Startup Awards, and well done startup pitches. After the hype around … The post 10 takeaways from Startup Day 2016 appeared first on Nordic Startup News .",
    "published": "Mon, 09 May 2016 07:57:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic Startup Awards finalists announced",
    "link": "https://nordicstartupnews.com/nordic-startup-awards-finalists-announced/",
    "summary": "The semi-finals of the Nordic Startup Awards are now finished. This series of events promotes and celebrates startups in the Nordic region.  Country winners are chosen for each country, and the finalists move upwards to a grand ceremony held in Iceland at the end of May. Winners in Norway, Iceland, Sweden, Finland, and Denmark have … The post Nordic Startup Awards finalists announced appeared first on Nordic Startup News .",
    "published": "Thu, 05 May 2016 07:59:14 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "IDtracker gets to the bottom of identity theft",
    "link": "https://nordicstartupnews.com/idtracker-gets-bottom-identity-theft/",
    "summary": "Idtracker is a company that was born out of necessity. Sindre Hagen, CEO, had his identity stolen and the company came into being to essentially get to the bottom the case.  Idtracker aims to get to the bottom of identity theft. During the process of trying to obtain further information on his case, Sindre noticed … The post IDtracker gets to the bottom of identity theft appeared first on Nordic Startup News .",
    "published": "Thu, 05 May 2016 07:01:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Silicon Valley-style growth marketing comes to Stockholm",
    "link": "https://nordicstartupnews.com/silicon-valley-style-growth-marketing-comes-stockholm/",
    "summary": "An intensive 10-week program is going to take place starting in May at Sweden’s prized startup hub SUP46. A startup fund called 500 Nordics is helping to propel and cement Stockholm’s reputation as a leading place for startup growth by teaming up with Sweden’s most active early-stage investor, Almi Invest. “We love to support 500Startups … The post Silicon Valley-style growth marketing comes to Stockholm appeared first on Nordic Startup News .",
    "published": "Mon, 25 Apr 2016 10:51:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New startup space Flux is way more than co-working",
    "link": "https://nordicstartupnews.com/flux-not-just-another-startup-space/",
    "summary": "Last week a new collaboration space, Flux, opened in downtown Helsinki. Within the beautiful old Korkeavuorenkatu 35 building, a fresh and funky space has emerged. Already it is a hive of activity and the plan is to continue to have an intensive calendar of events in the coming weeks. Pekka Horo, General Manager, Microsoft Oy … The post New startup space Flux is way more than co-working appeared first on Nordic Startup News .",
    "published": "Mon, 25 Apr 2016 10:37:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Infographic: What’s hot in 2016 with early stage VC investors?",
    "link": "https://nordicstartupnews.com/infographic-whats-hot-2016-early-stage-vc-investors/",
    "summary": "Based on input from some of the top representatives in the Mobile and IoT industry, including Samsug, Qualcomm Ventures, and Motorola, SV House TV has compiled an infographic of what investments are hot with early stage corporate investors in 2016. The post Infographic: What’s hot in 2016 with early stage VC investors? appeared first on Nordic Startup News .",
    "published": "Sat, 23 Apr 2016 07:42:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Feedbackly raises €500,000 funding for product expansion",
    "link": "https://nordicstartupnews.com/61621/",
    "summary": "Finnish startup, Feedbackly, is dedicated to improving customer experiences as well as helping companies to increase their sales. The company has now raised a €500,000 funding round to help bring their new Software as a Service (SaaS) product to the market. When a company uses Feedbackly they are able to aggregate feedback from their clients … The post Feedbackly raises €500,000 funding for product expansion appeared first on Nordic Startup News .",
    "published": "Sat, 23 Apr 2016 07:09:06 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Video: Startup City Project, Reyjavik",
    "link": "https://nordicstartupnews.com/video-startup-city-project-reyjavik/",
    "summary": "Edmonton, the capital of Alberta in Canada, has a strong startup community, which in many ways shares similarities with Iceland.  An Edmonton film crew has create a project about Reykjavik. Check out the short film below. I have written about the strong affinity between the Startup Community in Edmonton and Reykjavik. Last year Startup Edmonton … The post Video: Startup City Project, Reyjavik appeared first on Nordic Startup News .",
    "published": "Tue, 19 Apr 2016 11:16:42 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Looking back: Startup Weekend Helsinki",
    "link": "https://nordicstartupnews.com/looking-back-startup-weekend-helsinki/",
    "summary": "This past weekend, Startup Weekend Helsinki took place in the elegant surroundings of the NewCo building in the Kallio region of Helsinki.  Here is our look back at an inspiring weekend. Chris Georgiev, founder of Imagga, was the lively master of ceremonies, supported by a team of purple t-shirted volunteers. Present were seventy participants in … The post Looking back: Startup Weekend Helsinki appeared first on Nordic Startup News .",
    "published": "Tue, 19 Apr 2016 10:53:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Reasons to join Startup Fest Europe",
    "link": "https://nordicstartupnews.com/five-reasons-join-startup-fest-europe/",
    "summary": "Startup Fest Europe takes place in the Netherlands from 24 – 28 May and aims to bring the world together and help startups grow faster. With more than 28 events will take place in 14 cities across 5 days, Netherlands will transform into the center of the global startup community. These are the hard facts. … The post 5 Reasons to join Startup Fest Europe appeared first on Nordic Startup News .",
    "published": "Fri, 15 Apr 2016 08:21:07 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "A founder looks back: Vibes at SXSW 2016",
    "link": "https://nordicstartupnews.com/founder-looks-back-vibe-sxsw-2016/",
    "summary": "I had the great pleasure of paying a week long visit to South By South West (SXSW) in Austin, Texas in May 2016. My first thoughts on scene were that the interesting mixture of music, film and interactive events created a relaxed environment for people to present their companies and find common goals in their … The post A founder looks back: Vibes at SXSW 2016 appeared first on Nordic Startup News .",
    "published": "Thu, 14 Apr 2016 11:44:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Media Honeypot organizers: “startups die before getting deals”",
    "link": "https://nordicstartupnews.com/media-honeypot-organizers-reverse-pitching/",
    "summary": "Media Honeypot, a “reverse pitching” event for startups and the traditional media industry, was held in Helsinki on April 6, 2016. I sat down with organizers Heikki “Hegu” Rotko, a long time media executive professional and Dmitri Sarle & Jan Ameri from Arctic Startup. Heikki  was recently at SXSW with me as part of the … The post Media Honeypot organizers: “startups die before getting deals” appeared first on Nordic Startup News .",
    "published": "Thu, 14 Apr 2016 08:46:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "xEdu, Northern Europe’s first ed-tech accelerator underway",
    "link": "https://nordicstartupnews.com/northern-europes-first-ed-tech-accelerator-underway/",
    "summary": "Adjacent to the Helsinki University’s Department of Teacher Education, housed at the same University campus that once hosted Finland’s first particle accelerator, xEdu is firing up the first ed-tech accelerator for startups in Northern Europe. The education system in Finland has famously high rankings in world education polls.  While it might seem like Finland’s crown … The post xEdu, Northern Europe’s first ed-tech accelerator underway appeared first on Nordic Startup News .",
    "published": "Thu, 14 Apr 2016 08:39:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Start your engines: Startup Weekend Helsinki VII is coming",
    "link": "https://nordicstartupnews.com/start-engines-startup-weekend-helsinki-vii/",
    "summary": "This coming weekend, 15-17th April, the 7th Startup Weekend Helsinki comes to town. To “Launch a Startup in 54 hours” is the opportunity. Kicking-off on Friday evening, designers, developers, and innovators will pitch ideas to the crowd, form teams and build amazing startups over the course of the weekend. Results will be presented late on … The post Start your engines: Startup Weekend Helsinki VII is coming appeared first on Nordic Startup News .",
    "published": "Wed, 13 Apr 2016 09:52:23 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "With Invesdor, crowdfunding gains increased legitimacy in the Nordics",
    "link": "https://nordicstartupnews.com/with-invesdor-crowdfunding-gains-increased-legitimacy-in-the-nordics/",
    "summary": "Doubling each year over recent years, Crowdfunding has seen dynamic growth from $2.7 billion in 2012, to an expected level greater than $34 billion for last year 2015.  In the Nordics, crowdfunding continues to gain legitimacy, with Finland-based Invesdor becoming the first crowdfunding platform to be granted a MiFID license, which legitimizes the companies ability … The post With Invesdor, crowdfunding gains increased legitimacy in the Nordics appeared first on Nordic Startup News .",
    "published": "Fri, 08 Apr 2016 07:42:20 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Trip Republic secures further seed funding",
    "link": "https://nordicstartupnews.com/trip-republic-secures-funding/",
    "summary": "Trip Republic, the Helsinki-based startup based on travel planning and booking, has just secured a €200,000 round,  bringing their total funding amount since starting to €325,000. The startup was featured earlier this year at Travel Technology Europe  in London, where they were the sole Nordic company nominated for the prestigious Travel Technology Disrupt Award. The … The post Trip Republic secures further seed funding appeared first on Nordic Startup News .",
    "published": "Thu, 07 Apr 2016 11:03:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startup Refugees turns reception centers into startup hubs",
    "link": "https://nordicstartupnews.com/startup-refugees-turns-reception-centers-startup-hubs/",
    "summary": "Startup Refugees, set up by Finnish journalists and entrepreneurs Riku Rantala and Tunna Milonoff, gives refugees the skills to enter the workforce and set up businesses. Rantala and Milonoff got the idea for the project while doing their series Docventures, a popular combination of political documentary films and talk show. The adventurous pair felt they … The post Startup Refugees turns reception centers into startup hubs appeared first on Nordic Startup News .",
    "published": "Tue, 05 Apr 2016 13:55:31 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Media Honeypot aims to help traditional medias innovate – with help from startups",
    "link": "https://nordicstartupnews.com/media-honeypot/",
    "summary": "This week, between the 5th and 6th of April, selected technology start-ups will meet face-to-face with top media brands from the region at Media Honeypot, a new event in Helsinki. Media Honeypot, hosted by Arctic Startup and Partners, brings together media houses and startups providing innovative media solutions, in order to find leads and get … The post Media Honeypot aims to help traditional medias innovate – with help from startups appeared first on Nordic Startup News .",
    "published": "Mon, 04 Apr 2016 10:26:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why founders make bullshit competitor slides and how to do it right",
    "link": "https://nordicstartupnews.com/why-founders-make-bullshit-competitor-slides-and-how-to-do-it-right/",
    "summary": "Pitch doctors will help you to make cool competitor slides. This post will not. Instead it will do the opposite. It will deconstruct competition into what really matters. In the process I will offend you. I will use examples involving your wife. I will use women as examples. Some will find it objectifying and sexists. … The post Why founders make bullshit competitor slides and how to do it right appeared first on Nordic Startup News .",
    "published": "Mon, 04 Apr 2016 07:58:22 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Stockholm based startup Klue to launch a smartphone app in May",
    "link": "https://nordicstartupnews.com/stockholm-based-startup-klue-to-launch-a-smartphone-app-in-may/",
    "summary": "Peer-to-Peer Marketplaces are currently a booming business, thanks to the rise of the internet and high interest in collaborative economy. People are increasingly sharing and swapping what they have to meet their needs through other individuals on online marketplaces. Klue aims to reap the dividends of the sharing economy. Thus, the rise of the multibillion … The post Stockholm based startup Klue to launch a smartphone app in May appeared first on Nordic Startup News .",
    "published": "Sat, 02 Apr 2016 08:04:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Infographic: What it takes to work with early stage corporate VC’s",
    "link": "https://nordicstartupnews.com/infographic-takes-work-early-stage-corporate-vcs/",
    "summary": "SV House TV, aiming to help startups from all over the world learn the learn the know-how, mindset, and culture of Silicon Valley, hosted a Corporate Investor Panel to discuss the hottest investments in 2016. The investors pinpointed mobile technologies and Internet of Things (IoT) as the hottest investments in 2016, and discussed the role … The post Infographic: What it takes to work with early stage corporate VC’s appeared first on Nordic Startup News .",
    "published": "Fri, 01 Apr 2016 07:42:23 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "A startup journey from LA to Estonia and back again",
    "link": "https://nordicstartupnews.com/eriks-journey-la-estonia-back/",
    "summary": "Ever thought on working abroad? Taking a Jobbatical? Teleporting yourself to a new country? That’s something Erik did when he came all the way from LA to work at Startup Wise Guys in Estonia. This happened in March 2014. For two years, he was living in Tallinn, Estonia. Having great time and working at Startup … The post A startup journey from LA to Estonia and back again appeared first on Nordic Startup News .",
    "published": "Thu, 31 Mar 2016 08:48:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Over 20 Nordic startups selected for European fintech top 100",
    "link": "https://nordicstartupnews.com/over-20-nordic-startups-selected-for-european-fintech-top-100/",
    "summary": "Fintech startups from all over Europe were nominated for the European Fintech Awards in Holland.  Now, over 20 of them have been named as part of the “European Fintech Top 100“. This means that the top companies have been invited to participate in the European Fintech Awards on April 14th in Amsterdam, where the top … The post Over 20 Nordic startups selected for European fintech top 100 appeared first on Nordic Startup News .",
    "published": "Wed, 30 Mar 2016 11:09:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Airinum’s breathing mask takes aim at growing city smog problem",
    "link": "https://nordicstartupnews.com/airinum/",
    "summary": "In 2014, Airinum CEO and Co-founder, Alexander Hjertström, moved from Sweden to India to attend a semester of school. Within his first few weeks in India, he noticed he was having asthmatic symptoms due to the poor air quality. This led to a growing concern on Alexander’s part, as he knew that this was not … The post Airinum’s breathing mask takes aim at growing city smog problem appeared first on Nordic Startup News .",
    "published": "Fri, 25 Mar 2016 08:55:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Nordic Startup Awards reveal 2016 shortlist",
    "link": "https://nordicstartupnews.com/nordic-startup-awards-reveal-2016-shortlist/",
    "summary": "Scandinavia’s biggest awards show for startups, the Nordic Startup Awards, has published their shortlist for the best startups of the year out of 740 nominees. In May, the Nordic startup ecosystem gathers to pay tribute to the biggest stars in the scene.  Promising businesses, entrepreneurs, and community builders are honored with awards such as Startup … The post The Nordic Startup Awards reveal 2016 shortlist appeared first on Nordic Startup News .",
    "published": "Wed, 23 Mar 2016 14:48:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Despite taxi drivers protest, Nordic Startup Conference goes off without a hitch",
    "link": "https://nordicstartupnews.com/nordic-startup-conference/",
    "summary": "On March 18, Copenhagen hosted this year’s Nordic Startup Conference, lead by Tech Nordic Advocates.  The event aimed to stimulate the growth of startups and scaling by bringing investors, business leaders, and startups together in one place, to create a collaborative environment. “We are very pleased to be joint co-hosts for the Nordic Startup Conference, … The post Despite taxi drivers protest, Nordic Startup Conference goes off without a hitch appeared first on Nordic Startup News .",
    "published": "Wed, 23 Mar 2016 08:13:16 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Infographic: Cost cutting tips for startups",
    "link": "https://nordicstartupnews.com/61473/",
    "summary": "Couriers Track has created an infographic of their top cost-cutting tips for startups, including  digital advertising, “cloudsourcing”, and taxes. Check it out below. Infographic courtesy of CouriersTrack. The post Infographic: Cost cutting tips for startups appeared first on Nordic Startup News .",
    "published": "Tue, 22 Mar 2016 08:06:51 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why women make better investors than men",
    "link": "https://nordicstartupnews.com/women-make-better-investors-men/",
    "summary": "In a male dominated industry women excel in the world of investing.  Read on to learn why women make better investors than men. The world has changed a lot in the last 50 years; many industries that were once exclusively dominated by men have become more transparent and equal to both genders where applicants compete … The post Why women make better investors than men appeared first on Nordic Startup News .",
    "published": "Mon, 21 Mar 2016 08:41:41 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Venture capitalists in Nordics look for smaller, more secure investments",
    "link": "https://nordicstartupnews.com/venture-capitalists-nordics-look-smaller-secure-investments/",
    "summary": "In the Nordics, venture capitalists (VCs) are looking for smaller investments that are more secure in comparison to Silicon Valley. There has been a staggering 30% decrease in the number of $10m+ rounds in the Nordic technology sector within the first six weeks of 2016 alone. This has helped to spur companies such as Capital … The post Venture capitalists in Nordics look for smaller, more secure investments appeared first on Nordic Startup News .",
    "published": "Fri, 18 Mar 2016 10:21:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startup Tourism takes on the challenges of Iceland’s exploding tourism industry",
    "link": "https://nordicstartupnews.com/startup-tourism-accelerator-seizes-the-challenges-of-icelands-projected-1-7-million-tourists/",
    "summary": "Startup Tourism, a new 10-week accelerator program held in Iceland from February 1st, 2016, is now in full swing.   As the number of tourists in Iceland increases exponentially, startups rush to fill the challenges that arise. Oddur Sturluson, managing director of Startup Tourism, believes there has been a paradigm shift among tourism companies in Iceland, … The post Startup Tourism takes on the challenges of Iceland’s exploding tourism industry appeared first on Nordic Startup News .",
    "published": "Fri, 18 Mar 2016 08:06:21 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Pitching from an ice hole in Finland",
    "link": "https://nordicstartupnews.com/pitch-ice-hole-finland/",
    "summary": "Polar  Bear Pitching 2016 is a global investment event where over the course of 2 days startups from different countries introduce their projects to the whole world – from a freezing ice hole in Oulu, Finland.  We interviewed Anna Svirelkina from To Round about her experience. The event, which is held yearly, allows competing startups … The post Pitching from an ice hole in Finland appeared first on Nordic Startup News .",
    "published": "Wed, 16 Mar 2016 08:47:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Why founders shouldn’t care about market size",
    "link": "https://nordicstartupnews.com/founders-shouldnt-care-market-size/",
    "summary": "Business schools and MBA programs will help you calculate market size. This post will not. Instead it will do the opposite. It will deconstruct market size into what really matters. Knowledge is power. Use it. Many founders go after billion dollar markets. Or so they say. They think they must. Everyone knows that is what … The post Why founders shouldn’t care about market size appeared first on Nordic Startup News .",
    "published": "Mon, 14 Mar 2016 14:20:14 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "London’s Balderton Capital partners with Stockholm’s SUP46",
    "link": "https://nordicstartupnews.com/balderton-capital/",
    "summary": "Balderton Capital, located in London, has just become an International Investor Member at Stockholm’s startup central, SUP46. Since 2000, Balderton has invested in over 100 companies, mostly located within Europe. Having already invested in 11 startups within the Nordic region, the partnership with SUP46 will bring greater access to the Nordic startup scene. Nordic countries … The post London’s Balderton Capital partners with Stockholm’s SUP46 appeared first on Nordic Startup News .",
    "published": "Sun, 13 Mar 2016 16:57:20 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Investoreye adds social dimension to investor communications",
    "link": "https://nordicstartupnews.com/investoreye-adds-social-dimension-to-investor-communications/",
    "summary": "For many companies, managing investor relations means unilateral communications, which may turn into a strategic pitfall. On the other hand, small-scale investors often find it difficult to locate easily understandable investment information on companies. Investoreye offers a tool that solves both of these problems. Different-sized companies are faced with different challenges when it comes to … The post Investoreye adds social dimension to investor communications appeared first on Nordic Startup News .",
    "published": "Wed, 09 Mar 2016 14:04:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Fewer startups are content with traditional equity: here’s why",
    "link": "https://nordicstartupnews.com/fewer-startups-content-traditional-equity-heres/",
    "summary": "For many startups looking to raise venture capital, it looks like traditional equity is no longer enough.  More and more startups are looking at convertible notes or other debt alternatives. By Andrew Woodman Earlier this week, CB insights noted a 700% increase in the dollars raised through convertible notes – that’s basically loans that convert … The post Fewer startups are content with traditional equity: here’s why appeared first on Nordic Startup News .",
    "published": "Tue, 08 Mar 2016 08:05:58 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Experiments in Edtech – Interview with Saku Tuominen, CEO of Scool",
    "link": "https://nordicstartupnews.com/experiments-in-edtech-interview-with-saku-tuominen-ceo-of-scool/",
    "summary": "The Redefining School program, which covered the challenges of education, was featured at Slush 2015. Among the speakers was Saku Tuominen, CEO and Co-Founder of Scool. Scool aims to find the best practices in education and share all the insights and know-how with the world, for free. As Tuominen said in his speech at Slush, … The post Experiments in Edtech – Interview with Saku Tuominen, CEO of Scool appeared first on Nordic Startup News .",
    "published": "Mon, 07 Mar 2016 08:12:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The proportion of women entrepreneurs in Denmark falls",
    "link": "https://nordicstartupnews.com/the-proportion-of-women-entrepreneurs-in-denmark-falls/",
    "summary": "According to new figures from the Danish Business Authority, there has been a positive development in the actual number of female and male entrepreneurs from 2014 to 2015. But at the same time, the number of male entrepreneurs increased significantly more than the number of female entrepreneurs. Entrepreneurship is growing in Denmark, and the number … The post The proportion of women entrepreneurs in Denmark falls appeared first on Nordic Startup News .",
    "published": "Fri, 04 Mar 2016 08:01:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Report highlights need for collaboration between banks and startups",
    "link": "https://nordicstartupnews.com/report-highlights-need-collaboration-banks-startups/",
    "summary": "A new report by BDO and Danske Bank singles out Nordic fintech disrupters as medicine for “sick” banking industry, and emphasizes the need for both fintech startups and traditional banks to form symbiotic relationships if they want to create true positive disruption. “The Fintech Disruptors Report: Nordic Edition” analyzes current trends in the fintech industry … The post Report highlights need for collaboration between banks and startups appeared first on Nordic Startup News .",
    "published": "Wed, 02 Mar 2016 09:56:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Plane launches globally: “We are trying to change the superficial selfie-culture”",
    "link": "https://nordicstartupnews.com/plane-launches-globally-we-are-trying-to-convert-the-superficial-selfie-culture/",
    "summary": "After a test period in Scandinavia, Plane is ready to launch its icebreaker app globally. The launch will occur in connection with the LAUNCH Festival in San Francisco. The founders of plane are CEO and co-founder,Tim Allison , and co-founder, Thomas Baastrup Jacobsen. “We have spent the last few months testing our app in Scandinavia … The post Plane launches globally: “We are trying to change the superficial selfie-culture” appeared first on Nordic Startup News .",
    "published": "Wed, 02 Mar 2016 07:05:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "FuckUp Nights highlight spectacular failures on the road to success",
    "link": "https://nordicstartupnews.com/fuckup-nights-highlight-spectacular-failures-on-the-road-to-success/",
    "summary": "Many entrepreneurs believe that failure is the key to success.  Some Silicon Valley based investors will not even invest in startup founders who had not had a failed startup.  It is, indeed, an important skill to learn in the startup world to let go of something that is a dead end. However, as every founder … The post FuckUp Nights highlight spectacular failures on the road to success appeared first on Nordic Startup News .",
    "published": "Mon, 29 Feb 2016 11:22:47 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Path to startup success: A Nordic to US comparison",
    "link": "https://nordicstartupnews.com/path-startup-success-nordic-us-comparison/",
    "summary": "Successful global growth of ICT, Medtech, green tech and consumer product innovations can be the future for the Nordic economies.  But the process from idea to market success is quite different for the Nordic countries compared to the US. By Jennifer Vessels Sustainable growth requires more than a product idea.  It demands skillful commercialization to … The post Path to startup success: A Nordic to US comparison appeared first on Nordic Startup News .",
    "published": "Wed, 24 Feb 2016 11:31:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Demand is high for female-friendly bootcamp at Girls In Tech Helsinki",
    "link": "https://nordicstartupnews.com/61337/",
    "summary": "Three weeks have passed since the Girls in Tech Skills Bootcamp in Helsinki — it’s time to look back and reflect on what unfolded at the very first event of this kind in the Nordics. When I helped launch the Helsinki chapter of Girls in Tech in spring 2015, we wanted to create a community that would … The post Demand is high for female-friendly bootcamp at Girls In Tech Helsinki appeared first on Nordic Startup News .",
    "published": "Mon, 22 Feb 2016 13:11:41 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "SparkUp launches equity crowdfunding in Norway",
    "link": "https://nordicstartupnews.com/sparkup-launches-equity-crowdfunding-norway/",
    "summary": "A new era is arriving to Oslo.  Equity crowdfunding has been booming, with an explosion of new platforms and regulations. In 2016, crowdfunding is expected to surpass VC investment. With new legislation such as the passage of the JOBS act in the USA, the funding scene is undergoing a sea-change.  While equity crowdfunding is an … The post SparkUp launches equity crowdfunding in Norway appeared first on Nordic Startup News .",
    "published": "Mon, 22 Feb 2016 08:48:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "How – and why – diversified investors win",
    "link": "https://nordicstartupnews.com/diversified-investors-win/",
    "summary": "The term diversification is a term regularly associated with investment strategies and it is without a doubt the single most powerful tool available to investors. Diversification isn’t a difficult concept to understand, yet it is still often misunderstood. Omar Shaikh, founder of Cocoa Invest, a completely independent online saving and investment company, explains exactly what … The post How – and why – diversified investors win appeared first on Nordic Startup News .",
    "published": "Fri, 19 Feb 2016 12:11:07 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "OrderYoyo plans to snatch the takeaway crown",
    "link": "https://nordicstartupnews.com/heavyweights-take-on-just-eats-take-out-throne/",
    "summary": "Serial entrepreneur and investor Thor Angelo has thrown his weight behind OrderYoyo, and plans to overtake Just Eat as the go-to service in the Nordics to order food to your home.   OrderYoyo, who received early investment from SEED Capital , are also said to be in dialogue with international investors. Helle Uth, Investment Manager at … The post OrderYoyo plans to snatch the takeaway crown appeared first on Nordic Startup News .",
    "published": "Wed, 17 Feb 2016 08:44:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic startups in “bootcamp” to scale to the US",
    "link": "https://nordicstartupnews.com/nordic-startups-in-new-york-the-lemonsqueeze-experience/",
    "summary": "The learning curve is steep, but exciting, for 6 Danish founders participating in a US Entry Bootcamp, at Lemonsqueeze in Brooklyn, aimed at ”preparing for a successful launch in the US.” Where Silicon Valley is focused on trends like drones, blockchain and deeplinks, the New York startup scene is broader; tech is just one of … The post Nordic startups in “bootcamp” to scale to the US appeared first on Nordic Startup News .",
    "published": "Tue, 16 Feb 2016 08:59:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Founder of Sustainable Brands: 7 global business trends",
    "link": "https://nordicstartupnews.com/founder-sustainable-brands-7-global-business-trends/",
    "summary": "Sustainable Brands is a global business community dedicated to helping shift the world to a sustainable economy.  In anticipation of their Copenhagen conference in 2016, founder KoAnn Skrzyniarz outlines 7 sustainable, global business trends. KoAnn Skrzyniarz  travels around the world working with large brands to promote sustainability while still maintaining a competitive business. “There will … The post Founder of Sustainable Brands: 7 global business trends appeared first on Nordic Startup News .",
    "published": "Fri, 12 Feb 2016 10:59:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Are fintech startups taking advantage of millennials?",
    "link": "https://nordicstartupnews.com/fintech-startups-taking-advantage-millennials/",
    "summary": "Millennials have grown up with technology, which makes them an entirely new breed of consumer. Armed with their devices, they have the world at their fingertips. But access to more knowledge does not necessarily mean making better choices, or does it? Memories of the financial collapse are firmly embedded in the minds of millennials, which … The post Are fintech startups taking advantage of millennials? appeared first on Nordic Startup News .",
    "published": "Tue, 09 Feb 2016 08:51:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Denmark will lose the startup race without political support",
    "link": "https://nordicstartupnews.com/61282/",
    "summary": "The startup ecosystem in Stockholm will have the backing of both local politicians and large companies – and this is among the reasons why Stockholm’s startups are ahead of their Danish counterparts, according to Tim He of Northzone. The Swedish startup scene blooms in Stockholm, and the Business Region Stockholm, which is part of the … The post Denmark will lose the startup race without political support appeared first on Nordic Startup News .",
    "published": "Mon, 08 Feb 2016 08:57:15 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "SEO tools are booming – which should your startup choose?",
    "link": "https://nordicstartupnews.com/seo-tools-booming-startup-choose/",
    "summary": "The world of SEO (search engine optimization) tools has become a jungle, and choosing which tool to promote your website in search engine rankings is a tough decision.  Below, we compare two of the newest SEO tools geared specifically for startups. RankScanner vs SEORanking RankScanner,was developed by Rune Jensen, an active entrepreneur since the age … The post SEO tools are booming – which should your startup choose? appeared first on Nordic Startup News .",
    "published": "Wed, 03 Feb 2016 13:03:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startups will fall behind if Europe stays disconnected",
    "link": "https://nordicstartupnews.com/startup-development-will-fall-behind-if-europe-stays-disconnected/",
    "summary": "Denmark has just been named the best place to start a business Europe. However, funnily enough the startup environment here is quite disconnected from the rest of Europe. Danish companies tend to expand either to other Nordic countries or go big and enter the US market. Why not enter other European countries? Even though Danish … The post Startups will fall behind if Europe stays disconnected appeared first on Nordic Startup News .",
    "published": "Fri, 29 Jan 2016 10:28:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Capdesk: “The rich are investing to earn money, why not everyone else?”",
    "link": "https://nordicstartupnews.com/capdesk-rich-investing-earn-money-not-everyone-else/",
    "summary": "As the economy created by alternative finance expands, services like Capdesk will become an essential tool for investors.  Capdesk is a shareholder platform that improves the experience for shareholders of unlisted companies by gathering all investor activities in one place. Although currently only a small percentage of people buy shares in unlisted companies (companies not … The post Capdesk: “The rich are investing to earn money, why not everyone else?” appeared first on Nordic Startup News .",
    "published": "Thu, 28 Jan 2016 10:32:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Think twice before investing in these industries",
    "link": "https://nordicstartupnews.com/think-twice-investing-industries/",
    "summary": "Investing in startups is not an easy job. As an investor, you are not only betting on a specific startup and team, but often on a market that doesn’t exist yet. Even the best team in the world is doomed to fail if it undertakes the wrong market.  The opposite is not always true. One … The post Think twice before investing in these industries appeared first on Nordic Startup News .",
    "published": "Wed, 27 Jan 2016 08:03:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Thor Angelo speaks: From entrepreneur to investor",
    "link": "https://nordicstartupnews.com/thor-angelo-speaks-entrepreneur-investor/",
    "summary": "Thor Angelo has for many years worked as a business angel and advisor in Danish startups. Now you can hear him talk about the journey from entrepreneur to investor. Thor Angelo has a past as co-founder of LanguageWire, and nearly 16 years of experience in  internationalization and product development. In addition, he has been an … The post Thor Angelo speaks: From entrepreneur to investor appeared first on Nordic Startup News .",
    "published": "Tue, 26 Jan 2016 09:55:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "3 Life Science startups share their insights from the Life Science Project​",
    "link": "https://techbbq.dk/3-life-science-startups/",
    "summary": "Being a founder of a hardware company is no easy task. We asked four founders to share their insights, so others in the same position can pick up on their learnings. Written by Elisabeth Kungla Jun. 4, 2024 / 5 min. read Written by Elisabeth Kungla / June 5, 2024 – 5 min. read Why […] The post 3 Life Science startups share their insights from the Life Science Project​ appeared first on TechBBQ .",
    "published": "Wed, 05 Jun 2024 06:00:01 +0000",
    "source": "TechBBQ"
  },
  {
    "title": "Tech Arena 2024: A Conversation with Steve Wozniak, Apple Co-founder & Philanthropist",
    "link": "https://techbbq.dk/tech-arena-2024-a-conversation-with-steve-wozniak/",
    "summary": "The Tech Arena 2024 took place in Stockholm, Sweden, on February 22 & 23. The event was hosted at the country’s national football stadium, “Friends Arena,” in the district of Solna, with an attendance of 7.500 guests worldwide. Among the special speaker invites was Apple Co-founder and Philanthropist Steve Wozniak. Written by Keyvan Thomsen Bamdej […] The post Tech Arena 2024: A Conversation with Steve Wozniak, Apple Co-founder & Philanthropist appeared first on TechBBQ .",
    "published": "Mon, 26 Feb 2024 06:00:42 +0000",
    "source": "TechBBQ"
  },
  {
    "title": "#14: Interview with Benjamin Buthmann, Co-founder & CEO of Whyzzer",
    "link": "https://techbbq.dk/14-interview-with-benjamin-buthmann/",
    "summary": "#14: Web Summit 2023: Interview with Benjamin Buthmann, Co-founder and CEO of Whyzzer Written by Keyvan Thomsen Bamdej December 13, 2023 / 6 min. read Interview with Benjamin Buthmann, Co-founder & CEO of Whyzzer Grilled by TechBB I attended Web Summit, one of the world’s largest tech conferences, representing TechBBQ and Danish media. Thanks to its […] The post #14: Interview with Benjamin Buthmann, Co-founder & CEO of Whyzzer appeared first on TechBBQ .",
    "published": "Wed, 13 Dec 2023 04:00:42 +0000",
    "source": "TechBBQ"
  },
  {
    "title": "#13: Interview with Anie Akpe, Founder of African Women in Tech",
    "link": "https://techbbq.dk/13-interview-with-anie-akpe/",
    "summary": "#13: Web Summit 2023: Interview with Anie Akpe, Founder of African Women In Tech Written by Keyvan Thomsen Bamdej December 11, 2023 / 6 min. read Interview with Anie Akpe, Founder of African Women in Tech Grilled by TechBBQ Web Summit connects people & ideas that change the world. I attended Web Summit, one of […] The post #13: Interview with Anie Akpe, Founder of African Women in Tech appeared first on TechBBQ .",
    "published": "Mon, 11 Dec 2023 04:00:38 +0000",
    "source": "TechBBQ"
  },
  {
    "title": "Effektiv økonomistyring starter med det rette revisornetværk",
    "link": "https://startupcentral.dk/effektiv-oekonomistyring-starter-med-det-rette-revisornetvaerk/",
    "summary": "Uanset om man driver en nystartet iværksættervirksomhed, en veletableret familieejet virksomhed eller en hurtigt voksende tech-startup, er én ting sikkert: Professionel økonomistyring og regnskab er afgørende for succes. Mange virksomhedsejere opdager hurtigt, at det ikke er nok at fokusere på produktudvikling og markedsføring – hvis økonomien ikke er i orden, bliver vækst og bæredygtighed en […] Indlægget Effektiv økonomistyring starter med det rette revisornetværk blev først udgivet på Startupcentral .",
    "published": "Thu, 21 Aug 2025 05:48:08 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Sådan bruger du et tidsregistreringssystem – og hvorfor det kan betale sig",
    "link": "https://startupcentral.dk/saadan-bruger-du-et-tidsregistreringssystem-og-hvorfor-det-kan-betale-sig/",
    "summary": "Sponsoreret indlæg Effektivitet og økonomisk ansvarlighed er nøgleord i enhver moderne virksomhed. I takt med skærpede krav til dokumentation og arbejdsmiljø er tidsregistrering ikke længere blot en fordel – det er i mange tilfælde et lovkrav. Et digitalt tidsregistreringssystem gør det muligt at dokumentere arbejdstid præcist, reducere spildtid og sikre optimal ressourceudnyttelse. Hvorfor tidsregistrering er […] Indlægget Sådan bruger du et tidsregistreringssystem – og hvorfor det kan betale sig blev først udgivet på Startupcentral .",
    "published": "Sun, 23 Mar 2025 14:50:21 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Aconto skat: en uundværlig guide for iværksættere i Danmark",
    "link": "https://startupcentral.dk/aconto-skat-en-uundvaerlig-guide-for-ivaerksaettere-i-danmark/",
    "summary": "Tag kontrol over din økonomi som iværksætter med en dybdegående forståelse af aconto skat og dens indflydelse på din virksomhed. Indlægget Aconto skat: en uundværlig guide for iværksættere i Danmark blev først udgivet på Startupcentral .",
    "published": "Sat, 08 Feb 2025 07:29:20 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Egenkapitalens rolle i iværksætteri: En dybdegående analyse",
    "link": "https://startupcentral.dk/egenkapitalens-rolle-i-ivaerksaetteri-en-dybdegaaende-analyse/",
    "summary": "Udforsk de mange facetter, hvor egenkapital spiller en kritisk rolle i opstart, vækst og risikohåndtering af virksomheder. Indlægget Egenkapitalens rolle i iværksætteri: En dybdegående analyse blev først udgivet på Startupcentral .",
    "published": "Sat, 08 Feb 2025 07:29:19 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Kørepenge 2024: optimale strategier for iværksættere",
    "link": "https://startupcentral.dk/koerepenge-2024-optimale-strategier-for-ivaerksaettere/",
    "summary": "Opdag hvordan de nye satser og regler for kørepenge i 2024 kan influere din virksomhed og hvordan du bedst muligt håndterer disse for at optimere omkostningerne. Indlægget Kørepenge 2024: optimale strategier for iværksættere blev først udgivet på Startupcentral .",
    "published": "Sat, 08 Feb 2025 07:29:18 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Bøger som uvurderlige ressourcer for iværksættere",
    "link": "https://startupcentral.dk/boeger-som-uvurderlige-ressourcer-for-ivaerksaettere/",
    "summary": "Opdag hvordan bøger kan fungere som en kilde til inspiration, praktisk viden og strategiske indsigter for iværksættere på enhver niveau. Indlægget Bøger som uvurderlige ressourcer for iværksættere blev først udgivet på Startupcentral .",
    "published": "Wed, 05 Feb 2025 04:52:16 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Slå nummerplade op: En essentiel guide for iværksættere inden for bilbranchen",
    "link": "https://startupcentral.dk/slaa-nummerplade-op-en-essentiel-guide-for-ivaerksaettere-inden-for-bilbranchen/",
    "summary": "Opdag, hvordan du kan optimere biltransaktioner med dyb indsigt fra nummerpladeopslag, essentiel for moderne iværksætteri. Indlægget Slå nummerplade op: En essentiel guide for iværksættere inden for bilbranchen blev først udgivet på Startupcentral .",
    "published": "Wed, 05 Feb 2025 04:52:16 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Forstå befordringsfradrag: Hvordan det kan gavne iværksættere",
    "link": "https://startupcentral.dk/forstaa-befordringsfradrag-hvordan-det-kan-gavne-ivaerksaettere/",
    "summary": "Udforsk betydningen af befordringsfradrag for iværksættere, både for dem med sidestillet lønmodtagelse og dem med specifikke fradragsmuligheder. Indlægget Forstå befordringsfradrag: Hvordan det kan gavne iværksættere blev først udgivet på Startupcentral .",
    "published": "Wed, 05 Feb 2025 04:52:14 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Revisor: En essentiel partner for iværksættere",
    "link": "https://startupcentral.dk/revisor-en-essentiel-partner-for-ivaerksaettere/",
    "summary": "Opdag hvordan en revisor kan spille en afgørende rolle i din virksomheds succes og vækst ved at tilbyde strategisk rådgivning, økonomisk indsigt og risikohåndtering. Indlægget Revisor: En essentiel partner for iværksættere blev først udgivet på Startupcentral .",
    "published": "Tue, 04 Feb 2025 07:57:27 +0000",
    "source": "Startupcentral"
  },
  {
    "title": "Dutch startup LeydenJar closes new investment round of €13 million to launch first 100% silicon anode production facility",
    "link": "https://www.eu-startups.com/2025/09/dutch-startup-leydenjar-closes-new-investment-round-of-e13-million-to-launch-first-100-silicon-anode-production-facility/",
    "summary": "LeydenJar, a Leiden-based DeepTech company innovating 100% pure silicon anodes for lithium-ion batteries, today announced €13 million in funding to bring its technology into full-scale production at its Eindhoven facility PlantOne. The financing was led by Extantia and Invest-NL, which will be used to complete the last phase of the PlantOne construction and start operations […] The post Dutch startup LeydenJar closes new investment round of €13 million to launch first 100% silicon anode production facility appeared first on EU-Startups .",
    "published": "Wed, 10 Sep 2025 10:35:50 +0000",
    "source": "EU-Startups"
  },
  {
    "title": "EU-Startups Podcast | Episode 135: Philipp Roesch-Schlanderer, Founder & CEO of EGYM",
    "link": "https://www.eu-startups.com/2025/09/eu-startups-podcast-episode-135-philipp-roesch-schlanderer-founder-ceo-of-egym/",
    "summary": "In this episode of the EU-Startups Podcast, we sit down with Philipp Roesch-Schlanderer, Founder and CEO of EGYM, the Munich-based fitness tech unicorn that has secured over €520 million since it was founded in 2011. Philipp shares insights into building a company on a mission to make fitness accessible to everyone. By rethinking the traditional […] The post EU-Startups Podcast | Episode 135: Philipp Roesch-Schlanderer, Founder & CEO of EGYM appeared first on EU-Startups .",
    "published": "Wed, 10 Sep 2025 09:09:13 +0000",
    "source": "EU-Startups"
  },
  {
    "title": "French startup Scintil Photonics raises €50 million to scale integrated photonics for AI factories",
    "link": "https://www.eu-startups.com/2025/09/french-startup-scintil-photonics-raises-e50-million-to-scale-integrated-photonics-for-ai-factories/",
    "summary": "Grenoble-based Scintil Photonics, an innovator in Heterogeneous Integrated Photonics for AI infrastructure, today announced the completion of a €50 million Series B funding round to expand hiring, accelerate production, and deepen its international presence. The round was led by Yotta Capital Partners and NGP Capital, with participation from NVIDIA. The round includes new participation from […] The post French startup Scintil Photonics raises €50 million to scale integrated photonics for AI factories appeared first on EU-Startups .",
    "published": "Tue, 09 Sep 2025 13:53:21 +0000",
    "source": "EU-Startups"
  },
  {
    "title": "British startup Fyxer AI bags €25.5 million to free professionals from repetitive admin work",
    "link": "https://www.eu-startups.com/2025/09/british-startup-fyxer-ai-bags-e25-5-million-to-free-professionals-from-repetitive-admin-work/",
    "summary": "London’s Fyxer AI, the creator of the AI-powered executive assistant designed for everyday professionals, today announced a €25.5 million Series B funding round to deliver AI tools that professionals can easily adopt, freeing them from routine admin to focus on high value work. The round was led by Madrona, with participation from Lakestar Capital. Previous […] The post British startup Fyxer AI bags €25.5 million to free professionals from repetitive admin work appeared first on EU-Startups .",
    "published": "Tue, 09 Sep 2025 11:30:16 +0000",
    "source": "EU-Startups"
  },
  {
    "title": "Dutch-based Carepool secures funding from InnovationQuarter and Municipality of The Hague",
    "link": "https://siliconcanals.com/carepool-secures-funding/",
    "summary": "The Hague-based Carepool is developing an app designed to assist individuals with personal budgets in searching for, planning, and managing their care. The Dutch company raised €300K from InnovationQuarter and the Municipality of The Hague to further develop the platform to launch it on the market next year. “With Carepool, we want to show that ... Read more",
    "published": "Wed, 10 Sep 2025 11:24:52 +0000",
    "source": "Startups – Silicon Canals"
  },
  {
    "title": "Dutch-based OAASIS launches with €2.9M funding to give small businesses big supply chain power",
    "link": "https://siliconcanals.com/dutch-based-oaasis-launches-with-e2-9m-funding/",
    "summary": "OAASIS raises funding and launches in the Dutch market, offering AI-based supply chain solutions for SMEs and mid-market companies. Amstelveen-based OAASIS, a company that provides AI-driven software for SMEs and mid-market companies to manage and optimise supply chains, has raised €2.9M in funding. OAASIS, launched on 9 September 2025, has officially entered the Dutch market ... Read more",
    "published": "Tue, 09 Sep 2025 09:30:20 +0000",
    "source": "Startups – Silicon Canals"
  },
  {
    "title": "London-based Fyxer secures €25.5.5M to expand AI executive assistant tool into the US market",
    "link": "https://siliconcanals.com/london-fyxer-secures-25-5m/",
    "summary": "London-based Fyxer AI, a startup developing an AI-powered executive assistant tool, has secured $30M (approximately €25.5M) in a Series B funding round. The funding round was led by Madrona with participation from Lakestar Capital. Previous investors include 20VC, 20Growth, and Salesforce founder Marc Benioff. The UK company will use the funds to accelerate the expansion ... Read more",
    "published": "Tue, 09 Sep 2025 08:05:17 +0000",
    "source": "Startups – Silicon Canals"
  },
  {
    "title": "Amsterdam-based fintech Factris secures €100M funding facility: Know more",
    "link": "https://siliconcanals.com/factris-secures-e100m-funding-facility/",
    "summary": "Amsterdam’s fintech company Factris has partnered with Brand New Day Bank to provide invoice financing to SMEs across Europe. Amsterdam-based Factris, a European fintech that provides financing solutions for small and medium-sized enterprises (SMEs) using invoices as collateral, has launched a funding partnership with Brand New Day Bank.  The partnership has established a €100M facility ... Read more",
    "published": "Tue, 09 Sep 2025 07:22:51 +0000",
    "source": "Startups – Silicon Canals"
  },
  {
    "title": "Aarhus-based Understory raises €12M to expand AI platform for experience economy",
    "link": "https://siliconcanals.com/aarhus-understory-raises-12m/",
    "summary": "Aarhus, Denmark-based Understory, a software company that offers business bookings, payments, a dashboard, and marketing services, has raised €12M in a Series A funding round. The round was led by London-based Smedvig Ventures, a high conviction investor backing the best of B2B tech across Europe. “Understory stands out with a stellar team, a clear vision, ... Read more",
    "published": "Mon, 08 Sep 2025 11:14:37 +0000",
    "source": "Startups – Silicon Canals"
  },
  {
    "title": "In other news this week: CHARM Therapeutics raises €68.2M, MRM Health secures €55M, HappyRobot bags €37.7M funding and more",
    "link": "https://siliconcanals.com/in-other-news-this-week-55/",
    "summary": "Lately, there’s been a lot happening in the technology world. Startups and established companies are busy announcing new funding, forming partnerships, and making acquisitions. It’s been so fast-paced that it’s hard to keep up with every update, and some important news may have gone unnoticed. We can’t cover every story, but it’s important not to ... Read more",
    "published": "Sat, 06 Sep 2025 08:30:00 +0000",
    "source": "Startups – Silicon Canals"
  },
  {
    "title": "Sources: AI training startup Mercor eyes $10B+ valuation on $450 million run rate",
    "link": "https://techcrunch.com/2025/09/09/sources-ai-training-startup-mercor-eyes-10b-valuation-on-450-million-run-rate/",
    "summary": "The two-year-old startup has been in discussions with investors for a Series C round.",
    "published": "Wed, 10 Sep 2025 01:36:51 +0000",
    "source": "TechCrunch"
  },
  {
    "title": "From mixers to pitch-offs — your brand event belongs at TechCrunch Disrupt 2025",
    "link": "https://techcrunch.com/2025/09/09/from-mixers-to-pitch-offs-your-brand-event-belongs-at-techcrunch-disrupt-2025/",
    "summary": "Each Side Event can unlock new opportunities for the hosts: investor deal flow, talent connections, and brand exposure with the startup community.",
    "published": "Tue, 09 Sep 2025 22:40:47 +0000",
    "source": "TechCrunch"
  },
  {
    "title": "FCM-kvinder får prygl i ligadebut - DR",
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9hWmdJaEtxenJ6UC1LQUFFZWJOamVCUEJmTjAyWVI2aS1TUEh6WW85WHlCOHdyVlFiR2VGNllvMTVqWWxnelR5MEtTaHpqU2ZBRWNzMGFIV056WGlWTkFVWTBGWDMxYzYzenNYczNReTBuZDd6b0wteVd2c3hIVm8?oc=5",
    "summary": "FCM-kvinder får prygl i ligadebut DR",
    "published": "Sun, 10 Aug 2025 07:00:00 GMT",
    "source": "\"kvinder startup Danmark when:90d\" - Google Nyheter"
  },
  {
    "title": "15 Women Entrepreneurs from Europe and Central Asia Take Center Stage at Europe’s Premier Angel Investment Event - UN Women Europe and Central Asia",
    "link": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQWW1YenVuWWczejdPdHhQdFRBR0Y1MEt3bE9WYXZvb0ZCdGNibUE4bFU5X09GRVZKNFJVVkRZZDEzZEtZaEdhQnN6Z1lFbExqdGlLQnpiV1Y4ZkMyZEJTcE1sWHBTWnVjYzVPdExiUUpVazEyTXBFdENmOWR6cTlEblR2dEdRZjNJX0g0eHZxT3NWdjZ1LW5Ec1BuTUNyTDhQUkI0QXRDWEt0QURObEN3aTR6alVsY1NuaVFMRlhSX2RYZ3FiUEplNVVUR1RkNkFhT1Jfcnh3aUFwU2c4UGpTTlRWaUZtZzBodDItcVoycFg?oc=5",
    "summary": "15 Women Entrepreneurs from Europe and Central Asia Take Center Stage at Europe’s Premier Angel Investment Event UN Women Europe and Central Asia",
    "published": "Fri, 13 Jun 2025 07:00:00 GMT",
    "source": "\"female founders Denmark when:90d\" - Google News"
  },
  {
    "title": "Danish TravelTech platform Understory raises €12 million to unite tools for experience providers under one roof - EU-Startups",
    "link": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQWGU2UVVBRWZiUE1CYmtFQWc5aGk4LWRram9uWUxoaVFZcko2MENRd1JZeFFsdnlCM0VBOTNxNVFvdFFBS28tR1pKUUdyWmdnbHFEU2plTnpocTF6REdmUFNFSzY5Q2Z5RUtvZk9BOFJ4MENJRWR1NXQ2TDZjY21wYlQ3VURHTDlZSE1BSnhrQWNxRE1nN3BuZ3ExNzJpWEQtSHZtZ1Zrd2kyV19iZnBBTWpveURzcVdETFM4SVNDMFc3a0h5TmZ6YzVBX2JDekdPUThfQmw3TjExUVVUZlBWTWN3?oc=5",
    "summary": "Danish TravelTech platform Understory raises €12 million to unite tools for experience providers under one roof EU-Startups",
    "published": "Mon, 08 Sep 2025 11:00:01 GMT",
    "source": "\"female founders Denmark when:90d\" - Google News"
  },
  {
    "title": "Danish TravelTech Understory Secures €12M Series A Funding - StartupHub.ai",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQaFJ2QlNiblFPRkE3a0NMMW1yTGpHUThQLUYzdjRmMl92Q0NjcGpNTldNU0lsVGZEVUxXYk1nYmJkVHg1aGtMd0xXRmtkU0FOWHZUa1VUSVNSQUZfRERhWTk1cGtyR1VKRnNBTWJTOUswSVZLWEVpd2RiQVlMdnZlSmEzMG1pMmdnYmtMcnVxTmw3aGdkTnFKQjZCemtVclJhcEtTMFU5QmNCUWdPeG9YOUdR?oc=5",
    "summary": "Danish TravelTech Understory Secures €12M Series A Funding StartupHub.ai",
    "published": "Mon, 08 Sep 2025 13:06:24 GMT",
    "source": "\"female founders Denmark when:90d\" - Google News"
  },
  {
    "title": "Female-founded startups secured over €100M last week across Europe and the UK - Tech Funding News",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1XbE1TVm04a0h6UmVfZkxaOVVNTTZuTlFDSnNDRlpWRkVMdkNxVjktZEhtRkJiRHlrcXFCdER3b2wzVGQyRDNacm1WOWh2T09xeVpaV3ZKTTNNR1YtZDMtaXNVdmh6U0FFTlZ2d014eFBncFFtcjQxRGxHZkg?oc=5",
    "summary": "Female-founded startups secured over €100M last week across Europe and the UK Tech Funding News",
    "published": "Mon, 01 Sep 2025 08:46:07 GMT",
    "source": "\"female founders Denmark when:90d\" - Google News"
  },
  {
    "title": "Power to the Pee-ple: Denmark's Lapee banks €800k to bring pink urinals for women to the masses - EU-Startups",
    "link": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNcHJZMFNaamFHdUdtS0UyMHJINFR4TkJITW1ueUtDWklmWXRJNFh6WHhmYVdPRXNPb0lrTVJYOGpJVW41dEE5YVg0dEtRNHU5U2RiNTZXV0xUenFJVWFkU3ZqdFpGSXJhSXNYa1RYZUpIRDlmQUJtR0pLbGhHaWF1NGVuT2U1SHpwck1WcEZUNnlGS3FHR2xKRExOVmdFMFNqUHZwN2VRSVJMZl9OZUl4TFBoeWhGejgzNUdyUXRLTWw5SG1HNlpjcTJB?oc=5",
    "summary": "Power to the Pee-ple: Denmark's Lapee banks €800k to bring pink urinals for women to the masses EU-Startups",
    "published": "Tue, 02 Sep 2025 13:51:43 GMT",
    "source": "\"female founders Denmark when:90d\" - Google News"
  },
  {
    "title": "Copenhagen-based Interhuman AI raises €2 million to build the social intelligence layer for AI - EU-Startups",
    "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNazNYVHp0ZTlWZ1VSbnZoVjBvMzVuWGI2WjlROE9reXZ1WFRBVXhWNDl4VkwtdE5vN1dZZkJUTFlfalA4TnFDUDk3RGNIQzlxSEhVZjVPRE1zV3JmRDYtMG9NMEs3YkVXaFR0VmlLODdhdm9CZm9FSnVFUmdLdXBRQ0NXLWRXcFhweUhOM3ZMc0thU01QN0cxTGdVMXA2dzJIS2tyUk1oX1V0UFl3N1dKMFRIakJ2d1pQeXI3SGVOUEVLTHlsdmo0YkV3VQ?oc=5",
    "summary": "Copenhagen-based Interhuman AI raises €2 million to build the social intelligence layer for AI EU-Startups",
    "published": "Mon, 25 Aug 2025 07:00:00 GMT",
    "source": "\"female founders Denmark when:90d\" - Google News"
  }
]