[
  {
    "title": "Hele bestyrelsen bliver udskiftet i grønlandsk lufthavn",
    "link": "https://www.dr.dk/nyheder/seneste/hele-bestyrelsen-bliver-udskiftet-i-groenlandsk-lufthavn",
    "summary": "",
    "published": "Wed, 10 Sep 2025 11:51:00 GMT",
    "source": "Kort nyt | DR"
  },
  {
    "title": "LIVE Vuelta-direktør har aldrig oplevet noget lignende",
    "link": "https://www.dr.dk/sporten/cykling/vuelta/live-vuelta-direktoer-har-aldrig-oplevet-noget-lignende",
    "summary": "Dagens Vuelta a España byder på en stor stigning op til målstregen. Følg etapen her.",
    "published": "Wed, 10 Sep 2025 10:30:00 GMT",
    "source": "Kort nyt | DR"
  },
  {
    "title": "Kvindelandsholdet skal igen spille i Parken",
    "link": "https://www.dr.dk/sporten/seneste-sport/kvindelandsholdet-skal-igen-spille-i-parken",
    "summary": "",
    "published": "Wed, 10 Sep 2025 05:18:00 GMT",
    "source": "Kort nyt | DR"
  },
  {
    "title": "Morgen-briefing: Twoday opnår Microsofts prestigefyldte AI-stempel / Ny spyware tager billeder af folk, der ser porno / Mød Jupiter, Europas nye computerhåb / Ny vicedirektør for it og digitalisering på Roskilde Universitet",
    "link": "https://www.computerworld.dk/art/292800/morgen-briefing-twoday-opnaar-microsofts-prestigefyldte-ai-stempel-ny-spyware-tager-billeder-af-folk-der-ser-porno-moed-jupiter-europas-nye-computerhaab-ny-vicedirektoer-for-it-og-digitalisering-paa-roskilde-universitet?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS",
    "summary": "Twoday opnår Microsofts prestigefyldte AI-stempel. Ny spyware tager billeder af folk, der ser porno. Mød Jupiter, Europas nye computerhåb. Ny vicedirektør for it og digitalisering på Roskilde Universitet.",
    "published": "Wed, 10 Sep 2025 06:00:00 +0200",
    "source": "Computerworld"
  },
  {
    "title": "Verdensberømte tech-firmaer fyrer topledere og rokerer i direktionen",
    "link": "https://www.computerworld.dk/art/292790/verdensberoemte-tech-firmaer-fyrer-topledere-og-rokerer-i-direktionen?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS",
    "summary": "Verdens tredjestørste producent af pc'er skal have ny finansdirektør. Samtidig bytter en kriseramt chipgigant rundt på pladser i direktionen, hvilket betyder et farvel til produktionschefen.",
    "published": "Tue, 09 Sep 2025 15:08:00 +0200",
    "source": "Computerworld"
  },
  {
    "title": "Direktør for statens centrale it-styrelse fratræder: 1.800 ansatte skal have ny direktør",
    "link": "https://www.computerworld.dk/art/292792/direktoer-for-statens-centrale-it-styrelse-fratraeder-1-800-ansatte-skal-have-ny-direktoer?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS",
    "summary": "Efter næsten seks år hos Udviklings- og Forenklingsstyrelsen – hvoraf de fem har været som direktør – fratræder Niels Gotfredsen.",
    "published": "Tue, 09 Sep 2025 13:16:00 +0200",
    "source": "Computerworld"
  },
  {
    "title": "Forbruget på cloud blæser i vejret - men væksten hos én af de tre kæmper er hæmmet",
    "link": "https://www.computerworld.dk/art/292787/forbruget-paa-cloud-blaeser-i-vejret-men-vaeksten-hos-n-af-de-tre-kaemper-er-haemmet?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS",
    "summary": "Der er atter kommet liv i migreringer af ældre teknologi, mens AI ligeledes bidrager til en stabilt høj vækst på markedet for cloud-infrastrukturtjenester.",
    "published": "Tue, 09 Sep 2025 07:42:00 +0200",
    "source": "Computerworld"
  },
  {
    "title": "Morgen-briefing: 90 millioner til dansk AI-startup / Nordiske cloudselskaber i samarbejde / SimCorp lancerer ny service / Staten skyder grunde ind i kvantesats",
    "link": "https://www.computerworld.dk/art/292786/morgen-briefing-90-millioner-til-dansk-ai-startup-nordiske-cloudselskaber-i-samarbejde-simcorp-lancerer-ny-service-staten-skyder-grunde-ind-i-kvantesats?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS",
    "summary": "90 millioner kroner til dansk AI-startup. Nordiske cloudselskaber i samarbejde. SimCorp lancerer ny service. Staten skyder grunde ind i kvantesats.",
    "published": "Tue, 09 Sep 2025 06:00:00 +0200",
    "source": "Computerworld"
  },
  {
    "title": "Pensionskapitalen: ”Vi er ivrige efter at investere i tech scaleups”",
    "link": "https://bootstrapping.dk/pensionskapitalen-vi-er-ivrige-efter-at-investere-i-tech-scaleups/",
    "summary": "Pension er skattebegunstiget folkeopsparing med 30-40 års sigte. Så når pensionskasserne er vores allesammens som lønmodtagere eller borgere, er det virkelig svært at forklare børn og unge, at ens eget selskab ikke vil investere i de arbejdspladser og den innovation, de engang om 10-20-30 år skal leve af . De kan jo næppe alle sammen leve af arv. Men til nu har selskaberne i den grad slået sig i tøjret. Ivrige efter at sende scaleups ud af landet? I EU er det 0,1 % af al institutionel kapital, der går til ventures . I Danmark er selskaberne  blevet bedre de senere ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Pensionskapitalen: ”Vi er ivrige efter at investere i tech scaleups” appeared first on Bootstrapping .",
    "published": "Wed, 10 Sep 2025 07:21:54 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Kaffe & Kapital – Håndtering og implementering af warrants og optioner m. Patrick Andersen",
    "link": "https://bootstrapping.dk/kaffe-kapital-warrants-og-optioner-m-patrick-andersen/",
    "summary": "I en tid med hård konkurrence om de bedste talenter er warrants og optioner afgørende værktøjer for både større virksomheder og startups med henblik på at tiltrække og fastholde nøglemedarbejdere - og dermed skabe et stærkt, attraktivt arbejdsfællesskab. Jesper Højberg Christensen taler med advokat Patrick Andersen fra DLA Piper, der deler sin ekspertise om mulighederne i Danmark, samt hvordan man bedst håndterer og implementerer warrants og optioner. The post Kaffe & Kapital – Håndtering og implementering af warrants og optioner m. Patrick Andersen appeared first on Bootstrapping .",
    "published": "Wed, 10 Sep 2025 07:08:37 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Founder advarer: AI skaber software-overload, der kan løbe løbsk i virksomheder",
    "link": "https://bootstrapping.dk/founder-advarer-ai-skaber-software-overload-der-kan-loebe-loebsk-i-virksomheder/",
    "summary": "AI omformer måden, virksomheder opererer på. Det øger hastigheden af softwareadoption og gør det lettere for medarbejdere at skabe deres egne værktøjer. Dermed driver det også antallet af applikationer, som organisationer skal håndtere, voldsomt i vejret. Og den udvikling skaber en række nye sårbarheder, hævder Michael Fornander , CEO & co-founder i Viio (tidligere Oveo). Man skal selvfølgelig have for øje, at Fornander lever af at levere løsninger, der kan sikre virksomheder kontrol af applikationer. Når det er sagt, kan der godt være noget om, at hypen og henrykkelsen ved de brugsmuligheder AI skaber, kan få os til “ at negligere nogle ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Founder advarer: AI skaber software-overload, der kan løbe løbsk i virksomheder appeared first on Bootstrapping .",
    "published": "Tue, 09 Sep 2025 12:14:18 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Rumveteran Niels Buus: Europa taber big time kritisk rumkapløb til Musk",
    "link": "https://bootstrapping.dk/rumveteran-niels-buus-europa-taber-big-time-kritisk-rumkaploeb-til-musk/",
    "summary": "Danmark har universiteterne og innovationen, men mangler ligesom hele Europa desperat både systemet og kapitalen til at opbygge industri-vindere. Niels Buus , som du nok også kender fra historierne om lagerbeskatning , har været med fra dengang, hvor man byggede teknologierne. Som ung i 1980’erne uddannede han sig til civilingeniør på Aalborg Universitet og delte den grænseoverskridende drøm om rummet. Men nu har billedet på få år ændret sig, fortæller rumfartsveteranen til Bootstrapping: - \"Jeg plejer at sige, at det længe har været, som da man i USA satsede alt ved at tage familien ud over prærien med sine okser og sin ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Rumveteran Niels Buus: Europa taber big time kritisk rumkapløb til Musk appeared first on Bootstrapping .",
    "published": "Tue, 09 Sep 2025 07:07:42 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Kort & Godt i Startupland: Medarbejderaktier & straksfradrag er løst – VC’s opererer som kapitalfonde? – Jesper Buch er “revnende ligeglad",
    "link": "https://bootstrapping.dk/kort-godt-warrants-jesper-buch-er-revnende-ligeglad/",
    "summary": "Vi kom, så og festede – og segnede bagefter af træthed på TechBBQ. Det og meget andet samler vi op på. Og starter med de to politiske gennembrud for økosystemet, der måske druknede lidt i tumlen på Bella Center. Du kan læse om:   Medarbejderaktier på plads. Straksfradrag genrejst Tech BBQ with Love(able)  Tibi kom […] The post Kort & Godt i Startupland: Medarbejderaktier & straksfradrag er løst – VC’s opererer som kapitalfonde? – Jesper Buch er “revnende ligeglad appeared first on Bootstrapping .",
    "published": "Fri, 05 Sep 2025 08:48:27 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Straksfradraget. Hvilke muligheder får danske startups nu?",
    "link": "https://bootstrapping.dk/straksfradraget-hvilke-muligheder-faar-danske-startups-nu/",
    "summary": "Et af sidste uges gode gaver i Finansloven var ændringen i straksfradraget, så softwareudviklende startups nu kan afskrive deres udvikling med det samme. Det er DI´s chef for SMV og iværksætteri, Sine Linderstrøm, der fik pitchet forslaget ind til Moderaterne. Vi har spurgt hende, hvad betydning det vil få for software-startups. The post Straksfradraget. Hvilke muligheder får danske startups nu? appeared first on Bootstrapping .",
    "published": "Thu, 04 Sep 2025 08:05:25 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Ventureinvesteringer er 44 % nede i 2025 – går det virkelig så skidt …?",
    "link": "https://bootstrapping.dk/ventureinvesteringer-er-44-nede-i-2025-gaar-det-virkelig-saa-skidt/",
    "summary": "I forhold til resten af EU klarede det danske venturemarked sig ret fint i 2023-2024, trods hele markedsvendingen med rentestigninger og uro. Den tid er så åbenbart forbi! Til nu i 2025 har vores investorer holdt pengepungen i baglommen. Første halvår af 2025 har budt på et fald på 44 % i investeret venturekapital i forhold til foregående første halvår af 2024. Lidt mindre nedgang i antal af investeringer, nemlig 19 %. Det fortæller, at færre, og især langt mindre investeringer, stadig er med . Cirka 85 % af alle investeringerne i 1. halvår var under 10 mio. EUR. Så tidlige ... Lige nu: Prøv 14 dage gratis. Start ud med 14 dage gratis og få adgang til de vigtigste historier i startup-økosystemet under overfladen. Herefter 120 kr./md ex. moms. Abonnementet fornyes automatisk, indtil det opsiges. Start gratis prøveperiode Allerede medlem? Log ind her. The post Ventureinvesteringer er 44 % nede i 2025 – går det virkelig så skidt …? appeared first on Bootstrapping .",
    "published": "Wed, 03 Sep 2025 08:11:30 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Europas B2B-startups skaber den dobbelte omsætning af USA’s – men hæmmes af kortsigtede pensionskasser",
    "link": "https://bootstrapping.dk/europas-b2b-startups-skaber-den-dobbelte-omsaetning-af-usas/",
    "summary": "Europæiske fonde og pensionskasser har linserne forkert indstillet: de fokuserer på at minimere kortsigtede udsving frem for at maksimere langsigtede afkast. Det er den afgørende forskel til USA, hvor kapitalen flyder gennem hele værdikæden. Derfor hjælper det ikke, at europæiske B2B-startups faktisk skaber mere end dobbelt så meget omsætning pr. investeret krone end de amerikanske. Regningen vokser dag for dag – og kræver handling nu, skriver Mads Jensen, partner i SuperSeed. The post Europas B2B-startups skaber den dobbelte omsætning af USA’s – men hæmmes af kortsigtede pensionskasser appeared first on Bootstrapping .",
    "published": "Wed, 03 Sep 2025 07:30:35 +0000",
    "source": "Bootstrapping"
  },
  {
    "title": "Up North skal være starten på noget større i det nordjyske økosystem: “Vi skal tro mere på os selv”",
    "link": "https://techsavvy.media/up-north-skal-vaere-starten-paa-noget-stoerre-i-det-nordjyske-oekosystem-vi-skal-tro-mere-paa-os-selv/",
    "summary": "Nordjylland har talent og idéer, men for få investeringer. Up North samlede økosystemet for at ændre på den fortælling. Indlægget Up North skal være starten på noget større i det nordjyske økosystem: “Vi skal tro mere på os selv” blev først udgivet på TechSavvy .",
    "published": "Wed, 10 Sep 2025 09:43:44 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Fra idé i felten til eksporteventyr: Lån fra EIFO gav MyDefence et afgørende skub",
    "link": "https://techsavvy.media/fra-ide-i-felten-til-eksporteventyr-laan-fra-eifo-gav-mydefence-et-afgoerende-skub/",
    "summary": "MyDefence er i dag en global spiller inden for antidrone-teknologi, men begyndte som en idé blandt tre forsvarsveteraner. Et lån fra EIFO gjorde det muligt... Indlægget Fra idé i felten til eksporteventyr: Lån fra EIFO gav MyDefence et afgørende skub blev først udgivet på TechSavvy .",
    "published": "Wed, 10 Sep 2025 09:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Ulla undgår founders, der hellere vil “holde talks” end at bygge forretning",
    "link": "https://techsavvy.media/ulla-undgaar-founders-der-er-mere-optaget-af-at-staa-paa-scenen/",
    "summary": "For tidligere advokat, bankdirektør og i dag engleinvestor Ulla Heurlin vægter salg, skalering og ærlighed langt tungere end startup-hype. Indlægget <i class=\"fa fa-lock\" aria-hidden=\"true\"></i> Ulla undgår founders, der hellere vil “holde talks” end at bygge forretning blev først udgivet på TechSavvy .",
    "published": "Wed, 10 Sep 2025 05:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Dansk AI-scaleup rejser millioner af dollars til at indtage USA",
    "link": "https://techsavvy.media/dansk-ai-scaleup-rejser-millioner-af-dollars-til-at-indtage-usa/",
    "summary": "Danske Teton er klar til at udbrede deres AI-platform til optimering af ældrepleje efter en massiv investeringsrunde. Indlægget <i class=\"fa fa-lock\" aria-hidden=\"true\"></i> Dansk AI-scaleup rejser millioner af dollars til at indtage USA blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 12:40:33 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Bliv en skarpere investor med Keystones: Sådan guider netværket dig fra første investering til vellykket exit",
    "link": "https://techsavvy.media/bliv-en-skarpere-investor-med-keystones-saadan-guider-netvaerket-dig-fra-foerste-investering-til-vellykket-exit/",
    "summary": "Som business angel har Camilla Frost fundet både værdi og værktøjer i Keystones’ netværk. På bare ét år har hun fået adgang til praktisk viden,... Indlægget Bliv en skarpere investor med Keystones: Sådan guider netværket dig fra første investering til vellykket exit blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 09:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Cykel-startup genopstår efter konkurs med nye erfarne folk på holdet",
    "link": "https://techsavvy.media/cykel-startup-genopstaar-efter-konkurs-med-nye-erfarne-folk-paa-holdet/",
    "summary": "Det danske cykelstartup CYKOM relanceres af tre erfarne founders med ambitionen om at samle verdens cyklister på én platform. Indlægget Cykel-startup genopstår efter konkurs med nye erfarne folk på holdet blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 06:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Serieiværksætter rejser kapital til dansk Lovable-udfordrer",
    "link": "https://techsavvy.media/serieivaerksaetter-rejser-kapital-til-dansk-lovable-udfordrer/",
    "summary": "Danske Lightpost One har rejst en pre-seed-runde fra venturefonden PSV Techs nye Fond II. Stifter Casper Wilstrup ser det som startskuddet på en europæisk ‘vibe... Indlægget <i class=\"fa fa-lock\" aria-hidden=\"true\"></i> Serieiværksætter rejser kapital til dansk Lovable-udfordrer blev først udgivet på TechSavvy .",
    "published": "Tue, 09 Sep 2025 05:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Kaffe-startup går i europæisk offensiv efter investering på 30 millioner til at digitalisere erhvervskaffe",
    "link": "https://techsavvy.media/kaffe-startup-gaar-i-europaeisk-offensiv-efter-investering-paa-30-millioner-til-at-digitalisere-erhvervskaffe/",
    "summary": "Blackbird Coffee vil udfordre de traditionelle leverandører med teknologi, proaktiv service og en europæisk ekspansion. Indlægget Kaffe-startup går i europæisk offensiv efter investering på 30 millioner til at digitalisere erhvervskaffe blev først udgivet på TechSavvy .",
    "published": "Mon, 08 Sep 2025 13:00:40 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Efter milliard-exit: Vi er ikke færdige med at udvikle og rådgive om fremtidens nanoteknologi",
    "link": "https://techsavvy.media/efter-milliard-exit-vi-er-ikke-faerdige-med-at-udvikle-og-raadgive-om-fremtidens-nanoteknologi/",
    "summary": "Efter salget af NIL Technology til en international industrikoncern vil stifterne ikke bare trække sig tilbage – tværtimod. De to iværksættere Theodor Nielsen og Brian... Indlægget Efter milliard-exit: Vi er ikke færdige med at udvikle og rådgive om fremtidens nanoteknologi blev først udgivet på TechSavvy .",
    "published": "Mon, 08 Sep 2025 09:00:00 +0000",
    "source": "TechSavvy"
  },
  {
    "title": "Arctic15 DealTank. Something new, something old",
    "link": "https://nordicstartupnews.com/arctic15-dealtank-something-new-something-old/",
    "summary": "…and a lot of Blue at Arctic15, 2025 So, Deal Tank at Arctic15 – Where Startups and Deals Collide. The Arctic15 startup conference, a Helsinki annual startups meet investors “chocolate shop” since 2011, has always been about connecting the right people to make things happen.    1st ever DealTank. Image (c) Arctic15 social media (screenshot) … The post Arctic15 DealTank. Something new, something old appeared first on Nordic Startup News .",
    "published": "Tue, 10 Jun 2025 09:32:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Narvi Payments Oy Enters the Expansion Phase",
    "link": "https://nordicstartupnews.com/narvi-payments-oy-enters-the-expansion-phase/",
    "summary": "Narvi Payments Oy, a Finnish startup founded in 2021, is setting its sights on international expansion. The company provides business bank accounts with dedicated Euro IBANs for e-resident companies of all sizes. Opening an account online takes less than 10 minutes, allowing businesses to start sending and receiving Euro payments from over 100 countries within … The post Narvi Payments Oy Enters the Expansion Phase appeared first on Nordic Startup News .",
    "published": "Mon, 02 Jun 2025 12:17:21 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Mastercard Lighthouse 2025 Showcase and Spring Finale Was at Latitude59 in Tallinn",
    "link": "https://nordicstartupnews.com/mastercard-lighthouse-2025-showcase-and-spring-finale-was-at-latitude59-in-tallinn/",
    "summary": "The three finalists of each program were chosen for their progress in the program, innovation, partnership readiness, and impact potential.Axiology was selected as the regional Baltic Class Winner, as well as the Overall Winner of the Mastercard Lighthouse FINITIV Program 2025 Spring edition. Axiology develops DLT market infrastructure for regulated tokenized securities under EU DLT … The post Mastercard Lighthouse 2025 Showcase and Spring Finale Was at Latitude59 in Tallinn appeared first on Nordic Startup News .",
    "published": "Fri, 30 May 2025 14:14:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Former President of Estonia Toomas Hendrik Ilves and German MEP Damian Boeselager Envisioned the Future of Europe at Latitude59",
    "link": "https://nordicstartupnews.com/former-estonian-president-toomas-hendrik-ilves-and-mep-damian-boeselager-envisioned-the-future-of-europe/",
    "summary": "Leading a country or a company in Europe presents similar challenges: protecting citizens and clients, securing markets and borders, attracting investment, managing partnerships and foreign policy, and attracting and retaining talent. The book called “Strategies and Visions for Europe” explores these issues through the lens of startups and various sectors including Defense/CyberSec, Healthcare/MedTech, Public/GovTech, Environment … The post Former President of Estonia Toomas Hendrik Ilves and German MEP Damian Boeselager Envisioned the Future of Europe at Latitude59 appeared first on Nordic Startup News .",
    "published": "Sun, 25 May 2025 18:11:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Latitude59 Pitch Competition Winners Have Secured Total over €20 Million in Investments",
    "link": "https://nordicstartupnews.com/latitude59-pitch-competition-winners-have-secured-total-over-e20-million-in-investments/",
    "summary": "At the international startup conference Latitude59 held in Tallinn, the 2025 victory was shared by three companies. Investments ranging from €175,000 to €250,000 will be made in Estonian green energy solutions developer MarkeDroid, Latvian construction startup Adventum Tech, and Lithuanian defense technology company Luna Robotics. The syndicated investments are provided by business angels from Estonia, … The post Latitude59 Pitch Competition Winners Have Secured Total over €20 Million in Investments appeared first on Nordic Startup News .",
    "published": "Sat, 24 May 2025 12:53:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Latitude59 of Tallinn Was a Great Success also Measured by Numbers",
    "link": "https://nordicstartupnews.com/latitude59-of-tallinn-was-a-great-success-also-measured-by-numbers/",
    "summary": "Latitude59, which took place for the 13th time in Tallinn, Estonia, was visited by more than 3,500 people, including more than 900 startup representatives and 20 national delegations. Nearly 700 investors participated this year. 170 speakers could be seen on Latitude59’s stages. In total, there were participants from more than 70 different countries worldwide. This … The post Latitude59 of Tallinn Was a Great Success also Measured by Numbers appeared first on Nordic Startup News .",
    "published": "Sat, 24 May 2025 12:24:20 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Busy start-up season both sides of the Baltic Sea",
    "link": "https://nordicstartupnews.com/busy-start-up-season-both-sides-of-the-baltic-sea/",
    "summary": "The up-tempo business season is leaning towards tranquil summer vacations. Still, there are two signature events left, like cherries on the cake-top: Latitude59 in Tallinn (May 21-23) and Arctic15 in Helsinki (June 4-5).Latitude59 is an international, impactful, and diverse startup and technology conference and a global platform that connects startups, investors, and ecosystem builders all … The post Busy start-up season both sides of the Baltic Sea appeared first on Nordic Startup News .",
    "published": "Mon, 19 May 2025 14:53:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nanofiber Innovation Takes Top Prize at Oulu’s Polar Bear Pitching",
    "link": "https://nordicstartupnews.com/nanofiber-innovation-takes-top-prize-at-oulus-polar-bear-pitching/",
    "summary": "Polar Bear (Jason Brower) and MC Simo Kekäläinen put up an interval show. Startup companies competed this year in the Polar Bear Pitching event held in Oulu, Finland, in an exceptional location and under extraordinary circumstances. By the Oulujoki river, the weather was mild with temperatures above freezing and drizzling rain.The finals of the event … The post Nanofiber Innovation Takes Top Prize at Oulu’s Polar Bear Pitching appeared first on Nordic Startup News .",
    "published": "Fri, 28 Feb 2025 10:39:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Natural Alternatives Without Compromise",
    "link": "https://nordicstartupnews.com/natural-alternatives-without-compromise/",
    "summary": "Svelli, a Danish foodtech startup with ambitions to revolutionize the sugar-free product market, has secured investment from several Danish investors. Svelli aims to challenge the status quo in a food industry where sugar and ultra-processed foods continue to dominate. Rather than simply offering “healthier alternatives,” the company focuses on creating full-fledged replacements. This requires not … The post Natural Alternatives Without Compromise appeared first on Nordic Startup News .",
    "published": "Fri, 21 Feb 2025 18:20:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Slush Chronicles: Founders Unplugged: Timo Poijärvi",
    "link": "https://nordicstartupnews.com/the-slush-chronicles-founders-unplugged-timo-poijarvi/",
    "summary": "This piece is part of the Slush Chronicles series, “Founders Unplugged,” where we interview founders and key personnel of innovative companies, to hear their thoughts on the event we’re attending or dive into other spontaneously chosen topics. Slush 2024 founder: Timo Poijärvi SaluStim Group Got a message from Timo saying he is onto something amazing, … The post The Slush Chronicles: Founders Unplugged: Timo Poijärvi appeared first on Nordic Startup News .",
    "published": "Sun, 29 Dec 2024 19:32:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Slush Chronicles: Founders Unplugged: Veera Siivonen",
    "link": "https://nordicstartupnews.com/the-slush-chronicles-founders-unplugged-veera-siivonen/",
    "summary": "This piece is part of the Slush Chronicles series, “Founders Unplugged,” where we interview founders and key personnel of innovative companies, to hear their thoughts on the event we’re attending or dive into other spontaneously chosen topics. Slush 2024 founder: Veera Siivonen, Saidot At SXSW 2024 I went to listen to Saidot’s talk on AI … The post The Slush Chronicles: Founders Unplugged: Veera Siivonen appeared first on Nordic Startup News .",
    "published": "Sun, 29 Dec 2024 15:45:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Slush Chronicles: Founders Unplugged: Jukka Tuhkanen",
    "link": "https://nordicstartupnews.com/the-slush-chronicles-founders-unplugged-jukka-tuhkanen/",
    "summary": "This piece is part of the Slush Chronicles series, “Founders Unplugged,” where we interview founders and key personnel of innovative companies, to hear their thoughts on the event we’re attending or dive into other spontaneously chosen topics. Slush 2024 founder: Jukka Tuhkanen, HIIL I ran into Jukka Tuhkanen, Director of Sales and Partnerships from Hiil, … The post The Slush Chronicles: Founders Unplugged: Jukka Tuhkanen appeared first on Nordic Startup News .",
    "published": "Tue, 10 Dec 2024 16:49:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Cracking the Code of Startup Success",
    "link": "https://nordicstartupnews.com/cracking-the-code-of-startup-success/",
    "summary": "Interviewing Ms.Penny Schiffer, CEO of Raized.aiBy Vahur OrrinWith its iconic slushy weather and electrifying atmosphere, Slush remains one of Europe’s most sought-after startup conferences. For Penny Schiffer, CEO of Raized.ai, attending Slush is a yearly pilgrimage. “This is my fourth time here,” Penny says. “Slush isn’t just a conference; it’s a perfectly orchestrated environment where … The post Cracking the Code of Startup Success appeared first on Nordic Startup News .",
    "published": "Thu, 21 Nov 2024 17:52:45 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Winner of Slush100 2024 is… OASYS NOW",
    "link": "https://nordicstartupnews.com/winner-of-slush100-2024-is-oasys-now/",
    "summary": "Here were the Top 3 awesomw pitches. And the winner is OASYS NOW Interview video on Facebook: https://www.facebook.com/reel/1271191080860090 DevAlly . Mohana OASYS NOW Massive Congrats The post Winner of Slush100 2024 is… OASYS NOW appeared first on Nordic Startup News .",
    "published": "Thu, 21 Nov 2024 15:50:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush2024 Day1 wrapup at the legendary Singa Karaoke Chaos",
    "link": "https://nordicstartupnews.com/slush2024-day1-wrapup-at-the-legendary-singa-karaoke-chaos/",
    "summary": "Wow, what an event it’s been. And officially just half way done So, the annual Slush Side Event, the Singa karaoke Chaos, finished the day1 of Slush 2024. In traditional Day1 afterparty. Bur before all the chaos, here’s a quick wrap up: The day 1 of Slush 2024 in Helsinki delivered a vibrant mix of … The post Slush2024 Day1 wrapup at the legendary Singa Karaoke Chaos appeared first on Nordic Startup News .",
    "published": "Wed, 20 Nov 2024 20:15:52 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Fight for the 1 Million is on – here are the Top3 ot Slush100",
    "link": "https://nordicstartupnews.com/fight-for-the-1-million-is-on-here-are-the-top3-ot-slush100/",
    "summary": "Slush100, the annual race for the 1 Million and all the glory, is on again at Slush2024 The Slush 100 competition offers a €1 million equity investment for its winner, backed by Cherry Ventures and General Catalyst. Open to early-stage startups founded in 2021 or later, with less than €2M raised, it emphasizes Europe and … The post Fight for the 1 Million is on – here are the Top3 ot Slush100 appeared first on Nordic Startup News .",
    "published": "Wed, 20 Nov 2024 16:32:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sanja Hauser Wants to Revolutionize Digital Marketing for Startups and SMEs",
    "link": "https://nordicstartupnews.com/sanja-hauser-wants-to-revolutionize-digital-marketing/",
    "summary": "Interview with Ms. Sanja Hauser, founder of Betalane at Slushby Vahur Orrin In the fast-evolving digital marketing world, Zurich-based Betalane.ch has carved out a unique niche by focusing on startups and small to medium-sized enterprises (SMEs). Founded by Sanja Hauser, a marketing professional with years of experience in digital marketing, Betalane is reshaping how businesses … The post Sanja Hauser Wants to Revolutionize Digital Marketing for Startups and SMEs appeared first on Nordic Startup News .",
    "published": "Wed, 20 Nov 2024 15:04:40 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Innovation at Its Peak and New Tool for Slush 100 Startups",
    "link": "https://nordicstartupnews.com/new-tool-for-slush-100-startups/",
    "summary": "Empowering the Slush 100 Startups with Revolutionary Tools New Tool for Slush 100 Startups is the core of this year’s event, a curated selection of the most promising startups from across the globe. Slush 2024 introduced a groundbreaking tool specifically designed to enhance the visibility and opportunities for these innovative companies. This tool is a … The post Innovation at Its Peak and New Tool for Slush 100 Startups appeared first on Nordic Startup News .",
    "published": "Wed, 20 Nov 2024 10:21:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush 2024 Side Events (hand picked by the pros)",
    "link": "https://nordicstartupnews.com/slush-2024-side-events-hand-picked-by-the-pros/",
    "summary": "Slush week is here, and tomorrow there will be snow, eventually turning into Slush… The main venue will be dark and loud, and so will be the Helsinki City. As Peter Vesterbacka put it in the Slush earlydays: “It’s cold and dark outside, and the coolest developers are inside”. Again the Slush week events and … The post Slush 2024 Side Events (hand picked by the pros) appeared first on Nordic Startup News .",
    "published": "Tue, 19 Nov 2024 15:12:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush 2024 – Make Your Startup Stand Out",
    "link": "https://nordicstartupnews.com/make-your-startup-stand-out-at-slush-2024/",
    "summary": "Slush 2024 is the perfect opportunity for startups to shine, and WiseMarketing is here to ensure you make a lasting impression. We’re offering an exclusive deal for Slush attendees: Order a custom landing page and enjoy additional visibility by featuring your company in an article on NordicStartupNews.com, a platform trusted by investors and innovators. Get … The post Slush 2024 – Make Your Startup Stand Out appeared first on Nordic Startup News .",
    "published": "Tue, 19 Nov 2024 07:47:29 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Gaming Company Activate Expanding to Scandinavia",
    "link": "https://nordicstartupnews.com/gaming-company-activate-expanding-to-scandinavia/",
    "summary": "Activate, the leading active gaming company combining physical activity with immersive, tech-driven experiences, is thrilled to announce its expansion into Norway, Sweden, Denmark, and Finland. This significant development is part of Activate’s continued global growth strategy and is made possible through a strategic partnership with Realinvest, a prominent real estate and investment firm in Scandinavia.Since … The post Gaming Company Activate Expanding to Scandinavia appeared first on Nordic Startup News .",
    "published": "Thu, 07 Nov 2024 15:17:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "MUSIC TECH AT SLUSH 2024",
    "link": "https://nordicstartupnews.com/musictech-at-slush-2024/",
    "summary": "This year, Slush 2024 introduces an exciting, official side event: #musictech at Slush 2024. Music has always been an integral part of the Slush experience. Over the years, many big names have taken the stage at the Slush Afterparty, among a whirlwind of artists and performers, one of the most popular side events returning this … The post MUSIC TECH AT SLUSH 2024 appeared first on Nordic Startup News .",
    "published": "Thu, 31 Oct 2024 11:09:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Innovation Unveiled: What to Expect at Slush 2024",
    "link": "https://nordicstartupnews.com/innovation-unveiled-what-to-expect-at-slush-2024/",
    "summary": "The frigid Nordic air is thick with excitement as Helsinki prepares to host one of the most anticipated tech events of the year. Slush 2024 is not just another conference; it’s a veritable kaleidoscope of innovation and disruption, where the boundaries of technology are pushed and new horizons are explored. For many tech enthusiasts, entrepreneurs, … The post Innovation Unveiled: What to Expect at Slush 2024 appeared first on Nordic Startup News .",
    "published": "Sun, 22 Sep 2024 09:20:41 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Discover the Best Upgoing Startup Events 2024 Has to Offer",
    "link": "https://nordicstartupnews.com/discover-the-best-upgoing-startup-events-2024-has-to-offer/",
    "summary": "September 2024 TechBBQ (Copenhagen, Denmark) – September 18-19 Oslo Innovation Week (Oslo, Norway) – September 23-27 October 2024 Slush (Helsinki, Finland) – November 20 – November 21 TechBBQ in Copenhagen, Denmark – September – In September 2024, one of the most anticipated startup events, TechBBQ, will take place in Copenhagen, Denmark. This event is a … The post Discover the Best Upgoing Startup Events 2024 Has to Offer appeared first on Nordic Startup News .",
    "published": "Sat, 21 Sep 2024 16:49:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Discover Opportunities: Estonian Startup Events Calendar 2024-2025",
    "link": "https://nordicstartupnews.com/used-car-dealer-sales-tricks-exposed/",
    "summary": "Imagine a world where the next ground-breaking innovation is just one handshake away, where creative minds from all corners of the globe converge to share ideas, build partnerships, and spark revolutions in technology and business. Welcome to Estonia's vibrant startup ecosystem, a realm that has quickly become a magnet for entrepreneurs, investors, and innovators alike. If you've ever dreamed of being part of this dynamic community, the \"Estonian Startup Events Calendar 2024-2025\" is your golden ticket. This meticulously curated guide is more than just a schedule—it's your roadmap to seizing opportunities that could transform not only your career but also the very fabric of tomorrow's industries. Over the next two years, Estonia will host an array of events designed to nurture startups at every stage of their journey. From pitch competitions that can catapult you into the limelight, to networking galas where you can meet potential co-founders, the Estonian startup scene provides a fertile ground for growth and collaboration. The \"Estonian Startup Events Calendar 2024-2025\" ensures you won't miss a beat, highlighting key dates that promise to be catalysts for innovation and change. Whether you're a seasoned entrepreneur or just stepping into the startup world, this calendar is your essential companion for navigating Estonia's thriving entrepreneurial landscape. So, get ready to dive in and discover how these events can shape your future and the future of your industry. The post Discover Opportunities: Estonian Startup Events Calendar 2024-2025 appeared first on Nordic Startup News .",
    "published": "Sat, 21 Sep 2024 09:23:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Maximize Your Growth on Startup Day: Insider Tips and Strategies",
    "link": "https://nordicstartupnews.com/maximize-your-growth-on-startup-day-insider-tips-and-strategies/",
    "summary": "Standing on the precipice of your dreams, the dawn of Startup Day marks not just the launch of a new venture but the beginning of a thrilling, unpredictable journey. Each tick of the clock brings you closer to unveiling your passion, your innovation, to the world. The atmosphere is electric with possibility, yet the stakes … The post Maximize Your Growth on Startup Day: Insider Tips and Strategies appeared first on Nordic Startup News .",
    "published": "Sat, 21 Sep 2024 07:54:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Tech Pioneers Set to Transform the Future at SLUSH 2024",
    "link": "https://nordicstartupnews.com/tech-pioneers-set-to-transform-the-future-at-slush-2024/",
    "summary": "In a world where technological advancements unfold at the speed of light, staying ahead of the curve is more crucial than ever. Enter SLUSH 2024, the linchpin event that promises to reshape the landscape of innovation and entrepreneurship. This annual gathering isn’t just another tech conference—it’s an electrifying confluence of brilliant minds, cutting-edge startups, and … The post Tech Pioneers Set to Transform the Future at SLUSH 2024 appeared first on Nordic Startup News .",
    "published": "Fri, 20 Sep 2024 21:39:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush 2024",
    "link": "https://nordicstartupnews.com/slush-2024/",
    "summary": "The post Slush 2024 appeared first on Nordic Startup News .",
    "published": "Thu, 19 Sep 2024 15:25:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "#ActionMatters 2024 edition – Arctic15",
    "link": "https://nordicstartupnews.com/actionmatters-2024-edition-arctic15/",
    "summary": "Another warm beginning of the warm Finnish summer – and another warm welcome to the old Cable Factory for the annual Arctic15 startup-investor conference. This story is the annual “vibes collection” from the Arctic15 floor, backstage, DealRoom meetings, official afterparties, unofficial gatherings and most importantly about HI, maybe with some added AI. (Got carried away … The post #ActionMatters 2024 edition – Arctic15 appeared first on Nordic Startup News .",
    "published": "Fri, 14 Jun 2024 23:24:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Hunome is for humans, by humans, and about humans.",
    "link": "https://nordicstartupnews.com/hunome-is-for-humans-by-humans-and-about-humans/",
    "summary": "In the era of AI, Hunome talks mostly about HI   So, at Arctic15 we met many AI companies, and then we met Hunome, more into Human Intelligence, HI, and especially for Collective Sensemaking.  With that, and a bit wider purpose statement of “helping humanity make sense of itself”, I had a pleasure to talk … The post Hunome is for humans, by humans, and about humans. appeared first on Nordic Startup News .",
    "published": "Tue, 11 Jun 2024 10:38:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Cool Startups Pitched in Icy Waters",
    "link": "https://nordicstartupnews.com/cool-startups-pitched-in-icy-waters/",
    "summary": "Oulu, Finland — The Arctic startup event, Polar Bear Pitching, marked its live return after a hiatus of four years. A sizable crowd gathered at Oulu Market Square, while online viewers from around the globe tuned in to witness ten selected startups take the plunge into the Avanto (Finnish for ice hole), each aiming to … The post Cool Startups Pitched in Icy Waters appeared first on Nordic Startup News .",
    "published": "Sun, 03 Mar 2024 14:18:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Tech-powered Hospitality Operator Bob W Secured €40 million Series B Funding",
    "link": "https://nordicstartupnews.com/tech-powered-hospitality-operator-bob-w-secures-e40-million-series-b-funding/",
    "summary": "Helsinki — In a stride towards revolutionizing the European hospitality sector, Finnish tech-enabled hospitality operator Bob W has announced its Series B funding of EUR 40 million. This round, led by Evli Growth Partners and joined by growth capital investors and prominent European entrepreneurs, including Taavet+Sten, the investment firm of Wise’s founder Taavet Hinrikus and … The post Tech-powered Hospitality Operator Bob W Secured €40 million Series B Funding appeared first on Nordic Startup News .",
    "published": "Sun, 03 Mar 2024 13:40:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "N-ink wins Voima Ventures’ science challenge and secures a €1M investment",
    "link": "https://nordicstartupnews.com/n-ink-wins-voima-ventures-science-challenge-and-secures-a-e1m-investment/",
    "summary": "Stockholm — A Swedish deep technology company N-ink is announced as the winner of a science challenge by Voima Ventures, an early-stage investor based in Helsinki and Stockholm. The challenge targeted Nordic and Baltic early-stage startups and research teams with groundbreaking science-based innovations. By winning the challenge, N-ink secures a €1M investment as a convertible … The post N-ink wins Voima Ventures’ science challenge and secures a €1M investment appeared first on Nordic Startup News .",
    "published": "Sun, 03 Mar 2024 13:18:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Attending Slush 2023 was brimming with positive vibes",
    "link": "https://nordicstartupnews.com/attending-participating-in-slush-was-brimming-with-positive-vibes/",
    "summary": "At a sizable booth, Samar Malik was promoting SAP for startups, emphasizing the company’s wealth of knowledge and expertise. It marked her inaugural attendance at Slush, where she commended the event and its arrangements. However, the genuine slush and sleet outdoors left the London resident a bit hesitant. Sami Vuorenmaa recently established his consultancy, Clarinum … The post Attending Slush 2023 was brimming with positive vibes appeared first on Nordic Startup News .",
    "published": "Tue, 12 Dec 2023 15:32:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "StarStuff came out of Stealth at Slush 2023",
    "link": "https://nordicstartupnews.com/starstuff-came-out-of-stealth-at-slush-2023/",
    "summary": "Slush mainstage acted as a platform for company launches and product announcements, and the Media Area right behind the stage had instant Q&A session with the launchers and announcers. What a great concept, hoping this would cover even more of the speakers. One of the launches was Starstuff, that came out of the stealth mode … The post StarStuff came out of Stealth at Slush 2023 appeared first on Nordic Startup News .",
    "published": "Sun, 10 Dec 2023 22:46:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Silo.ai launches at Slush 2023",
    "link": "https://nordicstartupnews.com/silo-ai-launches-at-slush-2023/",
    "summary": "Silo.ai, the Finnish AI Lab, which is Europe’s largest private AI Lab, made some remarkable launches today at Slush 2023 In short, this is concerning a new platform training LLM’s, PORO1 and 2, with deployment for European languages, with keeping the data also in Europe. But NSN had a chance to sit down with Founder … The post Silo.ai launches at Slush 2023 appeared first on Nordic Startup News .",
    "published": "Fri, 01 Dec 2023 16:31:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Faircado took home the Slush 100",
    "link": "https://nordicstartupnews.com/faircado-took-home-the-slush-100/",
    "summary": "The iconic Slush 100 winner is Faircado. The startup is turning e-commerce into recommerce — by making second-hand the most obvious and easy choice of every consumer. Our browser plugin uses AI to automatically find the best second-hand alternatives to what users are looking for online. Making them save time, money and CO2 without effort, … The post Faircado took home the Slush 100 appeared first on Nordic Startup News .",
    "published": "Fri, 01 Dec 2023 16:15:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nico Rosberg: “Courage” is a common nominator between startup entrepreneurs and race car drivers",
    "link": "https://nordicstartupnews.com/nico-rosberg-courage-is-a-common-nominator-between-startup-entrepreneurs-and-race-car-drivers/",
    "summary": "At the Slush startup event in Helsinki, Nico Rosberg, the 2016 Formula 1 World Champion, revealed what led him to pass by a lucrative contract extension in the pinnacle of motorsport and transition into an investor. – Nice to be back to my roots, said the 38-year-old to the extensive audience. By a fireside … The post Nico Rosberg: “Courage” is a common nominator between startup entrepreneurs and race car drivers appeared first on Nordic Startup News .",
    "published": "Thu, 30 Nov 2023 22:32:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic Game Helsinki 23: New attendance record at Slush side event",
    "link": "https://nordicstartupnews.com/nordic-game-helsinki-23-new-attendance-record-at-slush-side-event/",
    "summary": "For the second year the Slush gaming angle was mostly covered by Nordic Game We had a chance to reconnect with Jacob Riis from NordicGame on his returnal to Helsinki and Slush for 2023, as the Nordic Game Helsinki event took place on Slush day -1 and day 0 at Epicenter. In 2022 the Nordic … The post Nordic Game Helsinki 23: New attendance record at Slush side event appeared first on Nordic Startup News .",
    "published": "Thu, 30 Nov 2023 17:52:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Heikki Aura: Hype is good!",
    "link": "https://nordicstartupnews.com/heikki-aura-hype-is-good/",
    "summary": "Participated into Slush Media Day 2023, and Tech Trend Predictions 2024 panel to kick off the Slush 2023 official program, and one of the speakers Heikki Aura said something we like: “Hype is good, it’s like a great party” Blockchain Web3 Crypto were Heikki’s pick for the 2024 trend, with a lot of exciting things … The post Heikki Aura: Hype is good! appeared first on Nordic Startup News .",
    "published": "Thu, 30 Nov 2023 11:24:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Helsinki-based Failup Ventures builds the venture bridge between the Nordics and U.S.",
    "link": "https://nordicstartupnews.com/helsinki-based-failup-ventures-builds-the-venture-bridge-between-the-nordics-and-u-s/",
    "summary": "Failup Ventures, a new globally operating early-stage venture capital fund, has announced the first closing of €30 million of its new early-stage fund of €50 million. Founded by three previous Finnish entrepreneurs – Jesse Heikkilä, Topias Soininen, and Oscar Andersin – Failup Ventures backs early-stage startups with strong, mission-driven teams. Failup’s typical initial investments range … The post Helsinki-based Failup Ventures builds the venture bridge between the Nordics and U.S. appeared first on Nordic Startup News .",
    "published": "Thu, 30 Nov 2023 08:07:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush 2023 Side Events (hand picked by the pros)",
    "link": "https://nordicstartupnews.com/slush-2023-side-events-hand-picked-by-the-pros/",
    "summary": "Slush is on the ground (even if it’s still snow, and frozen right now). Remembering back to the Slush earlydays, there was this saying: “It’s cold and dark outside, and the coolest developers are inside”. Back then the inside meant Kaapelitehdas aka Cable Factory, and a selected venue for after party. These days Slush is … The post Slush 2023 Side Events (hand picked by the pros) appeared first on Nordic Startup News .",
    "published": "Tue, 28 Nov 2023 00:26:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "20 startups left in Slush 100 Pitch Competition",
    "link": "https://nordicstartupnews.com/20-startups-left-in-slush-100-pitch-competition/",
    "summary": "The most coveted pitching competition is the iconic Slush 100. The winner will get an equity investment from the leading early-stage funds in Europe: Accel, General Catalyst, Lightspeed Venture Partners, NEA, and Northzone. These iconic funds have backed historic companies like Meta, Stripe, Airbnb, Snap, Uber, Spotify, Salesforce, Instacart, and Klarna. The race is … The post 20 startups left in Slush 100 Pitch Competition appeared first on Nordic Startup News .",
    "published": "Mon, 20 Nov 2023 15:42:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush sold out again this year 2023",
    "link": "https://nordicstartupnews.com/slush-sold-out-again-this-year-2023/",
    "summary": "The eternal flame was ignited in 2008 in Helsinki with a one-day affair made up of around 250 people. Since that the event has grown by leaps and bounds, our goal has stayed the same: the focus is on how best to serve startup ecosystems across the world. As the founders and present employees of … The post Slush sold out again this year 2023 appeared first on Nordic Startup News .",
    "published": "Mon, 20 Nov 2023 15:18:47 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "NORDEEP: Nordic Deeptech will save the world",
    "link": "https://nordicstartupnews.com/nordeep-nordic-deeptech-will-save-the-world/",
    "summary": "Last week I had a pleasure to join the 2nd ever NORDEEP 2023 Summit, to see and hear what’s happening in Deep Tech scene within the Nordics. The opening keynote insights were given by Risto Siilasmaa, and that paved the way for this 2 days conference for a good crowd of attendees mainly from Finalnd … The post NORDEEP: Nordic Deeptech will save the world appeared first on Nordic Startup News .",
    "published": "Wed, 18 Oct 2023 23:56:14 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Arctic15 #ActionMatters, Health Track. The Health Startup Challenge(s). (Applies to many others, too:)",
    "link": "https://nordicstartupnews.com/arctic15-actionmatters-health-track-the-health-startup-challenges-applies-to-many-others-too/",
    "summary": "Arctic15 Health Track: Insights from Arctic15’s Health Track: Exploring Digital Health Arctic15’s Health Track, curated by Aki Koivistoinen, delved into the state of digital health. This article provides an overview of the track, including key insights from an interview with Aki, the Startup Health ambassador, and highlights from the panels and keynote presentation. Key Points: … The post Arctic15 #ActionMatters, Health Track. The Health Startup Challenge(s). (Applies to many others, too:) appeared first on Nordic Startup News .",
    "published": "Fri, 23 Jun 2023 10:35:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Aalto University’s Impressive Presence, again, at Arctic15 Event",
    "link": "https://nordicstartupnews.com/aalto-universitys-impressive-presence-again-at-arctic15-event/",
    "summary": "Arctic15 2023 was again a great showcase of innovations.  Panu Kuosmanen, Aalto University’s Innovation Advisor, highlights the University’s Commitment to Entrepreneurship. Aalto University has been a regular participant at the Arctic15 event since its inception in 2007. and we met with Panu to discuss the innovations at the University, emphasizing the university’s deep involvement in … The post Aalto University’s Impressive Presence, again, at Arctic15 Event appeared first on Nordic Startup News .",
    "published": "Thu, 22 Jun 2023 23:05:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic eWheels at Slush 2022.",
    "link": "https://nordicstartupnews.com/nordic-ewheels-at-slush-2022/",
    "summary": "There was a lot “e” in the air at Slush 2022, and not only in software, cryptos and such “normal” web3 things – but on wheels, too. Polestar was presenting their Precept car (originally made for the cancelled Geneva auto show 2020) finally touring around the world, paving the way to the next Polestar models … The post Nordic eWheels at Slush 2022. appeared first on Nordic Startup News .",
    "published": "Fri, 02 Dec 2022 17:38:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Greetings from Slush 2022 – Next the Nordics go to Singapore",
    "link": "https://nordicstartupnews.com/greetings-from-slush-2022-next-the-nordics-go-to-singapore/",
    "summary": "One of the many awesome meetings and encounters at Slush this year was with the Singapore delegation, and especially Rafael and Amelia from Singapore Management University, talking about their Global Business Plan Competition (link to the LKYGBPC website) We at Nordic Startup News agreed to help sourcing information of at least one Nordic company per country … The post Greetings from Slush 2022 – Next the Nordics go to Singapore appeared first on Nordic Startup News .",
    "published": "Mon, 28 Nov 2022 22:44:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush 2022 impressed the first-timers from near and far",
    "link": "https://nordicstartupnews.com/slush-2022-impressed-the-first-timers-from-near-and-far/",
    "summary": "As an event, Slush succeeds to impress all the attendees, even those Teflon-surfaced veterans, who have many previous Slushes on their belt. So it is no wonder, that the first-timers are generally astonished what comes to the atmosphere, solid arrangements, and the solid flux of meeting interesting people, especially  new ones. Deirdre Mc Gettrick from … The post Slush 2022 impressed the first-timers from near and far appeared first on Nordic Startup News .",
    "published": "Tue, 22 Nov 2022 13:48:51 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic Game 2022 – a great premiere",
    "link": "https://nordicstartupnews.com/nordic-game-2022-a-great-premiere/",
    "summary": "Nordic Game, the conference held annually in Malmö, Sweden, has become one of the leading events for the games industry, and each May it gathers thousands of developers, publishers and investors together. But this November, Nordic Game travelled to Helsinki, Finland, for the first time to do a special show as a partner side-event to … The post Nordic Game 2022 – a great premiere appeared first on Nordic Startup News .",
    "published": "Mon, 21 Nov 2022 15:50:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush pitching winner will not receive 1M€",
    "link": "https://nordicstartupnews.com/slush-pitching-winner-will-not-receive-1me/",
    "summary": "The world’s leading startup conference Slush has decided to revoke the prize funding valued of 1M€ for Immigram, the Slush100 pitching competition winner after its alleged connections to Russia and Russian experts who want to exit their homeland. The company has also a presence in Russia. Immigram and its founders Anastasia Miroljubova and Mikhail Sharonov … The post Slush pitching winner will not receive 1M€ appeared first on Nordic Startup News .",
    "published": "Mon, 21 Nov 2022 15:04:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Last minute Slush tips",
    "link": "https://nordicstartupnews.com/last-minute-slush-tips/",
    "summary": "The world’s largest start-up festival, Slush will take place in Helsinki on November 16-17, but Slush isn’t just the official single event. Slush Week, running from Nov 14-18, is loaded with a good variety of Side Events. Plus, and even no Slush Pass will be needed to access many of these events. Side Events are … The post Last minute Slush tips appeared first on Nordic Startup News .",
    "published": "Wed, 09 Nov 2022 09:14:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "GLOBHE unites the drones worldwide",
    "link": "https://nordicstartupnews.com/globhe-unites-the-drones-worldwide/",
    "summary": "The term “Crowddroning” means to unleash thousands of drones and their operators to provide ultra high resolution Earth observation data from every corner of the earth. This way, the collected data supplements the underused information the numerous satellites have to offer. The data itself is ready-to-analyze high-resolution data, straight to any server so the clients … The post GLOBHE unites the drones worldwide appeared first on Nordic Startup News .",
    "published": "Wed, 17 Aug 2022 12:38:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Action Matters – and mattered – at Arctic15, 2022",
    "link": "https://nordicstartupnews.com/action-matters-and-mattered-at-arctic15-2022/",
    "summary": "Few years ago the tagline (and the hashtag) for #Arctic15 was #FindTheOne. Nowadays it has evolved to #ActionMatters, and at this years LIVE comeback, it was really in the center of the activities. Arctic15 happened in the beginning of June in Helsinki, Finland, where the sun was shining, and a decent groups of over 1000 … The post Action Matters – and mattered – at Arctic15, 2022 appeared first on Nordic Startup News .",
    "published": "Fri, 08 Jul 2022 08:53:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish start-ups present strong growth numbers",
    "link": "https://nordicstartupnews.com/finnish-start-ups-present-strong-growth-numbers/",
    "summary": "The revenue of the member companies of the Finnish Startup Community, founded a year ago, has grown by 62 per cent from last year. The combined revenue of the companies was EUR 3.5 billion in 2021. The growth is expected to remain strong in 2022. “The majority of the revenue of our member companies comes … The post Finnish start-ups present strong growth numbers appeared first on Nordic Startup News .",
    "published": "Sun, 05 Jun 2022 13:32:54 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Live events are making their comeback: Arctic15 in Helsinki, Finland",
    "link": "https://nordicstartupnews.com/live-events-are-making-their-comeback-arctic15-in-finland/",
    "summary": "The Arctic15 Helsinki takes place on June, 7-8, 2022. Before the unforeseen pandemic hiatus, the event attracted over 1500+ Startups, VCs, CVCs, Angels, and Investors to get together. For this year, the arranging committee has some realistic numbers drafted: “We aim for 300+ investors, 450+ startups, 150+ corporates, a maximum of 2000 attendees and again … The post Live events are making their comeback: Arctic15 in Helsinki, Finland appeared first on Nordic Startup News .",
    "published": "Sun, 05 Jun 2022 08:53:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "HoloCare and Illumie Showcased at SXSW 2022",
    "link": "https://nordicstartupnews.com/holocare-and-illumie-showcased-at-sxsw-2022/",
    "summary": "The Norwegian medical startup projects HoloCare and Illumie were present at South by Southwest in Austin, Texas. Robert Stigliano After a cancellation in 2020, and an online-only version in 2021, South by Southwest was back this year to it’s full, pre-pandemic glory, showcasing the trends and technologies influencing our collective future. One of this year’s … The post HoloCare and Illumie Showcased at SXSW 2022 appeared first on Nordic Startup News .",
    "published": "Sat, 09 Apr 2022 20:37:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "CTO Survey says that Finnish companies are at the forefront of digital and green transition",
    "link": "https://nordicstartupnews.com/cto-survey-says-that-finnish-companies-are-at-the-forefront-of-digital-and-green-transition/",
    "summary": "Although R&D investments in Finland will continue to grow, some brutal challenges are looming in the future. R&D investments in Finland will continue to grow, driven by public funding. Finnish companies will continue to increase their product development investments in Finland also in 2022. Growth will be accelerated by the green transition, the advancement of … The post CTO Survey says that Finnish companies are at the forefront of digital and green transition appeared first on Nordic Startup News .",
    "published": "Sat, 26 Mar 2022 16:24:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Fintech startup Inpay named fastest growing company in Denmark",
    "link": "https://nordicstartupnews.com/fintech-startup-inpay-named-fastest-growing-company-in-denmark/",
    "summary": "Inpay, a Copenhagen based fintech, has been named the fastest growing company in Denmark out of millions of enterprises in the annual FT1000 business rankings. The company was also recognised as the sixth fastest growing fintech in Europe, and entered the ranking at as the 87th fastest growing company in Europe, the highest position a … The post Fintech startup Inpay named fastest growing company in Denmark appeared first on Nordic Startup News .",
    "published": "Mon, 07 Mar 2022 18:00:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonian start-up UP Catalyst secures EUR 1.59 million to turn CO2 from heavy industry emitters into graphite",
    "link": "https://nordicstartupnews.com/estonian-start-up-up-catalyst-secures-eur-1-59-million-to-turn-co2-from-heavy-industry-emitters-into-graphite/",
    "summary": "Lead by Estonian startup UP Catalyst, a two-year pilot program was launched to design and build a scalable shipping container synthesis reactor that is capable of transforming CO2 emissions into graphite, a mineral now classified by the EU as a critical raw material, and various carbon nanomaterials. By Teele Niidas  Until now, 500 thousand tons … The post Estonian start-up UP Catalyst secures EUR 1.59 million to turn CO2 from heavy industry emitters into graphite appeared first on Nordic Startup News .",
    "published": "Mon, 07 Mar 2022 17:46:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norwegian VC insights: How to win in venture when the rules-and geography- of the game is chaning?",
    "link": "https://nordicstartupnews.com/norwegian-vc-insights-how-to-win-in-venture-when-the-rules-and-geography-of-the-game-is-chaning/",
    "summary": "In this blog post, Katapult Group CEO, Fredrik Winther assesses the fast-changing landscape of venture, and why venture investors need to re-think strategy. By Frederik Winther The venture capital industry broke all records in 2021, and it led to systemic changes as to how it operates. Not long ago start-ups fought for the investors, these … The post Norwegian VC insights: How to win in venture when the rules-and geography- of the game is chaning? appeared first on Nordic Startup News .",
    "published": "Fri, 04 Feb 2022 01:48:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norway’s Katapult VC gains two impact unicorns in one week",
    "link": "https://nordicstartupnews.com/norways-katapult-vc-gains-two-impact-unicorns-in-one-week/",
    "summary": "With Chilean insurance tech startup Betterfly now sharing prestigious unicorn status with fellow portfolio company, Esusu, Norwegian VC Katapult has gained its second accelerator-bred impact unicorn in one week. Katapult first discovered and invested in Betterfly at the early Seed stage in mid-2019 with further investment via their follow-on fund in mid-2020. With Betterfly already … The post Norway’s Katapult VC gains two impact unicorns in one week appeared first on Nordic Startup News .",
    "published": "Fri, 04 Feb 2022 01:42:58 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland has largest number of companies using AI in Nordics",
    "link": "https://nordicstartupnews.com/finland-has-largest-number-of-companies-using-ai-in-nordics/",
    "summary": "Silo AI, one of Europe’s largest private AI laboratories, published a comprehensive market review of the use of artificial intelligence in Nordic countries. The Nordic State of AI report, which will be published annually with the Finnish Artificial Intelligence Center and other Nordic artificial intelligence organizations, provides a comprehensive overview of the Finnish, Swedish, Norwegian, … The post Finland has largest number of companies using AI in Nordics appeared first on Nordic Startup News .",
    "published": "Fri, 17 Dec 2021 18:51:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Biggest e-sports teams in Greater Copenhagen team up to attract game development talent",
    "link": "https://nordicstartupnews.com/biggest-e-sports-teams-in-greater-copenhagen-team-up-to-attract-game-development-talent/",
    "summary": "The biggest Danish and Swedish esports teams, Astralis and Ninjas in Pyjamas, have come together to attract game development talent to Greater Copenhagen. The partnership launches ahead of Denmark’s biggest esports event to showcase the significant organizations and career opportunities in the region following a shortage of game developers Copenhagen Capacity and Invest in Skåne, … The post Biggest e-sports teams in Greater Copenhagen team up to attract game development talent appeared first on Nordic Startup News .",
    "published": "Thu, 25 Nov 2021 09:18:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Altermail, world’s first blockchain-based communication platform, launches in Estonia",
    "link": "https://nordicstartupnews.com/altermail-worlds-first-blockchain-based-communication-platform-launches-in-estonia/",
    "summary": "Altermail, worlds’ first blockchain-based communication platform, offers an alternative to email, messaging and file sharing. Altermail disrupts existing information sharing with the help of the latest technological innovation in blockchain. The company has attracted $75 200 from two grant programs and looks to scale its service with the next financing round. Altermail addresses the gap … The post Altermail, world’s first blockchain-based communication platform, launches in Estonia appeared first on Nordic Startup News .",
    "published": "Tue, 23 Nov 2021 12:35:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish and Ukrainian tech ecosystems meet over sustainable innovations",
    "link": "https://nordicstartupnews.com/swedish-and-ukrainian-tech-ecosystems-meet-over-sustainable-innovations/",
    "summary": "Sweden and Ukraine have had a close tech exchange for many years. To further cooperation between the countries, the Sweden-Ukraine Business Forum was founded by the Swedish Embassy in collaboration with the business community. On November 18, ministers, leaders of large export companies and tech startups will gather for the ninth year in a row … The post Swedish and Ukrainian tech ecosystems meet over sustainable innovations appeared first on Nordic Startup News .",
    "published": "Tue, 16 Nov 2021 13:55:36 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Nordic Sustainable Tech startups to watch out for",
    "link": "https://nordicstartupnews.com/5-nordic-sustainable-tech-startups-to-watch-out-for/",
    "summary": "The Nordic countries have adopted a vision to become the most sustainable and integrated region in the world by 2030.   Bolstered by the ambitious climate goals set by the region’s governments,  startups have been tackling all manner of the green transition from smart farming to recycling, and are now leaders in sustainable technologies. At Oslo Innovation … The post 5 Nordic Sustainable Tech startups to watch out for appeared first on Nordic Startup News .",
    "published": "Tue, 02 Nov 2021 10:19:58 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 reasons Why Sweden is Leading the European eCommerce Industry",
    "link": "https://nordicstartupnews.com/5-reasons-why-sweden-is-leading-the-european-ecommerce-industry/",
    "summary": "In the past couple of years their has been an increase in Swedish eCommerce as a result of the pandemic. In an interview, Per Ljungberg, the chief executive officer at Svensk Digital Handel, mentioned that three out of four people in Sweden didn’t shop online ever before March 2020. However, experts suggest that the new … The post 5 reasons Why Sweden is Leading the European eCommerce Industry appeared first on Nordic Startup News .",
    "published": "Mon, 01 Nov 2021 13:06:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish-Kenyan EV startup Opibus announces $7.5 million investment",
    "link": "https://nordicstartupnews.com/swedish-kenyan-ev-startup-opibus-announces-7-5-million-investment/",
    "summary": "Opibus, Sub-Saharan Africa’s leading electric vehicle manufacturer, announced that it has raised $7.5 million in funding led by Silicon Valley fund At One Ventures, further supported by Factor[e] Ventures and Ambo Ventures managed by former Google and Uber executives. The investment is the largest ever in an electric mobility company in Sub-Saharan Africa and is … The post Swedish-Kenyan EV startup Opibus announces $7.5 million investment appeared first on Nordic Startup News .",
    "published": "Thu, 28 Oct 2021 10:25:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Covid-19 has not stopped growth in the Danish tech ecosystem, but demand for talent is serious roadblock",
    "link": "https://nordicstartupnews.com/covid-19-has-not-stopped-growth-in-the-danish-tech-ecosystem-but-demand-for-talent-is-serious-roadblock/",
    "summary": "A new survey from Digital Hub Denmark shows that the need for digital talent among Danish companies has significantly increased since the spring of 2020. As of Q2 2021, the Danish demand for digital talent is 22 per cent higher than before the pandemic.  While many companies continued to thrive during Covid-19,  they have struggled … The post Covid-19 has not stopped growth in the Danish tech ecosystem, but demand for talent is serious roadblock appeared first on Nordic Startup News .",
    "published": "Wed, 27 Oct 2021 09:27:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "What is the Future of the Nordic Model?  Insights from Oslo Innovation Week",
    "link": "https://nordicstartupnews.com/what-is-the-future-of-the-nordic-model-insights-from-oslo-innovation-week/",
    "summary": "It is often argued that the Nordic Model offers an environment where value-driven innovation can flourish, meaning innovation that improves society by creating value for all stakeholders in an ethical and responsible way.  Anchored in a liberal market and a strong societal structure,  the Nordic Model is reputed for creating more ethical companies that seek … The post What is the Future of the Nordic Model?  Insights from Oslo Innovation Week appeared first on Nordic Startup News .",
    "published": "Fri, 15 Oct 2021 08:43:22 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s Kuva Space raises funding for precision farming and global carbon sequestration from space",
    "link": "https://nordicstartupnews.com/finlands-kuva-space-raises-funding-for-precision-farming-and-global-carbon-sequestration-from-space/",
    "summary": "Climate change is already strongly changing our environment and the global  food security is beginning to halter. Finnish startup Kuva Space aims to help farmers in precision farming as well as bio asset owners, businesses  and governments get better insight for making effective decisions towards  sustainable farming, carbon binding and reduction of climate effects. Kuva … The post Finland’s Kuva Space raises funding for precision farming and global carbon sequestration from space appeared first on Nordic Startup News .",
    "published": "Thu, 07 Oct 2021 07:58:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sky Mavis raises Series B for blockchain-enabled games",
    "link": "https://nordicstartupnews.com/sky-mavis-series-b-for-blockchain-enabled-games/",
    "summary": "Sky Mavis, the creators of Axie Infinity, have announced a $152M USD Series B round led by venture capital firm Andreessen Horowitz (a16z) with participation from Accel and Paradigm. The round will be used to further build out a global team, scale infrastructure, and build their own distribution platform to support game developers to create … The post Sky Mavis raises Series B for blockchain-enabled games appeared first on Nordic Startup News .",
    "published": "Tue, 05 Oct 2021 14:01:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s Elfys raises €3 million energy efficient wearables",
    "link": "https://nordicstartupnews.com/finlands-elfys-raises-e3-million-energy-efficient-wearables/",
    "summary": "Photodetector company Elfys raises €3M  to ramp up the production for the growing  wearable market that are more energy efficient. The round is lead by deeptech investor Voima Ventures, whose portfolio includes the successful Oura Ring. Photodetectors are sensors of light most commonly used in devices such as  smartwatches or any other worn devices. Now … The post Finland’s Elfys raises €3 million energy efficient wearables appeared first on Nordic Startup News .",
    "published": "Mon, 27 Sep 2021 13:14:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish Edtech Justlearn works to democratize access to language training",
    "link": "https://nordicstartupnews.com/danish-edtech-justlearn-works-to-democratize-access-to-language-training/",
    "summary": "Justlearn is Danish ed-tech company founded in 2017 with a mission to democratize access to language learning.  The mission behind Justlearn it to be able to teach language without attending  any classes, educational institutions, or standardized language courses. Justlearn plans to democratize acces to language learning through customization. Each student learns at their own pace … The post Danish Edtech Justlearn works to democratize access to language training appeared first on Nordic Startup News .",
    "published": "Mon, 20 Sep 2021 13:53:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish biotech startup Kääpä raises Series A to grow mushroom product line",
    "link": "https://nordicstartupnews.com/finnish-biotech-startup-kaapa-raises-series-a-to-grow-mushroom-product-line/",
    "summary": "The industry award winning Nordic Mushrooms product line by KÄÄPÄ Biotech, a Finnish biotechnology startup, has caught the attention of major global nutritional supplement manufacturers. The demand on the wholesale product line has increased rapidly and therefore KÄÄPÄ Biotech is now entering into the Series A investment stage to scale up the production capacity to … The post Finnish biotech startup Kääpä raises Series A to grow mushroom product line appeared first on Nordic Startup News .",
    "published": "Mon, 20 Sep 2021 13:49:57 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Crowd For Impact disrupts the crowdfunding market through impact specific crowdfunding",
    "link": "https://nordicstartupnews.com/crowd-for-impact-disrupts-the-crowdfunding-market-through-impact-specific-crowdfunding/",
    "summary": "A Helsinki based startup, Crowd For Impact, has launched a crowdfunding platform for impact startups solving global issues. It offers both individuals and companies a chance to support impact projects, and receive responsibly produced goods and services in return. Crowd For Impact is a reward based crowdfunding platform that combines crowdfunding, corporate sustainability and startup … The post Crowd For Impact disrupts the crowdfunding market through impact specific crowdfunding appeared first on Nordic Startup News .",
    "published": "Mon, 20 Sep 2021 13:40:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish Truecaller to IPO (aka what is in an exit)",
    "link": "https://nordicstartupnews.com/swedish-truecaller-to-ipo-aka-what-is-in-an-exit/",
    "summary": "This week, tech platform Intuit announced they are acquiring marketing firm Mailchimp for $12bn. Altanta-based Mailchimp has grown to its 2.4 million monthly active users without raising a single dollar of external funding, making the exit a lucrative one for the owners. The owners of Mailchimp are its two founders.  Also this week, Stockholm-based caller-identification … The post Swedish Truecaller to IPO (aka what is in an exit) appeared first on Nordic Startup News .",
    "published": "Thu, 16 Sep 2021 08:18:55 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s StemSight, first human stem cell startup from Finland, announces seed funding round",
    "link": "https://nordicstartupnews.com/finlands-stemsight-first-human-stem-cell-startup-from-finland-announces-seed-funding-round/",
    "summary": "All female founded StemSight is the first human stem cell startup from Finland to receive funding,  announcing a €500000 seed round from Voima Ventures. Stemsight aims to help over 12 million people suffer from corneal blindness regain their sight.   The all female-founded team, based in Tampere, has announced a new seed round from the DeepTech … The post Finland’s StemSight, first human stem cell startup from Finland, announces seed funding round appeared first on Nordic Startup News .",
    "published": "Wed, 15 Sep 2021 07:41:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "EU Agency for the Space Programme launches #myEUspace competition for startups",
    "link": "https://nordicstartupnews.com/eu-agency-for-the-space-programme-launches-myeuspace-competition-for-startups/",
    "summary": "The European Union Agency for the Space Programme (EUSPA) launches #myEUspace competition. The EU prize contest targets innovators and entrepreneurs ready to explore, develop and commercialize innovative solutions that leverage EU Space data and services, going beyond the current space-applications horizon, and fusing and testing new technologies in location-based services, smart mobility, smart agriculture, geomatics, … The post EU Agency for the Space Programme launches #myEUspace competition for startups appeared first on Nordic Startup News .",
    "published": "Tue, 07 Sep 2021 11:10:48 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish startup Pibox raises funding for remote collaboration solution for audio content",
    "link": "https://nordicstartupnews.com/finnish-startup-pibox-raises-funding-for-remote-collaboration-solution-for-audio-content/",
    "summary": "Pibox is a centralized/all-in-one remote collaboration solution developed for working with creative collaboration. It is used daily by the head of a production, music producers, managers and sound engineers. Now, Pibox has raised € 150,000 in funding from the Pitchdrive fund and several angel investors. Pibox was launched in 2018. The solution first raised interest … The post Finnish startup Pibox raises funding for remote collaboration solution for audio content appeared first on Nordic Startup News .",
    "published": "Mon, 23 Aug 2021 12:30:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Beauty-tech startup Watalook lands $1M in pre-seed",
    "link": "https://nordicstartupnews.com/beauty-tech-startup-watalook-lands-1m-in-pre-seed/",
    "summary": "The Lithuanian based startup Watalook is striving to redefine the beauty tech market with its digital assistant for independent beauty professionals across the U.S. Watalook has experienced a growth of over 30% in users each month and has recently raised $1M in the pre-seed round co-led by Startup Wise Guys, Crosspring, Launchpad Capital, and angel … The post Beauty-tech startup Watalook lands $1M in pre-seed appeared first on Nordic Startup News .",
    "published": "Fri, 20 Aug 2021 12:23:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonian start-up helps to save up to 50% of EU housing energy consumption through intelligent building solution",
    "link": "https://nordicstartupnews.com/estonian-start-up-helps-to-save-up-to-50-of-eu-housing-energy-consumption-through-intelligent-building-solution/",
    "summary": "Bisly, the Estonian tech company developing intelligent building solutions, has raised 1.7 million euros to carry out its aggressive expansion plan into European countries. The tech start-up’s technology helps to make energy consumption up to two times more efficient. According to Siim Vips, founder and CEO of Bisly, buildings consume up to 40% of energy … The post Estonian start-up helps to save up to 50% of EU housing energy consumption through intelligent building solution appeared first on Nordic Startup News .",
    "published": "Wed, 28 Jul 2021 20:21:06 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swedish startup ElByte combines comparison of electricity agreements to reduce energy consumption",
    "link": "https://nordicstartupnews.com/swedish-startup-elbyte-combines-comparison-of-electricity-agreements-to-reduce-energy-consumption/",
    "summary": "Elbyte started as a page with detailed guides about the Swedish electricity market, but now you can also compare and find cheap electricity prices and electricity agreements in their comparison service. Elbyte was started with a passion for sustainability and how you as a consumer of electricity could reduce your consumption. The founders of Elbyte … The post Swedish startup ElByte combines comparison of electricity agreements to reduce energy consumption appeared first on Nordic Startup News .",
    "published": "Sat, 10 Jul 2021 20:28:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Denmark’s Custimy raised $800K round to help SMBs understand their customers",
    "link": "https://nordicstartupnews.com/denmarks-custimy-raised-800k-round-to-help-smbs-understand-their-customers/",
    "summary": "Danish software start-up Custimy.io has developed a Customer Data Platform (CDP), to help SMBs challenge the multinational e-commerce giants through smarter use of customer data. Less than a year into its existence, Custimy.io raises more than ＄800k in pre seed funding to take the next steps in their journey towards empowering SMBs through data insights. Software … The post Denmark’s Custimy raised $800K round to help SMBs understand their customers appeared first on Nordic Startup News .",
    "published": "Fri, 25 Jun 2021 20:36:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "SNÖ Ventures launch new $100m Nordic venture fund backed by Peter Thiel",
    "link": "https://nordicstartupnews.com/sno-ventures-launch-new-100m-nordic-venture-fund-backed-by-peter-thiel/",
    "summary": "Oslo-based SNÖ Ventures has launched its second fund to  invest in visionary Nordic entrepreneurs and connect the Nordics  with the US and broader Europe. The new fund targets $100M to invest  in early stage, high-growth Nordic tech companies with the potential to disrupt,  create or capture large markets through transformative technology or  solutions.  By Kremena … The post SNÖ Ventures launch new $100m Nordic venture fund backed by Peter Thiel appeared first on Nordic Startup News .",
    "published": "Fri, 25 Jun 2021 09:09:15 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Ten startups chosen to accelerate the development of sustainable cities in Nordics",
    "link": "https://nordicstartupnews.com/ten-startups-chosen-to-accelerate-the-development-of-sustainable-cities-in-nordics/",
    "summary": "The Copenhagen-based Nordic accelerator Urbantech Program, hosted by BloxHub, has announced the 10 most promising and innovative sustainable technology startups for their 2021 batch. This announcement comes after a global search for urbantech startups. According to the UN, up to 70 percent of the world’s population is expected to live in cities by 2050. This … The post Ten startups chosen to accelerate the development of sustainable cities in Nordics appeared first on Nordic Startup News .",
    "published": "Thu, 17 Jun 2021 08:58:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Civinity invests €15 million in PropTech startups",
    "link": "https://nordicstartupnews.com/civinity-invests-e15-million-in-proptech-startups/",
    "summary": "Civinity, one of the largest facility management and engineering groups in the Baltic states, has announced the launch of their new investment management firm called Pentaframe Capital. Pentaframe Capital plans to invest up to €15 million across the following five years, with focus on real estate, facility management, and smart city tech startups across Europe. By … The post Civinity invests €15 million in PropTech startups appeared first on Nordic Startup News .",
    "published": "Thu, 10 Jun 2021 11:31:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish scale-up Nosto acquires Stackla, a global visual content marketing platform",
    "link": "https://nordicstartupnews.com/finnish-scale-up-nosto-acquires-stackla-a-global-visual-content-marketing-platform/",
    "summary": "The Finnish commerce experience scale-up Nosto has aquired Stackla, a visual content marketing platform for user-generated content. The acquisition is Nostos first acquisition and marks their entrance into the Australian and Southeast Asian markets.  By Uday Radia AI-powered personalized shopping Nosto, a Finnish commerce experience scale-up which helps retailers deliver personalized digital shopping experiences, has … The post Finnish scale-up Nosto acquires Stackla, a global visual content marketing platform appeared first on Nordic Startup News .",
    "published": "Fri, 04 Jun 2021 10:18:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic and Baltic investments show progressive trend towards sustainability in 2021",
    "link": "https://nordicstartupnews.com/nordic-and-baltic-investments-show-progressive-trend-towards-sustainability-in-2021/",
    "summary": "According to reports from, European Capital,  Danske Bank and i5invest, European VC and PE funds have been substantially gaining ground despite Covid-19, and a substantial margin in the Nordics are focusing on investments in energy and sustainability. Norway, Denmark, and Lithuania have a particularly strong focus on investments in these areas in 2021 compared to … The post Nordic and Baltic investments show progressive trend towards sustainability in 2021 appeared first on Nordic Startup News .",
    "published": "Wed, 02 Jun 2021 11:55:49 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Latvia’s Nordigen raises €2 million to expand free open banking API",
    "link": "https://nordicstartupnews.com/latvias-nordigen-raises-e2-million-to-expand-free-open-banking-api/",
    "summary": "Latvia’s Nordigen has announced a new €2.1 million investment to expand their freemium model after growing to support more than 1000 European bank APIs.  Investors include Black Pearls VC, Inventure, Highgoal Capital, ID4 Ventures, Calchas Holding and angel investors from across the Baltics including Artis Kehris, Henry Nilert, Gerri Kodres and Riivo Anton. The startup … The post Latvia’s Nordigen raises €2 million to expand free open banking API appeared first on Nordic Startup News .",
    "published": "Wed, 02 Jun 2021 09:15:39 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonia’s UP Catalyst receives funding to produce oxygen on Mars",
    "link": "https://nordicstartupnews.com/estonias-up-catalyst-receives-funding-to-produce-oxygen-on-mars/",
    "summary": "The technology startup UP Catalyst, founded in 2019, received €50 000 of seed money from the 2021 ESA BIC (Business Incubation Centre) programme for business and product development to boost their novel way of oxygen production on Mars. In addition to the funding UP Catalyst receives technical support from the European Space Agency and hands … The post Estonia’s UP Catalyst receives funding to produce oxygen on Mars appeared first on Nordic Startup News .",
    "published": "Fri, 28 May 2021 11:53:39 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Top Finnish startup accelerator expands to the Nordics and Baltics",
    "link": "https://nordicstartupnews.com/top-finnish-startup-accelerator-expands-to-the-nordics-and-baltics/",
    "summary": "Summer of 2021 is closing in, and as the world is seeing a surge in optimism with the influx of vaccines, Kiuas, the #1 startup accelerator in Finland, brings exciting news about expansion. Kiuas today revolves around the startup accelerator programs, and with the changing world, it makes to evolve the flagship program, Kiuas Accelerator, … The post Top Finnish startup accelerator expands to the Nordics and Baltics appeared first on Nordic Startup News .",
    "published": "Tue, 18 May 2021 11:29:00 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Denmark is the second-best funded nation for startups after USA",
    "link": "https://nordicstartupnews.com/denmark-is-the-second-best-funded-nation-for-startups-after-usa/",
    "summary": "According to a report by Money UK, Denmark is the second best-funded nation for startup businesses after the US.  With a total of five new business grants offering over $1,000,000, Denmark only lags slightly behind top funding opportunities in the US. The report, which is based on data from the Innovation Investment Index, highlights Denmark … The post Denmark is the second-best funded nation for startups after USA appeared first on Nordic Startup News .",
    "published": "Wed, 03 Mar 2021 13:52:27 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic startups building radical transparency into tech",
    "link": "https://nordicstartupnews.com/nordic-startups-building-radical-transparency-into-tech/",
    "summary": "Getting through the Nordic winter is trying at the best of times. The previous months have provided few hours of sunshine but an infinite amount of “recommendations” (it is to date not legal for the Swedish government to e.g. enforce a lockdown) formulated in almost as many ways as there are media outlets. The Nordics … The post Nordic startups building radical transparency into tech appeared first on Nordic Startup News .",
    "published": "Tue, 02 Mar 2021 18:16:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish Dixa acquires Australian SaaS company Elevio",
    "link": "https://nordicstartupnews.com/danish-dixa-acquires-australian-saas-company-elevio/",
    "summary": "Danish customer support innovator Dixa has acquired Melbourne-based knowledge management platform Elevio in a circa US$15m deal. The acquisition supports Dixa’s long term vision to simplify more aspects of customer service through personalization and machine learning. Dixa’s platform is used by consumer-facing brands to serve customers across multiple channels from a single screen including social media, … The post Danish Dixa acquires Australian SaaS company Elevio appeared first on Nordic Startup News .",
    "published": "Sun, 28 Feb 2021 18:27:29 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonia-based Avokaado secures €700K to automate contract lifecycle management",
    "link": "https://nordicstartupnews.com/estonia-based-avokaado-secures-e700k-to-automate-contract-lifecycle-management/",
    "summary": "Avokaado, a contract lifecycle management platform (CLM) from Estonia, announces a €700K pre-seed round, including Hong Kong’s ParticleX as a strategic investor. Avokaado was founded by legal tech innovator Mariana Hagström in 2016, after experiencing significant inefficiencies in service delivery during her extensive career as an attorney-at-law and managing partner at a law firm. What … The post Estonia-based Avokaado secures €700K to automate contract lifecycle management appeared first on Nordic Startup News .",
    "published": "Sat, 27 Feb 2021 18:19:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "An Overview of the Nordic iGaming Market in 2021",
    "link": "https://nordicstartupnews.com/an-overview-of-the-nordic-igaming-market-in-2021/",
    "summary": "Home to the first Bitcoin lottery and other blockchain-powered online games, the Northern European region is no stranger to the iGaming industry. In recent years, the Nordic countries have become some of the most successful in the entire European gaming industry. So, let’s take a closer look at the Nordic iGaming market today and how it … The post An Overview of the Nordic iGaming Market in 2021 appeared first on Nordic Startup News .",
    "published": "Mon, 15 Feb 2021 12:17:19 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "“Unconventional Accelerator”: The first digital accelerator targeting underrepresented Nordic founders",
    "link": "https://nordicstartupnews.com/unconventional-accelerator-the-first-digital-accelerator-targeting-underrepresented-nordic-founders/",
    "summary": "Since launching its report on who funds whom in the Nordics, together with partners like Startup Sweden and NVCA, the team at Unconventional Ventures have been busy. They recently launched the UV Syndicate, giving everyone the opportunity to co-invest in, by UV vetted, startups at pre-seed and seed stages. Today they announce the first digital … The post “Unconventional Accelerator”: The first digital accelerator targeting underrepresented Nordic founders appeared first on Nordic Startup News .",
    "published": "Wed, 13 Jan 2021 19:42:07 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sweden’s Mbegu Solar: Innovation cannot be paused in wait for a more suitable year",
    "link": "https://nordicstartupnews.com/swedens-mbegu-solar-innovation-cannot-be-paused-in-wait-for-a-more-suitable-year/",
    "summary": "Mbegu Solar AB was founded in 2020 and its team is based in Stockholm, Lund and Nairobi. They bring solar products in a completely new format to the East African market and target micro-entrepreneurs as opposed to the end consumer. Solar products are already widely available all over the world for off grid electricity, but … The post Sweden’s Mbegu Solar: Innovation cannot be paused in wait for a more suitable year appeared first on Nordic Startup News .",
    "published": "Tue, 12 Jan 2021 13:06:10 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonia offers itself up as post-2020 mental health recovery spot for ICT-talents",
    "link": "https://nordicstartupnews.com/estonia-offers-itself-up-as-post-2020-mental-health-recovery-spot-for-ict-talents/",
    "summary": "You’ve heard of hygge. If you’re a Scandinavia enthusiast, you may even have heard of friluftsliv. But are you ready for the lifestyle trend that’s so quintessentially Northern that the people who invented it don’t even have a catchy term for it, much like fish presumably don’t have a word for water? It’s the Estonian phenomenon of … The post Estonia offers itself up as post-2020 mental health recovery spot for ICT-talents appeared first on Nordic Startup News .",
    "published": "Wed, 16 Dec 2020 08:54:48 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Audio first: Nordic social interactions in the year of the pandemic",
    "link": "https://nordicstartupnews.com/audio-first-nordic-social-interactions-in-the-year-of-the-pandemic/",
    "summary": "Statistics show we have collectively stigmatized randomly phoning someone up and as a result, over the past decade, the number of texts sent monthly have increased with 7,700% and US smartphones users allegedly receive and respond to 5x more texts than phone calls. We have built handheld walls against direct interactions at the same time … The post Audio first: Nordic social interactions in the year of the pandemic appeared first on Nordic Startup News .",
    "published": "Wed, 16 Dec 2020 08:45:58 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Japanese web design hits the Nordics",
    "link": "https://nordicstartupnews.com/japanese-web-design-hits-the-nordics/",
    "summary": "Garden Eight is a multi-award-winning digital production team from Japan specialising in visual design, web design and web development. Founded in Asakusabashi, Tokyo in 2011, the studio has just opened their European headquarters in Copenhagen. The Nordics are known as the world’s “unicorn factory” per capita outside of Silicon Valley and have enjoyed a spotlight … The post Japanese web design hits the Nordics appeared first on Nordic Startup News .",
    "published": "Wed, 16 Dec 2020 08:36:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish AI writing tool Flowrite closes pre-seed funding which includes Unity founder David Helgason",
    "link": "https://nordicstartupnews.com/finnish-ai-writing-tool-flowrite-closes-pre-seed-funding-which-includes-unity-founder-david-helgason/",
    "summary": "Finnish startup Flowrite, building an AI-powered writing tool on OpenAI’s GPT-3, has closed a pre-seed funding round of €550,000 from Europe’s leading early-stage investors Lifeline Ventures and Seedcamp, joined by angel investors including Unity founder David Helgason. Flowrite is among the first companies globally to launch and raise funding for a product built on top … The post Finnish AI writing tool Flowrite closes pre-seed funding which includes Unity founder David Helgason appeared first on Nordic Startup News .",
    "published": "Wed, 09 Dec 2020 12:39:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Lithuania eases restrictions on IT licenscing for Fintechs",
    "link": "https://nordicstartupnews.com/lithuania-eases-restrictions-on-it-licenscing-for-fintechs/",
    "summary": "As in many countries during the pandemic, contactless payments have been on the rise in Lithuana.   The country has chosen to make Fintech a national priority and has updated the process for business licensing for Fintech companies. By Lukas Pereckas “The whole Fintech ecosystem here is so developed – business support networks, clear efficient regulation, … The post Lithuania eases restrictions on IT licenscing for Fintechs appeared first on Nordic Startup News .",
    "published": "Wed, 09 Dec 2020 12:31:50 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "10 Latvian startups to watch",
    "link": "https://nordicstartupnews.com/10-latvian-startups-to-watch/",
    "summary": "A small nation of fewer than 2 million people, Latvia is one of Europe’s entrepreneurial hotspots. There are several advantages that ensure that Latvia is a great place for startups starting from a multilingual workforce, affordable costs for operations, a high standard of living, and government support. Latvia has a booming startup ecosystem and a … The post 10 Latvian startups to watch appeared first on Nordic Startup News .",
    "published": "Mon, 16 Nov 2020 11:33:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish startup Linear raises €1.1M to digitalize the real estate business",
    "link": "https://nordicstartupnews.com/finnish-startup-linear-raises-e1-1m-to-digitalize-the-real-estate-business/",
    "summary": "Linear, a company focusing on the digitalization of real estate brokerage, has closed €1.1 million in seed funding.  The company, founded in 2018, offers an AI-driven  digital ecosystem to facilitate the housing trade. They will use the latest funding round on future growth and expansion to new markets. Linear offers realtors a comprehensive SaaS (Software as … The post Finnish startup Linear raises €1.1M to digitalize the real estate business appeared first on Nordic Startup News .",
    "published": "Tue, 10 Nov 2020 14:34:16 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kaffe Bueno closes EUR 1.1 million seed round for coffee by-product upcycling",
    "link": "https://nordicstartupnews.com/kaffe-bueno-closes-eur-1-1-million-seed-round-for-coffee-by-product-upcycling/",
    "summary": "Danish Industrial biotech startup Kaffe Bueno received EUR 1.1 million from, PINC (Paulig Group venture capital, FI), Vækstfonden (DK), The Yield Lab (IE), and a Danish business angel. The money will be spent on scaling up production, growing the team, IPR, and further process and product development. Kaffe Bueno is an ingredients company using green … The post Kaffe Bueno closes EUR 1.1 million seed round for coffee by-product upcycling appeared first on Nordic Startup News .",
    "published": "Tue, 27 Oct 2020 11:58:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Estonian virtual Cyber Security hackathon unified participants from 14 countries to bring usable solutions to burning topics in just 48h",
    "link": "https://nordicstartupnews.com/estonian-virtual-cyber-security-hackathon-unified-participants-from-14-countries-to-bring-usable-solutions-to-burning-topics-in-just-48h/",
    "summary": "On the 23rd to 25th of October Garage48, Startup Estonia, the Institute of Computer Science at the University of Tartu with several cyber security-related startups and organizations came together and poured their heart and soul into organizing and supporting the birth of a 4th Cyber Security Hackathon. The aim of the event was to grow, … The post Estonian virtual Cyber Security hackathon unified participants from 14 countries to bring usable solutions to burning topics in just 48h appeared first on Nordic Startup News .",
    "published": "Mon, 26 Oct 2020 15:05:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic early stage investment recovering based on bullish mood at Arctic15",
    "link": "https://nordicstartupnews.com/nordic-early-stage-investment-recovering-based-on-bullish-mood-at-arctic15/",
    "summary": "There was a bullish attitude among attendees at this year’s online version of the Arctic15 startup event that investment in Northern European startups was picking up despite a second wave of COVID19 across the region. With one of the main themes of the event being cross-border angel investing, several new angel investment syndicates were established … The post Nordic early stage investment recovering based on bullish mood at Arctic15 appeared first on Nordic Startup News .",
    "published": "Fri, 23 Oct 2020 11:39:49 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic startup funding – a deep dive into who funds whom",
    "link": "https://nordicstartupnews.com/nordic-startup-funding-a-deep-dive-into-who-funds-whom/",
    "summary": "All male founding teams still get 92.9% of external capital in the Nordics, to build and expand their startups. However, a new report from Unconventional Ventures shows us how a shift towards a more equal distribution of capital can be accelerated.  Unconventional Ventures is a Nordic early-stage investment firm that invest in scaleable tech startups … The post Nordic startup funding – a deep dive into who funds whom appeared first on Nordic Startup News .",
    "published": "Fri, 16 Oct 2020 14:26:31 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "#HacktheCrisis solutions:  Where are they now?  3 companies still going strong",
    "link": "https://nordicstartupnews.com/hackthecrisis-solutions-where-are-they-now-3-companies-still-going-strong/",
    "summary": "#HacktheCrisis was a hackathon initiated by Garage48 in Estonia in March 2019, where teams built solutions for the Covid-19 crisis over a long weekend.  The event went global, with hacks held in over 68 countries.  In some cases, the hacks were record breaking – in Denmark, Norway, and Sweden, the #HacktheCrisis became the biggest hack … The post #HacktheCrisis solutions:  Where are they now?  3 companies still going strong appeared first on Nordic Startup News .",
    "published": "Thu, 15 Oct 2020 12:09:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Swiipe is nominated as EY Entrepreneur of the Year",
    "link": "https://nordicstartupnews.com/swiipe-is-nominated-as-ey-entrepreneur-of-the-year/",
    "summary": "More than ever we need strong role models and entrepreneurs who can inspire others and actively help put focus on growth and innovation. For 25 years, EY has paid tribute to Denmark’s best growth creators, and this year they want to engage the business community and the participating companies in the fight to defy the crisis we are in and … The post Swiipe is nominated as EY Entrepreneur of the Year appeared first on Nordic Startup News .",
    "published": "Tue, 13 Oct 2020 14:36:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sigma Software partners with the Stockholm School of Economics Business Lab",
    "link": "https://nordicstartupnews.com/sigma-software-partners-with-the-stockholm-school-of-economics-business-lab/",
    "summary": "Sigma Software has become an official partner of SSE Business Lab, startup incubator of the Stockholm School of Economics, which provides a platform for growth to exceptional entrepreneurs. The Stockholm School of Economics is a world-known business school with a rich history and is internationally recognized in The Financial Times Business Education Rankings. Their incubator, … The post Sigma Software partners with the Stockholm School of Economics Business Lab appeared first on Nordic Startup News .",
    "published": "Tue, 13 Oct 2020 14:31:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish AI & 3D Printing companies lead Spanish accelerator BIND 4.0",
    "link": "https://nordicstartupnews.com/danish-ai-3d-printing-companies-lead-spanish-accelerator-bind-4-0/",
    "summary": "Danish startups AddiFab and Nordbo Robotics, were selected among more than 570 applications from all over the world to develop solutions in collaboration with companies in the health and manufacturing fields, such as BTI and ITP, as part of the BIND 4.0 accelerator. Each year, BIND 4.0, developed by the Department of Economic Development and … The post Danish AI & 3D Printing companies lead Spanish accelerator BIND 4.0 appeared first on Nordic Startup News .",
    "published": "Thu, 06 Aug 2020 12:06:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish edtech CanopyLAB acquires Peruvian publishing startup YoPublico to serve rapidly expanding userbase in Latin America.",
    "link": "https://nordicstartupnews.com/danish-edtech-canopylab-acquires-peruvian-publishing-startup-yopublico-to-serve-rapidly-expanding-userbase-in-latin-america/",
    "summary": "Danish edtech CanopyLAB is behind a social and adaptive learning platform that is being used in more than 85 different countries. By Esben Trier Based on co-founder Sahra-Josephine Hjorth’s Ph.D. research at the University of Aalborg, CanopyLAB launched its product in late 2018 with a focus on corporate learning. With COVID-19 CanopyLAB’s reach expanded dramatically … The post Danish edtech CanopyLAB acquires Peruvian publishing startup YoPublico to serve rapidly expanding userbase in Latin America. appeared first on Nordic Startup News .",
    "published": "Fri, 26 Jun 2020 20:11:34 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "TEDxCopenhagen innovated by Corona",
    "link": "https://nordicstartupnews.com/tedxcopenhagen-innovated-by-corona/",
    "summary": "TEDxCopenhagen is a local gathering where live TED-like talks and performances are shared with the community. TEDx´s are normally held physically as an event, and the Corona virus has therefore challanged this format. TEDxCopenhagen license holder, René Munk, speaks about how Corona has changed the TEDxCopenhagen format, maybe forever. TEDx has always been about the … The post TEDxCopenhagen innovated by Corona appeared first on Nordic Startup News .",
    "published": "Fri, 26 Jun 2020 19:39:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Baltic startup Cargo Stream aims to reduce Covid-19 stress on logistics sector",
    "link": "https://nordicstartupnews.com/baltic-startup-cargo-stream-aims-to-reduce-covid-19-stress-on-logistics-sector/",
    "summary": "Due to the current Coronavirus crisis, supply chains around the world are being disrupted. Cargo Stream – a logistics management system established in Lithuania, is proposing a solution that optimize logistics processes and utilizes the potential of communication between the carriers, recipients, and logistics companies. Cargo Stream enables companies to manage logistics documentation and data … The post Baltic startup Cargo Stream aims to reduce Covid-19 stress on logistics sector appeared first on Nordic Startup News .",
    "published": "Tue, 16 Jun 2020 07:05:16 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New startup wants to help Danes get 11 billion in forgotten tax deductions",
    "link": "https://nordicstartupnews.com/new-startup-wants-to-help-danes-get-11-billion-in-forgotten-tax-deductions/",
    "summary": "Each year, Danes miss out on 11 billion kroner in deductions, either because people don’t know what they are entitled to, or because the process is simply too cumbersome. Tax Helper wants to change that.  By Aske Buemann Taxes and deductions can give many a blank look in their eyes. Therefore, two entrepreneurs will now help people find … The post New startup wants to help Danes get 11 billion in forgotten tax deductions appeared first on Nordic Startup News .",
    "published": "Wed, 10 Jun 2020 18:07:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Danish startup PackitUp launches a platform to help in the Coronavirus pandemic",
    "link": "https://nordicstartupnews.com/danish-startup-packitup-launches-a-platform-to-help-in-the-coronavirus-pandemic/",
    "summary": "Copenhagen-based travel startup, PackitUp, is on a mission to provide help in the time of Coronavirus crisis. The team turned their existing social network platform into BringHero help platform, where people can either offer or request for help during the COVID-19 pandemic.  By Ira Leino The platform functions worldwide on voluntary-basis, and therefore, is completely … The post Danish startup PackitUp launches a platform to help in the Coronavirus pandemic appeared first on Nordic Startup News .",
    "published": "Wed, 13 May 2020 10:23:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "How Estonia Became A Tech Startup Nation",
    "link": "https://nordicstartupnews.com/how-estonia-became-a-tech-startup-nation/",
    "summary": "Situated in Northern Europe, Estonia is home to around 325 million people. Back in 1991, when Estonia gained independence from the Soviet Union, it was a relatively poor country. However, this relatively small country, that includes around 1500 islands, has slowly but surely made its mark by evolving into a top startup nation. But how … The post How Estonia Became A Tech Startup Nation appeared first on Nordic Startup News .",
    "published": "Tue, 07 Apr 2020 13:05:25 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Guest post:  Remote development teams in the Nordics",
    "link": "https://nordicstartupnews.com/guest-post-remote-development-teams-in-the-nordics/",
    "summary": "Countries all over the globe incline to hiring developers for startups as their business model as it is a modern, proactive, and effective solution in the business world. With remote employees that work for your project from around the world, you get maximum efficiency and cut costs considerably. But can this scenario be applied to … The post Guest post:  Remote development teams in the Nordics appeared first on Nordic Startup News .",
    "published": "Mon, 16 Mar 2020 13:50:09 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Accelerate Estonia & Garage 48 organize hackathon against coronavirus",
    "link": "https://nordicstartupnews.com/accelerate-estonia-garage-48-organize-hackathon-against-coronavirus/",
    "summary": "The accelerator program Accelerate Estonia and Garage48 organized an online hackathon to develop solutions to help Estonia emerge from the coronavirus crisis and create competitive advantages for the post-crisis period. By Elis Tootsman The initiative, which has become the largest online hackathon in Estonia, was opened by President Kersti Kaljulaid and Minister of Foreign Trade … The post Accelerate Estonia & Garage 48 organize hackathon against coronavirus appeared first on Nordic Startup News .",
    "published": "Mon, 16 Mar 2020 13:34:06 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Recap: The Nordics at Shenzhen Hi-Tech Fair",
    "link": "https://nordicstartupnews.com/recap-the-nordics-at-shenzhen-hi-tech-fair/",
    "summary": "In late 2019, 40 companies from across the Nordics traveled to Shenzhen, China, to join the Shenzhen Hi-Tech Fair. This a 500,000+ attendee event, one of the largest in the world, is a hotbed of the latest technology. The Nordic China Startup Forum (NCSF), a community-run initiative supporting Sino-Nordic collaboration in the startup ecosystem, joined … The post Recap: The Nordics at Shenzhen Hi-Tech Fair appeared first on Nordic Startup News .",
    "published": "Thu, 09 Jan 2020 14:31:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norway’s Playpulse launches in China, part of a growing trend of Nordic startups in Shenzhen",
    "link": "https://nordicstartupnews.com/norways-playpulse-launches-in-china-part-of-a-growing-trend-of-nordic-startups-in-shenzhen/",
    "summary": "Norwegian startup Playpulse has successfully launched their gaming bikes in an activity park for children in a shopping mall in Shenzhen, China, part of the China Bay Area and a major startup hub. The company’s mission is to turn exercise into a fully-fledged computer gaming experience, boosting exercise motivation and battling sedentary lifestyles across the … The post Norway’s Playpulse launches in China, part of a growing trend of Nordic startups in Shenzhen appeared first on Nordic Startup News .",
    "published": "Tue, 07 Jan 2020 13:26:02 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The role of blockchain in the Scandinavian gaming industry",
    "link": "https://nordicstartupnews.com/role-blockchain-scandinavian-gaming-industry/",
    "summary": "Scandinavia is known for implementing the newest innovations in many fields, including gaming. Current global entertainment tends are about applying crypto and improving blockchain-powered systems, and Scandinavia is among the leaders in doing so. By Julia Beyers Scandinavia is a pretty attractive region for blockchain developers who seek investments and cheap energy. Both regular people … The post The role of blockchain in the Scandinavian gaming industry appeared first on Nordic Startup News .",
    "published": "Sat, 30 Nov 2019 09:37:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Japanese investors are favoring Finland and Estonia",
    "link": "https://nordicstartupnews.com/japanese-investors-are-favoring-finland-and-estonia/",
    "summary": "New report on Japanese Investments launched last week at Slush shows that when it comes to Japanese investments going in to the Nordic regions, Finland & Estonia is leading.  The report was made by Innovation Lab Asia, Nordic Ninja VC and Copenhagen Capacity. According to the report, since 2013, 22 of the 36 Japanese investments … The post Japanese investors are favoring Finland and Estonia appeared first on Nordic Startup News .",
    "published": "Fri, 29 Nov 2019 14:32:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Nordic AI companies join”Digital future for Europe” manifesto released at Slush 2019",
    "link": "https://nordicstartupnews.com/nordic-ai-companies-joindigital-future-for-europe-manifesto-released-at-slush-2019/",
    "summary": "A new coalition of European startups, unicorns, think tanks, and trade associations has launched a manifesto for startups and innovation at Slush. This manifesto, arguing for a ‘digital future for Europe’ is a direct response to the European Commission’s plans to regulate European tech.  This comes as the new EU Commission has received final approval … The post Nordic AI companies join”Digital future for Europe” manifesto released at Slush 2019 appeared first on Nordic Startup News .",
    "published": "Fri, 29 Nov 2019 10:45:01 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Startups in Helsinki and Stockholm lead Nordics on global outlook",
    "link": "https://nordicstartupnews.com/startups-in-helsinki-and-stockholm-lead-nordics-on-global-outlook/",
    "summary": "Whether or not a startup scales has a lot to do with their motivation. A new report -— published by Nesta as part of the Startup Europe Partnership -— shows that there is substantial variation in entrepreneurs’ motivations to grow and seek finance across Europe. How do Nordic startups fare compared to their European counterparts? … The post Startups in Helsinki and Stockholm lead Nordics on global outlook appeared first on Nordic Startup News .",
    "published": "Sat, 23 Nov 2019 09:30:59 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Fintech startup EnFuce raises €10 million for sustainability service",
    "link": "https://nordicstartupnews.com/fintech-startup-enfuce-raises-e10-million-for-sustainability-service/",
    "summary": "Finland’s Enfuce secures €10 million from Maki.vc to launch a sustainability service, MyCarbon Action, a service for banks and financial service providers to help customers track their carbon footprint per purchase. Finnish payment service provider Enfuce has today announced its new funding round of €10M, led by the early-stage VC firm Maki.vc and including venture … The post Fintech startup EnFuce raises €10 million for sustainability service appeared first on Nordic Startup News .",
    "published": "Fri, 22 Nov 2019 07:51:28 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Iceland’s Álfur Brewery tackles food waste",
    "link": "https://nordicstartupnews.com/icelands-alfur-brewery-tackles-food-waste/",
    "summary": "Álfur Brewery, an Icelandic nanobrewery, is on a mission to bring sustainability to Icelandic beer. The team recently completed the Til Sjávar og Sveita accelerator program organized by Icelandic Startups for companies creating innovative solutions in agriculture and fisheries. Co-founder Haukur Páll Finnsson came up with the idea after having a conversation with his family … The post Iceland’s Álfur Brewery tackles food waste appeared first on Nordic Startup News .",
    "published": "Tue, 05 Nov 2019 13:49:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sweden’s Creandum wins VC fund of the year",
    "link": "https://nordicstartupnews.com/swedens-creandum-wins-vc-fund-of-the-year/",
    "summary": "The Creandum funds won the “Venture Capital Fund of the Year” award at the 17th Investor Allstars event last night distinguished with the honors due to the outstanding performance over the previous year driven by exits from Spotify, iZettle, Small Giant Games, and Elastic. According to industry experts, the Creandum II fund is the best … The post Sweden’s Creandum wins VC fund of the year appeared first on Nordic Startup News .",
    "published": "Mon, 07 Oct 2019 09:39:33 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Copenhagen opens new automated metro",
    "link": "https://nordicstartupnews.com/copenhagen-opens-new-automated-metro/",
    "summary": "The Copenhagen Metro is getting an extension, a 15.5km line called the Cityringen Metro. The Cityringen Metro is set to open soon, upgrading Copenhagen’s already efficient metro system. The expected opening date is September 29, 2019.  The project of Cityringen Metro uses modern technology, setting it apart as an automated metro line. The driverless trains … The post Copenhagen opens new automated metro appeared first on Nordic Startup News .",
    "published": "Mon, 02 Sep 2019 12:04:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "From linear to circular: Six green startups that will change our economy",
    "link": "https://nordicstartupnews.com/linear-circular-six-green-startups-will-change-economy/",
    "summary": "From more than 200 startups, only six were chosen to pitch at the finals of the Green Alley Awards, An award that aims to turn the linear economy into a circular economy. Even though there was only one winner, all six startups are worth keeping an eye on. Often it is the newcomers, the small, … The post From linear to circular: Six green startups that will change our economy appeared first on Nordic Startup News .",
    "published": "Thu, 22 Aug 2019 08:17:31 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New EU project aims to help startups enter innovations into public procurement processes",
    "link": "https://nordicstartupnews.com/new-eu-project-aims-to-help-startups-enter-innovations-into-public-procurement-processes/",
    "summary": "Is your startup willing to be challenged by purchasers in the public administrations? If so, get in touch Innobrokers, an EU-funded project, aiming at facilitating the procurement of innovative goods and services by strengthening the links between public buyers on the demand side and innovative companies on the supply side. The project addresses startups and … The post New EU project aims to help startups enter innovations into public procurement processes appeared first on Nordic Startup News .",
    "published": "Wed, 12 Jun 2019 10:31:08 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "5 Nordic mar-tech startups to watch",
    "link": "https://nordicstartupnews.com/5-nordic-mar-tech-startups-to-watch/",
    "summary": "Buoyed by the immense growth of ecommerce, the martech industry continues to go from strength to strength. In the Nordics, Sweden has already established a healthy set of martech companies. If you want to know what to expect from the future of martech in the Nordic countries, keep an eye on these 5 Nordic martech … The post 5 Nordic mar-tech startups to watch appeared first on Nordic Startup News .",
    "published": "Wed, 12 Jun 2019 07:40:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Vilnius positions itself as a global startup ecosystem competitor",
    "link": "https://nordicstartupnews.com/vilnius-positions-itself-as-a-global-startup-ecosystem-competitor/",
    "summary": "At Startup Fair Lithuania last week, the city of Vilnius touted it’s position as a city-sized sandbox to develop and test new products.  A radical open data policy that rivals Estonia’s and a slew of startup friendly regulations make Vilnius a startup ecosystem to watch. Startup Fair Lithuania, an annual event bringing together the local … The post Vilnius positions itself as a global startup ecosystem competitor appeared first on Nordic Startup News .",
    "published": "Thu, 06 Jun 2019 11:03:34 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Is Austin a viable landing pad for Nordic startups in the USA?",
    "link": "https://nordicstartupnews.com/is-austin-a-viable-landing-pad-for-nordic-startups-in-the-usa/",
    "summary": "There are 100s of accelerators, incubators and co-working spaces in Austin. Austin is also the growth capital of USA, with approximately 150 people moving to Austin every day, of which approximately 100 are moving from the California’s Bay Area. But is it a viable landing pad for Nordic startups? At SXSW 2019, Nordic Startup Bits … The post Is Austin a viable landing pad for Nordic startups in the USA? appeared first on Nordic Startup News .",
    "published": "Thu, 06 Jun 2019 08:52:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s VertaaEnsin is building a Momondo for financial services",
    "link": "https://nordicstartupnews.com/finlands-vertaaensin-is-building-a-momondo-for-financial-services/",
    "summary": "Today, there are more banking options available than ever before. VertaaEnsin is on a mission to consolidate all financial products in one platform. “Financial products constitute the largest part of our monthly expenses. What is interesting, is that consumers are very familiar with comparing flights and other easy-to-understand products and services. We like making informed … The post Finland’s VertaaEnsin is building a Momondo for financial services appeared first on Nordic Startup News .",
    "published": "Wed, 05 Jun 2019 11:08:49 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "An interview with Inka Mero, founding partner of first Nordic VC focused purely on deeptech",
    "link": "https://nordicstartupnews.com/an-interview-with-inka-mero-founding-partner-of-first-nordic-vc-focused-purely-on-deeptech/",
    "summary": "This month, the first VC in the Nordics focusing purely on startups with a background in deeptech and science launched.  Headed by serial entrepreneur Inka Mero, Voima Ventures targeting a final closing of €50 million and has already announced commitments at €40 million. The fund’s press release states that their mission is to build a … The post An interview with Inka Mero, founding partner of first Nordic VC focused purely on deeptech appeared first on Nordic Startup News .",
    "published": "Tue, 04 Jun 2019 07:26:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New Investor PINC focused on Nordic FoodTech Startups",
    "link": "https://nordicstartupnews.com/new-investor-pinc-focused-on-nordic-foodtech-startups/",
    "summary": "PINC is Paulig Group’s corporate venture capital unit. We sat down with the head of PINC, Marika King, for a Q&A to learn more about their investment thesis and how they’re shaping the future of taste. What is PINC? PINC stands for Paulig Incubator and is the innovation and venture arm for radical innovation within … The post New Investor PINC focused on Nordic FoodTech Startups appeared first on Nordic Startup News .",
    "published": "Fri, 31 May 2019 07:40:14 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Accel raises $575 million for early stage companies in Nordics and Israel",
    "link": "https://nordicstartupnews.com/accel-raises-575-million-for-early-stage-companies-in-nordics-and-israel/",
    "summary": "Accel raises a $575 million fund to back ambitious founders in Europe and Israel. The Nordics are a key market for this new fund.The Nordics will be a key market for investment Last week, Accel, a global VC firm, announced that it has raised a $575 million fund, its sixth to be invested in early … The post Accel raises $575 million for early stage companies in Nordics and Israel appeared first on Nordic Startup News .",
    "published": "Mon, 20 May 2019 13:15:53 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "The Nordics get a new €50M deep tech fund",
    "link": "https://nordicstartupnews.com/the-nordics-get-a-new-e50m-deep-tech-fund/",
    "summary": "Serial entrepreneur Inka Mero launches Voima Ventures, the first VC fund in the Nordics with a focus purely on startups with deep tech and science background The first VC in the Nordics focusing purely on startups with deep tech and science background was launched officially today. Voima Ventures’ cornerstone investors are VTT Technical Research Centre … The post The Nordics get a new €50M deep tech fund appeared first on Nordic Startup News .",
    "published": "Mon, 29 Apr 2019 14:17:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "€100M NordicNinja VC fund officially launches operations in the Nordics and Baltics",
    "link": "https://nordicstartupnews.com/e100m-nordicninja-vc-fund-officially-launches-operations-nordics-baltics/",
    "summary": "NordicNinja VC by JB Nordic Ventures has officially launched its new €100M VC fund in partnership with Panasonic, Honda, Omron, and the Japan Bank for International Cooperation (JBIC). The fund will help Nordic and Baltic scale-up companies enter the technology business ecosystem in Japan and across Asia. “Today, the Nordic startup ecosystem and Japanese blue-chip … The post €100M NordicNinja VC fund officially launches operations in the Nordics and Baltics appeared first on Nordic Startup News .",
    "published": "Fri, 22 Feb 2019 13:23:17 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Media Honeypot 2019: Media startups connect with legacy companies, but struggle to get funding",
    "link": "https://nordicstartupnews.com/media-honeypot-2019-media-startups-connect-legacy-companies-struggle-get-funding/",
    "summary": "The Media Honeypot series of events started in Helsinki in 2016. Now, three years, and several events later, it the go-to event for media startups.  Heikki Rotko, the founder of Media Honeypot, says that Media Honeypot was born out of a desire to connect startups with their business partners to create the media we as … The post Media Honeypot 2019: Media startups connect with legacy companies, but struggle to get funding appeared first on Nordic Startup News .",
    "published": "Fri, 22 Feb 2019 13:14:11 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Slush Tokyo’s Global Gathering supports global ecosystem ambitions",
    "link": "https://nordicstartupnews.com/slush-tokyos-global-gathering-supports-global-ecosystem-ambitions/",
    "summary": "Slush, one of Europe’s largest startup events, has been expanding globally for the past few years and last year held the first ever Slush Tokyo.  At Slush Tokyo 2019, a pre-event called the “Global Gathering” was held to better promote connections between global tech ecosystems. Ms. Haruka Furukawa(CEO, Slush Tokyo), Ms. Kristina Nummila ( Slush … The post Slush Tokyo’s Global Gathering supports global ecosystem ambitions appeared first on Nordic Startup News .",
    "published": "Wed, 20 Feb 2019 11:10:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Amazon, Netflix and Google will meet the President of Estonia to talk about data and AI adoption in Europe",
    "link": "https://nordicstartupnews.com/amazon-netflix-google-will-meet-president-estonia-talk-data-ai-adoption-europe/",
    "summary": "Artificial Intelligence champions from top technology companies Netflix, Spotify, Amazon, Google DeepMind, Nvidia, Taxify, Microsoft, Starship etc will meet at North Star AI, Applied Machine Learning and Data Conference on March 7 in Tallinn, Estonia to discuss how organizations and startups with limited resources can benefit from data and AI adoption President of Estonia Kersti … The post Amazon, Netflix and Google will meet the President of Estonia to talk about data and AI adoption in Europe appeared first on Nordic Startup News .",
    "published": "Mon, 04 Feb 2019 12:44:14 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Top expected applicants for Nordic Game Awards in 2019",
    "link": "https://nordicstartupnews.com/top-expected-applicants-nordic-game-awards-2019/",
    "summary": "The Nordic Game Awards (NGA) ceremony takes place during Nordic Game Conference (NG) – the largest annual gaming conference in Northern Europe. NG was first held in 2004 in Malmö, but NGA was introduced only in 2007. The event gathers more than 2000 game-related experts, programmers, designers, managers, and entrepreneurs from Denmark, Finland, Iceland, Norway, … The post Top expected applicants for Nordic Game Awards in 2019 appeared first on Nordic Startup News .",
    "published": "Mon, 28 Jan 2019 10:20:49 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Reducing food waste is on the agenda as Nordics gain stronghold in foodtech innovations",
    "link": "https://nordicstartupnews.com/reducing-food-waste-agenda-nordics-gain-stronghold-foodtech-innovations/",
    "summary": "Nordic Startup Bits sat down for an interesting talk about the foodtech startup scene at SLUSH in December with Accelerace’s Investment Manager, Business Accelerator and Head of Venture Scouting Martin Holmboe. Accelerace is the Nordics’ leading startup accelerator and pioneering in the corporate – startup matchmaking space. Martin has many years of experience as a … The post Reducing food waste is on the agenda as Nordics gain stronghold in foodtech innovations appeared first on Nordic Startup News .",
    "published": "Mon, 28 Jan 2019 10:15:47 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "From venture capital to peace capital: One startup wants to encourage cooperation with the food that we share",
    "link": "https://nordicstartupnews.com/venture-capital-peace-capital-one-startup-wants-encourage-cooperation-food-share/",
    "summary": "The founder of the startup Colive wants to use premium Cypriot olive oil to spark global conversations about peace. He connects family farms on both sides of the UN Buffer Zone to create the first product in what he hopes will be an entire line of culturally significant ingredients and foods to encourage cooperation. That … The post From venture capital to peace capital: One startup wants to encourage cooperation with the food that we share appeared first on Nordic Startup News .",
    "published": "Tue, 15 Jan 2019 10:21:18 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finnish foodtech startup Epic Foods opens virtual restaurant",
    "link": "https://nordicstartupnews.com/finnish-foodtech-startup-epic-foods-opens-virtual-restaurant/",
    "summary": "This year at Slush – one of Europe’s largest tech summits, Nordic Startup Bits wanted to take a closer look at some interesting FoodTech startups. We met one of the most exciting entrepreneurs in this scene, Martti Paatela, a former rocket scientist and now CEO and co-founder of the Finish FoodTech startup Epic Foods. According … The post Finnish foodtech startup Epic Foods opens virtual restaurant appeared first on Nordic Startup News .",
    "published": "Tue, 15 Jan 2019 08:26:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "New €100m Japanese VC fund backs startups in Nordics and Baltics starting in 2019",
    "link": "https://nordicstartupnews.com/new-e100m-japanese-vc-fund-backs-startups-nordics-baltics-starting-2019/",
    "summary": "BaltCap, together with JBIC IG Partners, a Japanese government backed private equity and venture capital firm, is establishing a new €100m fund focusing on venture capital investments in the field of industrial technology in the Nordic and Baltic region. The fund was announced at Slush 2018 and is launching this year. JB Nordic Ventures is a … The post New €100m Japanese VC fund backs startups in Nordics and Baltics starting in 2019 appeared first on Nordic Startup News .",
    "published": "Wed, 02 Jan 2019 09:49:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Belgian startup Husky  on what they learned from the Nordic startup culture",
    "link": "https://nordicstartupnews.com/belgian-startup-husky-learned-nordic-startup-culture/",
    "summary": "Husky is a Belgian startup, designed to bundle marketers’ needs in one digital tool. It is made by marketers, for marketers. A digital platform like Husky allows you to plan and organize quickly. Managing tasks, projects and communication gets easier. In a recent talk, CEO Peter Desmyttere explains what he learned from the Nordic startup … The post Belgian startup Husky  on what they learned from the Nordic startup culture appeared first on Nordic Startup News .",
    "published": "Mon, 26 Nov 2018 15:37:26 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Pitching in Georgia – a hidden market for tech travel startups?",
    "link": "https://nordicstartupnews.com/pitching-georgia-hidden-market-tech-travel-startups/",
    "summary": "Estonian travel startup Guide.me recently competed in the Welcome Challenge, a tourism-focused pitching competition in the country of Georgia. The rapid growth in tourism activities in Georgia is a major reason why investors sees Georgia as “currently underserved” by Nordic startups. Which industry employs one in ten people globally and accounts for ten percent of the … The post Pitching in Georgia – a hidden market for tech travel startups? appeared first on Nordic Startup News .",
    "published": "Mon, 26 Nov 2018 15:25:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sweden’s Included.Works launches a new service answering companies’ need of diversity.",
    "link": "https://nordicstartupnews.com/swedens-included-works-launches-new-service-answering-companies-need-diversity/",
    "summary": "The founders behind Sweden’s Included.Works, the platform that helps companies with recruiting through crowdsourcing, have developed a new service: ProgressData.io. The service makes it possible for companies to keep track of diversity within their company and give insight into how they can develop it. “We started addressing the problem with homogenous companies with our recruiting … The post Sweden’s Included.Works launches a new service answering companies’ need of diversity. appeared first on Nordic Startup News .",
    "published": "Mon, 12 Nov 2018 08:33:57 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s Repack wins Green Alley Awards: Going green can be good business",
    "link": "https://nordicstartupnews.com/finlands-repack-wins-green-alley-awards-going-green-can-good-business/",
    "summary": "Today, companies are obliged to reuse and recycle both from political frameworks and from consumer demands. How does one turn obligations into opportunities? The  Green Alley Award was created specifically to honor the startups in the circular economy that turn waste into a resource and are not afraid to make money and scale. Because it … The post Finland’s Repack wins Green Alley Awards: Going green can be good business appeared first on Nordic Startup News .",
    "published": "Wed, 31 Oct 2018 08:29:42 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Norway’s Spiff app promotes “social saving”",
    "link": "https://nordicstartupnews.com/norways-spiff-app-promotes-social-saving/",
    "summary": "Spiff app, a Norwegian app soft-launched on iOS this summer, became available for Android users  last week to promote “social saving”, and is the first company to bring this concept to the Norwegian market. Carl-Nicolai Wessmann, Founder & CEO of Spiff, said in a press release: “We are the first to bring the concept of … The post Norway’s Spiff app promotes “social saving” appeared first on Nordic Startup News .",
    "published": "Fri, 12 Oct 2018 11:28:32 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Record-breaking Danish startup Airtame launches new product, Airtame 2",
    "link": "https://nordicstartupnews.com/record-breaking-danish-startup-airtame-launches-new-product-airtame-2/",
    "summary": "Airtame, a Danish startup that produces a wireless HDMI solution for both the business and education sectors, has announced the launch of their second generation hardware product, Airtame 2. The company started in 2014 with a record-­breaking crowdfunding campaign and a mission to remove cables in professional environments. The new product will deliver much more … The post Record-breaking Danish startup Airtame launches new product, Airtame 2 appeared first on Nordic Startup News .",
    "published": "Wed, 10 Oct 2018 09:17:43 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Klarna continues to strive for improvement",
    "link": "https://nordicstartupnews.com/klarna-continues-strive-improvement/",
    "summary": "Once upon a time, Klarna was a simple startup based in Sweden. It emerged in Stockholm in 2005, and basically facilitated one-click online purchasing via email and postcode. By Anne Gibbons Klarna has since become one of the most influential fintech companies in Europe, but for those who don’t use it, the process is straightforward. … The post Klarna continues to strive for improvement appeared first on Nordic Startup News .",
    "published": "Tue, 09 Oct 2018 12:33:31 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Vesterbacka introduces new opportunities to Tartu startup and business communities",
    "link": "https://nordicstartupnews.com/vesterbacka-introduces-new-opportunities-tartu-startup-business-communities/",
    "summary": "Peter Vesterbacka, one of the founders of Angry Birds mobile game and the biggest technology conference in north Europe – Slush, will visit Tartu from 03-04. October. The purpose of the two day visit is to introduce new educational and business opportunities to Tartu start-up community and local entrepreneurs, and to increase regional cooperation between … The post Vesterbacka introduces new opportunities to Tartu startup and business communities appeared first on Nordic Startup News .",
    "published": "Tue, 02 Oct 2018 14:45:56 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Get Sandwich is Nominated for Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/get-sandwich-nordic-startup-awards/",
    "summary": "Make the World Listen to You Get Sandwich is a startup that wants to help people who are struggling with public speaking by providing them with a library of authentic practice videos. The startup was founded in 2017 by Min’an Tan and Martha Winata, who were also struggling with their public speeches. They believe that … The post Get Sandwich is Nominated for Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:52:35 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Sensative is Nominated for Best Bootstrapped Startup Award by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/sensative-nordic-startup-awards/",
    "summary": "Making Your Home Smart Has Never Been Easier Swedish startup Sensative has created the world’s thinnest door and window sensor. The Strips sensor is a very flexible and accurate Z-Wave sensor that notifies users when something is wrong thanks to its connection to other smart devices in the home. The startup also offers other IoT … The post Sensative is Nominated for Best Bootstrapped Startup Award by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:31:47 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Kontigo Care is Nominated for Best Social Impact Startup/Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/kontigo-care-nordic-startup-awards/",
    "summary": "The Future of Addiction Treatment Is Digital Kontigo Care follows the personal journey of its founder, Daniel Benitez, who during his alcohol addiction treatment struggled with alcohol relapses even though he received good treatment. He has not been the only case though. Finding out that traditionally 8 out of 10 patients will relapse into addiction, … The post Kontigo Care is Nominated for Best Social Impact Startup/Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:26:04 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Travable is Nominated for Best Bootstrapped Startup/Best Social Impact Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/travable-nordic-startup-awards/",
    "summary": "People with Disabilities Are Missing out Places and Events Because of Lack of Info Disabled people who travel might find themselves in an uncharted area full of obstacles and miss places worth visiting just because these locations lack information about accessibility. Now, Travable, a mobile application from an Icelandic startup with the same name is … The post Travable is Nominated for Best Bootstrapped Startup/Best Social Impact Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 08:22:24 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Evispot is Nominated for Best FinTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/evispot-nordic-startup-awards/",
    "summary": "The Risk of Making a Bad Business Decision When Lending Can Be Reduced by Using AI Waiting to know the fate of a credit request by sitting on a chair in a bank and facing a clerk across the desk might soon become a thing of the past. In an era when so many things … The post Evispot is Nominated for Best FinTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Fri, 21 Sep 2018 07:23:13 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "TRINE is Nominated for Best Social Impact Startup and Startup of the Year by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/trine-nordic-startup-awards/",
    "summary": "TRINE, the Crowdfunding Platform That Has Helped Nearly 230 Thousand People Get Access to Clean Energy Crowdfunding today is another global trend that is growing continuously. Since its emergence in the late 2000s, it has become popularized due to the individual’s decision-making process as one of the main features, and its viral nature, as it … The post TRINE is Nominated for Best Social Impact Startup and Startup of the Year by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 13:34:05 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Heartstrings is Nominated for Best AI/Machine Learning Startup/Best HealthTech Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/heartstrings-nordic-startup-awards/",
    "summary": "Technology in a Mission for Preventing Heart Diseases “Our vision is saving at least 1 million lives each year,” say the creators of Heartstrings, Allen and Max Mohammadi, and with a vision this concrete and ambitious, is a company not set for success? Their idea, which was born after seeing a senior individual at a … The post Heartstrings is Nominated for Best AI/Machine Learning Startup/Best HealthTech Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 13:27:03 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Bookboost is Nominated for Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/bookboost-nordic-startup-awards/",
    "summary": "How Can Hotels Improve Their Guest Journey with Bookboost? Businesses today are facing new challenges posed mainly by the changing customer behaviour. New trends are being set by the millennials, dubbed the “experience generation”, whose expectations are primarily based on experiences rather than the sense of ownership. This generation has, as such, affected the creation … The post Bookboost is Nominated for Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 13:07:37 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Zadaa is Nominated for Best Social Impact Startup by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/zadaa-nordic-startup-awards/",
    "summary": "Zadaa fights fast and unsustainable fashion with an app Fast fashion has become yet another challenge in dealing with sustainability or the lack there of, which is why we’ve been seeing a palate of initiatives that try to tackle this issue. These initiatives, transform in tech-based solutions very often, and a perfect example is the … The post Zadaa is Nominated for Best Social Impact Startup by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 12:58:38 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Teatime Games is Nominated for Startup of the Year/Best Newcomer by Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/teatime-games-nordic-startup-awards/",
    "summary": "Mobile Games Going More Social Is the New Gaming Trend By believing that mobile game players will find a more social and personalized experience while playing very satisfactory, the Icelandic startup Teatime Games is aiming to revolutionize the mobile gaming landscape. The four founders, Thor Fridriksson, Gunnar Holmsteinn, Johann Thorvaldur Bergthorsson, and Ymir Finnbogason call … The post Teatime Games is Nominated for Startup of the Year/Best Newcomer by Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 20 Sep 2018 12:49:23 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Social impact startup Sp8ces joins Katapult Accelerator to modernize working spaces",
    "link": "https://nordicstartupnews.com/62382/",
    "summary": "The Danish startup Sp8ces has been accepted as one of twelve startups for the Norwegian accelerator program Katapult, following an intensive 2 months long application process, where the accelerator screened more than 1500 startup applicants. Katapult is an impact focused accelerator, and are taking in startups that are working on a solution or product, which … The post Social impact startup Sp8ces joins Katapult Accelerator to modernize working spaces appeared first on Nordic Startup News .",
    "published": "Sun, 09 Sep 2018 12:52:30 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Former airport becomes creative retreat in Lofoten, Norway",
    "link": "https://nordicstartupnews.com/former-airport-becomes-creative-retreat-lofoten-norway/",
    "summary": "50 people have joined forces to build a unique creative retreat out of the former airport on the idyllic island in the Northern Norway, Lofoten.  Here, in the intersection of nature, sky and ocean, tech, gaming and art you can explore and create. Where is it? Værøy is an island in the Lofoten Islands archipelago … The post Former airport becomes creative retreat in Lofoten, Norway appeared first on Nordic Startup News .",
    "published": "Thu, 30 Aug 2018 17:56:46 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "Finland’s OURA Ring: sleep tracking wearables",
    "link": "https://nordicstartupnews.com/finlands-oura-ring-sleep-tracking-wearables/",
    "summary": "Finland’s OURA ring takes a stab at the wearables market with a  “smart ring” this wearable offers a variety of features and functionality unrivaled in the space, particularly when it comes to sleep tracking. The company claims it’s the “world’s most advanced wearable for getting more restorative sleep.” What exactly is it though, outside of … The post Finland’s OURA Ring: sleep tracking wearables appeared first on Nordic Startup News .",
    "published": "Thu, 30 Aug 2018 17:49:44 +0000",
    "source": "Nordic Startup News"
  },
  {
    "title": "50skills is Nominated for 2018 Nordic Startup Awards",
    "link": "https://nordicstartupnews.com/50skills-nordic-startup-awards/",
    "summary": "Automating the Hiring Process with 50skills Hiring new people and expanding the team is certainly a mark of progress, but it nevertheless adds to the company costs. The Society for Human Resource Management (SHRM) estimates the costs related to new hiring at $4,129, while also pointing out that the average time for filling in a … The post 50skills is Nominated for 2018 Nordic Startup Awards appeared first on Nordic Startup News .",
    "published": "Thu, 23 Aug 2018 11:59:29 +0000",
    "source": "Nordic Startup News"
  }
]